{"organizations": [], "uuid": "a1814df5dbac5a64c4711fd7e3853de113a616e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/54/71/ae/golden-snail-cottage.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g293841-d6959621-Reviews-Malakai_Eco_Lodge-Kampala_Central_Region.html", "section_title": "Malakai Eco Lodge - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Kampala, Uganda) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g293841-d6959621-r464034026-Malakai_Eco_Lodge-Kampala_Central_Region.html", "country": "US", "domain_rank": 189, "title": "Shabby", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Shabby - Review of Malakai Eco Lodge, Kampala, Uganda - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-02T02:00:00.000+02:00", "replies_count": 0, "uuid": "a1814df5dbac5a64c4711fd7e3853de113a616e5"}, "author": "ajs245", "url": "https://www.tripadvisor.com/ShowUserReviews-g293841-d6959621-r464034026-Malakai_Eco_Lodge-Kampala_Central_Region.html", "ord_in_thread": 0, "title": "Shabby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I cannot understand the positive reviews this place has received.\nWhen we arrived we were told to leave our bags in the restaurant area and go to view our room to see if we wanted to upgrade. This immediately set alarm bells ringing. The ‘budget’ room we were shown was totally unacceptable. It didn’t have proper walls, so although there was a mosquito net over the bed, the windows were open to the outside. One wall of the room was just wooden bars, so anyone could have just clambered in. We were told that as we had purchased a budget room, this was what we had been allocated, but we could pay to upgrade to an actual room with walls. Apparently most people upgrade (obvious why).\nWe refused to pay extra but upon complaining they upgraded us to a poolside room for free. None of the rooms have doors on the bathrooms, which when sharing a room is awkward. One we were shown just had a movable screen to put infront of the toilet when you wanted to use it. We eventually accepted the third room we were shown. This was ok until we later spotted a large cockroach in the shower. This was likely because the staff leave all the doors and windows open most of the time, so mosquitoes and bugs can wander in. We were then moved into another room which had an egg-shaped bed and coloured lighting – they apparently charge $150/night for this. I am glad we didn’t pay more than the £29 we’d already agreed, as it definitely wasn’t worth $150.\nWe ate dinner in the restaurant that night. We had curries which were average but were pleased when the glasses of red wine we ordered were very large. Less happy however when it transpired it was only 8.5% alcohol. In contrast, breakfast was very tasty: fresh juices, fruit, cooked breakfast to order and breads & spreads.\nThe staff were unhelpful throughout and didn’t seem to care that we were unhappy. Janet in particular was unpleasant and borderline aggressive. I definitely wouldn’t stay here again and I don’t recommend you do.", "external_links": [], "published": "2017-03-02T02:00:00.000+02:00", "crawled": "2017-03-27T16:28:58.633+03:00", "highlightTitle": ""}