{"organizations": [], "uuid": "b53d07a265f969db89c16b0c36f598891f915889", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/d0/b9/15/exectuive-king-with-balcony.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g48080-d1986116-Reviews-Hotel_Vetiver-Long_Island_City_Queens_New_York.html", "section_title": "Hotel Vetiver - UPDATED 2017 Reviews &amp; Price Comparison (Long Island City, New York) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g48080-d1986116-r471224315-Hotel_Vetiver-Long_Island_City_Queens_New_York.html", "country": "US", "domain_rank": 189, "title": "Not as nice as pictured - Review", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Not as nice as pictured - Review of Hotel Vetiver, Long Island City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "b53d07a265f969db89c16b0c36f598891f915889"}, "author": "wanderers303", "url": "https://www.tripadvisor.com/ShowUserReviews-g48080-d1986116-r471224315-Hotel_Vetiver-Long_Island_City_Queens_New_York.html", "ord_in_thread": 0, "title": "Not as nice as pictured - Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I just got done staying here for a work trip, and waited until my trip was complete before writing a review, in case something miraculous turned my stay into a pleasant one -- alas, it was not meant to be. When I got in, after a long day of traveling, I ended up waiting for the front desk agent to finish a phone call , and then he asked me to sit down away from the desk while he completed my check-in process (I'm not sure why...). The lobby is run-down and dirty, and was blasting loud music at midnight -- I already felt somewhat uncomfortable, but I went up to my room anyway. After taking the slow elevator up, I went into my room -- which was quite large, as I'd paid for a larger room -- and pulled back the sheets. First, I saw a stain on the pillow. Disgusted, I tossed it off the bed, since I just wanted to go to sleep, and hoped to ignore ever having seen it. But then there were more stains (bodily, it appeared...) underneath the pillows and throughout the rest of the sheets. As badly as I just wanted to go to sleep, I called down to the desk to see if they had any other clean rooms that I could move to. The front desk agent was very nice and apologetic, and said that he would send someone up with clean linens. I did not exactly want to wait to have someone make my bed, but with the alternative of sleeping standing up, I agreed. Another guy arrived at my door sometime later -- also apologetic, but with no clean linens, and with very few English skills for us to discuss what I needed rectified. Because we could not get it figured out, I packed up my stuff to go back downstairs and request a new room. After some time (and many apologies -- the desk agent was nice enough), I was sent to a new room. It was TINY. I realize it was probably the only one left, but I was not reimbursed for the difference in the rooms for which I'd prepaid an upgrade. The room I was in had a closet for a bathroom, a bed that was only a foot from all the walls around it, no space except for the tiny desk for me to open my suitcase on, and did not even have a deadbolt for me, a woman traveling alone, to lock myself in. I did not inspect this room or its sheets very closely as I really just wanted to go to sleep, but that was not to be, either. For both nights of my stay, I was awoken by door after door after door slamming. I'm not sure how there were so many doors, with a floor of only a few rooms! I was right on the stairwell, which may have been part of it, but it made for two long, sleepless nights. During the checkout process, the front desk agent (who was not nearly as friendly as the man on my first night, who was the only reason for even giving this place one star...), was unable to provide me with any folio or proof of my stay (which I needed for work purposes), but at that point I was happy to leave the place behind. I'm really surprised at all of the positive reviews, and the pristine photos, which had me expecting to arrive to a nice little boutique hotel, which I can certainly appreciate. Do not be fooled, however -- you'd be better off going with one of the cheap chains.", "external_links": [], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-30T23:18:38.983+03:00", "highlightTitle": ""}