{"organizations": [], "uuid": "4c494df5e3fa988b258bea7fd73bdfdeab2c7db6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/8a/f0/71/lobby-main.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99766-Reviews-The_Roosevelt_Hotel-New_York_City_New_York.html", "section_title": "The Roosevelt Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r470710193-The_Roosevelt_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Disappointing. Nice on the outside...", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Disappointing. Nice on the outside... - Review of The Roosevelt Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "4c494df5e3fa988b258bea7fd73bdfdeab2c7db6"}, "author": "Joshua D", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r470710193-The_Roosevelt_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Disappointing. Nice on the outside...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed here with my partner in March 2017. On arrival to the hotel.. it is very grand indeed, and having stayed in a number of hotels in New York City before, from the offset this initial impression was very good. However, that would be where it ended.\nI had pre-paid for the room, a standard queen room, and on dropping our stuff, being individuals of the modern age we wanted to hop on to the wifi to let our families know we'd arrived. I was VERY surprised to find out that The Roosevelt must be the only hotel left in Manhattan to not offer its guests free wifi. Something which in this day and age is somewhat a given (considering it's not exactly a bottom end hotel). I called reception to enquire, to be told not only is it not free.. it is $16 a day! In 2017. For wifi. Unbelievable. Apparently this was non-negotiable.\nI must admit the room and amenities themselves were good, clean, small - but you kind of expect this in NYC now.\nThis may also be somewhat bad timing, but the floor we were staying on seemed to be purely school children on a trip. This made for screaming children running up and down the corridor until early hours of the morning, and the paper thin walls made this quite unbearable. This topped off with a constant rattling of the air conditioning unit - despite it being turned off the whole trip (it was still basically winter after all). To then be woken up by housekeeping on 8am on a Saturday morning, following a long flight the day before? Very inconsiderate (and somewhat appalling).\nTo top things off I find a charge of $50 has been placed on my credit card by the hotel. I confront reception about this to be told this was a security deposit - absolutely fine - however common courtesy would be to tell me this on arrival.\nOverall, not the best stay. However credit where credit is due, the room was clean and the bed comfortable. I'm disappointed I can't say more than this.", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-29T06:58:33.964+03:00", "highlightTitle": ""}