{"organizations": [], "uuid": "6f41c558585b61944d4d3526f0f5d1a912ec4a71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/07/de/35/hudson-hotel-new-york.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d223023-Reviews-or60-Hudson_Hotel_New_York-New_York_City_New_York.html", "section_title": "Hudson Hotel New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d223023-r464832084-Hudson_Hotel_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Massive Disappointment", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Massive Disappointment - Review of Hudson Hotel New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 1, "uuid": "6f41c558585b61944d4d3526f0f5d1a912ec4a71"}, "author": "Sharonc1203", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d223023-r464832084-Hudson_Hotel_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Massive Disappointment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I have never been tempted to write a poor review of a hotel....until now, that is.\nFrom the moment we checked in we were made to feel about as welcome the plague. The reception staff were unhelpful and disinterested, and the person who checked us in messed up our booking which resulted our being locked out of our room - which at 1am was not at all welcome! We were then reissued keys which still did not work, and we ended up having to go from reception to the 18th floor five times, until finally the Night Manager was informed and came with us. This, of course, was a huge imposition for the reception staff member! The Night Manager then had to summon security to let us in. This took the best part of an hour. The room was comped for this evening.\nThe room wasn't particularly clean, the air con was noisy, even when switched off. We did not manage one decent night's sleep during our five night stay. The bathroom is the size of a shower cubicle so if you are tall or wide this place is not for you!\nWe agreed that most (not all, there were a couple of exceptions) of the staff here think they are way Too Cool For School. The barman with the bald head and tattoos made me feel I had mortally offended him by having the audacity to order two drinks. No eye contact, no please or thank you, and he was quite aggressive in his manner when I asked if I had offended him.\nTo top it all off, when we checked out we were charged an extra $30 per night which they told us is a 'resort fee'. This is NOT a resort (a last resort, maybe)...and this fee is totally unacceptable. Of course, it's hidden away in the small print. They didn't mention this fee to us when we checked in.\nIt's a shame, because at night time the hotel public areas come alive and look really lovely. It does get noisy but this is New York and you don't come here for peace. You do, however, expect great service and the reverse is what you get here.\nThe one positive thing about this place? The location. Needless to say I will never come back and I cannot recommend this hotel to anyone.", "external_links": [], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-30T01:56:05.392+03:00", "highlightTitle": ""}