{"organizations": [], "uuid": "a0d26d373c39cd8eeeae6a6c186a04ccd9de47d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/bd/35/b3/studio-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d192033-Reviews-or20-Radisson_Blu_Edwardian_Hampshire_Hotel-London_England.html", "section_title": "Radisson Blu Edwardian Hampshire Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192033-r466506833-Radisson_Blu_Edwardian_Hampshire_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Over-Priced, Dirty and Old-Fashioned", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Over-Priced, Dirty and Old-Fashioned - Review of Radisson Blu Edwardian Hampshire Hotel, London, England - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-12T02:00:00.000+02:00", "replies_count": 1, "uuid": "a0d26d373c39cd8eeeae6a6c186a04ccd9de47d9"}, "author": "cammy8789", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192033-r466506833-Radisson_Blu_Edwardian_Hampshire_Hotel-London_England.html", "ord_in_thread": 0, "title": "Over-Priced, Dirty and Old-Fashioned", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My husband and I visited London for a short break (2 nights/3 days), we have been down many times before but had never stayed in this part of the city.\nWe arrived at the hotel via the tube (Euston - Leicester Square), the hotel is only a 2 minute walk from the station which is ideal, this was the reason I booked this hotel in the first place.\nFrom the outside, the building is grand and traditional, nice setting.\nThe girl at the reception desk didn't speak the best English and I found her to be quite pushy, almost as though she was in a rush. We were given our keys with no offer of directions or a hint at what floor or direction we should be headed in.\nWhen you get into the lift you need to insert your card before you can select the floor, I understand security but I have stayed in lots of hotels and have never had to do this, bit embarrassing when theres a queue of people behind you.\nGot into our room and immediately regretted the decision of booking this hotel, my first thought was 'Rip-off'. We paid £538 for 2 nights and looking back I probably wouldn't even spend £120 per night.\nThe room itself was very tired, which I could handle if I wasn't paying in excess of £260 a night!\nWhat really did grate on me was how unclean it was (see photos), there was dirt and dust everywhere, the toilet was disgusting, in my eyes there is no excuse for somewhere being unclean.\nI understand that we were in central London and I can appreciate the prices but this took it to a new level. I can't believe that such a well renowned company in Radisson would be happy to offer rooms that are in such a desperate need of repair.\nI know from previous experience that writing reviews for hotels in London can some times be a waste of time, because at the end of the day they get the business.\nI decided to write this review in the hope that I can at least save 1 person from wasting there money.\nI forgot to mention - I also ordered a Gin (Bombay Sapphire) and Tonic (Schweppes) from the bar downstairs - £10.41!", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-12T02:00:00.000+02:00", "crawled": "2017-03-31T18:57:36.637+03:00", "highlightTitle": ""}