{"organizations": [], "uuid": "3bee05820d68745acd3eccd8c43fcdba8929ad90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/82/39/01/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197424-Reviews-Novotel_Paris_Les_Halles-Paris_Ile_de_France.html", "section_title": "Novotel Paris Les Halles - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197424-r466205405-Novotel_Paris_Les_Halles-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Keep in mind renovation still in progress", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Keep in mind renovation still in progress - Review of Novotel Paris Les Halles, Paris, France - TripAdvisor", "spam_score": 0.46, "site_type": "discussions", "published": "2017-03-10T02:00:00.000+02:00", "replies_count": 0, "uuid": "3bee05820d68745acd3eccd8c43fcdba8929ad90"}, "author": "mr_draco", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197424-r466205405-Novotel_Paris_Les_Halles-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Keep in mind renovation still in progress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The receptionists are incredibly polite by European standard. The lady who serve me is very polite. Her English can be better, I believe she is trying her best but there is small thing where she said \"Everything in the mini bar is free except alcoholic drink and meat\" I don't see any meat in the bar but nut, so I thought the nut is free. It's not! When I check out, they almost charge me for the nut. Luckily she let me go without the need to pay the nut but it gives unpleasant taste in the end :( In the outside there are people building the metro station I think, the isolation from outside is good enough where you will barely hear it if you turn on TV in the room. To my surprise, there is also renovation inside the hotel! My baby awaken on her morning sleep thanks to people who doing their work (The hotel doesn't say anything about this inside renovation) During this renovation periods, it feels like backpacker hostel, make sure you stay away from the hotel in the day as the hotel will have lot of noises from inside and outside! The room is big but quite tight to walk. The room feels bit cold even thermostat being set to high. The bath room is flawed by design! After I take a shower the floor will be wet and slippy, good luck to make it dry. The wash basin sink barely able to be opened properly so its almost clogged. There is no movie within the channels, you have to pay 8 euro to watch one movie. With the nut incident and a need to pay for a movie, it feels the hotel is desperate to increase their revenue, here's a bit advise, try to put beautiful picture of food that I can order in the room service menu instead of only texts, I'm sure people will order. The check out process is again bitter compared to check in process. No simple question like \"How is it with your stay?\", I was bombarded with question that like I want to steal something, what did you consume in the mini bars? Oh I will let you go this time with the nut but next time you should have understand as there is label which explain that in the mini bar. I was about to give you 3 stars but the longer I write the review, it feels the hotel only deserve 2 stars. Only people during check in and breakfast which are nice and polite who save the graces how I remember this hotel. Stayed for a night in executive suite.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-10T02:00:00.000+02:00", "crawled": "2017-03-27T04:42:44.822+03:00", "highlightTitle": ""}