{"organizations": [], "uuid": "c06f777c74d9315c1804ee449026e9acbf7e0cb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/44/ee/6a/the-st-regis-new-york.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93614-Reviews-The_St_Regis_New_York-New_York_City_New_York.html", "section_title": "The St. Regis New York - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93614-r469953445-The_St_Regis_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Disappointing", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Disappointing - Review of The St. Regis New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-24T03:00:00.000+03:00", "replies_count": 1, "uuid": "c06f777c74d9315c1804ee449026e9acbf7e0cb2"}, "author": "wrldtrvlr_13", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93614-r469953445-The_St_Regis_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Disappointing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overall, a very disappointing experience. I've stayed at this property multiple times in the past with very mixed results, ranging from great (upgraded to a suite with a platter of fruit in the room on arrival) to the opposite of great (tried checking in at 5pm and had to wait until almost 9pm until a room was ready?!). This stay solidified my opinion to not return.\nThere wasn't a single major problem in this case but more of an accumulation of several small annoyances that when taken together, add up to a very negative opinion.\nFor starters, I was booked into a 1-night stay but had a last minute travel change that required me being in NYC for 2 nights. I called the property to inquire about adding an extra night and was told they were \"sold out\" and could not accommodate. However, all third party travel sites (Kayak, Hotels.com, etc etc) showed availability, their own website showed availability and when I called SPG's reservation center they also confirmed that not only was there still availability but that at least three different room types were available.\nNext, upon check-in, I was told I would not receive any Platinum benefits because I was booked on a corporate rate. I average close to 200 nights across hotel brands (giving me the highest tier status in 3 different major loyalty programs) and have never had a single property anywhere else in the world at any of these brands deny benefits because of a corporate rate.\nAfter checking out, I realized I had left something in the room and called the property to ask if they could check the room for the item. The first time I called I was told someone would check and call me back. 30 minutes later and no call, I called again and was told by the person I was speaking with that they were on their way to the room as we were talking and I'd receive a call back in 5 minutes. Another 20 minutes and no call, I called a 3rd time and was told no one had checked and they weren't sure who I had spoken with the previous two times as they didn't have record of a request.\nAt this price point, you can stay anywhere in NYC and that's exactly what I'd recommend - stay at ANY of them over this place.", "external_links": [], "published": "2017-03-24T03:00:00.000+03:00", "crawled": "2017-03-29T03:56:18.739+03:00", "highlightTitle": ""}