{"organizations": [], "uuid": "2f993da3aa1a47c51fd1dd7411db3f7d6d89d632", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/b9/b7/e0/superior-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d1803696-Reviews-Hotel_Indigo_London_Tower_Hill-London_England.html", "section_title": "Hotel Indigo London Tower Hill - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d1803696-r468766079-Hotel_Indigo_London_Tower_Hill-London_England.html", "country": "US", "domain_rank": 189, "title": "Pretentious Hotel -", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Pretentious Hotel - Review of Hotel Indigo London Tower Hill, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "2f993da3aa1a47c51fd1dd7411db3f7d6d89d632"}, "author": "familyman402016", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d1803696-r468766079-Hotel_Indigo_London_Tower_Hill-London_England.html", "ord_in_thread": 0, "title": "Pretentious Hotel -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed here for work and was not overly impressed with it. Firstly, it's very in your face decor in the lobby, lots of bright reds etc, weird actually, the light is really weird... bight red with stainless steel everywhere.\nThe decor continues like this, in an OTT fashion, bight, in your face colors, with lots of brick effect and mirrors in the hall ways. This is carried on into the rooms with brick facing on the wall behind the bed. There are nice features, like the moon and egg shape toilet....why!!!??? Anyway, they also have a helpful mobile phone which you are free to use and take with you. This is good.\nThere are however a few real issues with the hotel I feel. 1. The noise in the room from upstairs is awful, you can hear, literally everything... 2. the rooms are roasting and you need the zircon on all the time.\nI just thought it would be better and certainly would not pay for it myself. It's a very, maybe below average hotel, pretending to be upmarket. I didn't like it and didn't sleep at all on my stay here, due to the noise and the heat.\nThe staff are nice and friendly, but this doesn't compensate really. Also, I walked out with two bags and was never asked would I like a taxi called or any form of assistance. This is not a purpose built hotel. it looks like it was an old office block, converted into a hotel.\nVery poor in my estimations, All I want when traveling on business is a good nights sleep and despite its funky exterior and gadgets, this hotel did not deliver for me at all.\nRoom Tip: Close a top floor or get no sleep.... See more room tips", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-31T21:09:01.840+03:00", "highlightTitle": ""}