{"organizations": [], "uuid": "39a31b7841492e3fd83508282d1b435b970b3e14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/06/b3/d8/premier-inn-london-city.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d7193214-Reviews-or20-Premier_Inn_London_City_Aldgate_Hotel-London_England.html", "section_title": "Premier Inn London City (Aldgate) Hotel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d7193214-r466599635-Premier_Inn_London_City_Aldgate_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Bad management?", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Bad management? - Review of Premier Inn London City (Aldgate) Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-12T02:00:00.000+02:00", "replies_count": 1, "uuid": "39a31b7841492e3fd83508282d1b435b970b3e14"}, "author": "perfecttravel2016", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d7193214-r466599635-Premier_Inn_London_City_Aldgate_Hotel-London_England.html", "ord_in_thread": 0, "title": "Bad management?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We chose this Hotel because it is conveniently located closely to the financial district of London and it was marked as a new Hotel on the company's Homepage. Check In was quick although only one room key was provided. The room was small and had the Standard brand appearance which is fine. Unfortunately the house keeping is not doing a proper Job. The carpet wasn't vaccumed (it remained that way our entire stay)and there weren't enough towels in the room. This issue was solved quickly at the reception although the receptionist was not very friendly as she had to interrupt her phone call (on her private mobile?) to get us a spare towel.\nOn the next day after returning to our room we had to realize that our wet towels we wanted to be replaced were folded (so they were still moist!!!) and definitely not exchanged. How could we know that? There was a stain on the towel which was the reason we wanted a new one. Issue could be resolved as well at the reception but not a good customer attitude either.\nWe tried breakfast on our final day, which was basically okay but the cleanliness seems to be of low priority in this premier inn facility.\nFinally I want to add that the discipline of the employees was below the brand average (we have stayed in multiple Premier Inns over the last ten years throughout London and this particular location was the worst) as talking on private phones seemed to be very important. The housekeeping needs to do a far better job. I guess the management of this property is not very keen in running a tidy and friendly business. We will avoid this hotel in the future.", "external_links": [], "published": "2017-03-12T02:00:00.000+02:00", "crawled": "2017-03-31T19:57:29.050+03:00", "highlightTitle": ""}