{"organizations": [], "uuid": "abbf332b814fd6d4ac6cc6483c07f600ff507f05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/8c/6f/ea/deluxe-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d112062-Reviews-The_Time_New_York-New_York_City_New_York.html", "section_title": "The Time New York - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d112062-r468449114-The_Time_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Very disappointing", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Very disappointing - Review of The Time New York, New York City, NY - TripAdvisor", "spam_score": 0.009, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "abbf332b814fd6d4ac6cc6483c07f600ff507f05"}, "author": "Archimedesrules", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d112062-r468449114-The_Time_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Very disappointing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What a let down! We always try to stay on Times Square when visiting the city, and this property went from mildly annoying to downright unacceptable over our 4 night stay.\nThe pros: the location, which is why we selected it, and the overall design - modern, sleek, tasteful. The beds are nice a comfy, and the TV in the mirror is a cool gadget.\nFor the rest: we were first given a room next to the elevator shaft, and one of the walls would vibrate like in the subway every 20 to 45 seconds (1019). After complaining, we were downgradede to an even smaller room, where we could not even open 2 suitcases and still walk around the bed at the same time (1116). Additionally, we noticed that the walls between rooms are paper thin - we could hear not only the conversation of our neighbours (we could tell what they were talking about!!), but we could also clearly hear when the gentleman would clear his throatwith . Unfortunately, due to a bad snow storm over New York and many flights canceled, we could not move to another room for 2 nights.\nFinally, we moved to room 1605 which was again of acceptable size (albeit small, even for New York standards) with a nice view and, fortunately relatively calm neighbors around.\nThe really unacceptable now: the elevator(s) kept malfunctioning throughout our stay - first there is only one out of 2 working at any tine, and people got stuck in there twice during our 4 day stay. You would ofetn have to wait up to 10 mn to go in or out of your room!! And then the elevator would be packed, not only with other customers but also with staff members hauling stuff up and down the hotel.\nWe got all sorts of explanations regarding the elevator, but when checking earlier reviews of that hotel, it seems to be a re-occurring issue there. I don't understand how they can allow the staff to use these elevators when going only 1 floor up or down, and when not carrying anything heavy.\nNot to mention the cleaning staff barking at each other in the corridors in the morning, and being given a towel that should better be used as a mop at one point.\nReception staff was overall helpful and courteous, but that that does not compensate for the overall poor sleep quality due to the noise and the accumulation of disappointing things. We have previously stayed several times at the Crown Plaza next door, and we got a much nicer experience for only a few bucks more. Based on our experience, I dont think we will return.", "external_links": [], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-30T01:21:55.972+03:00", "highlightTitle": ""}