{"organizations": [], "uuid": "79a59bc6ce9980f6724b23605e2371863ce8a5d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/b9/43/97/the-gallivant-times-square.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d75711-Reviews-The_Gallivant_Times_Square-New_York_City_New_York.html", "section_title": "The Gallivant Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d75711-r467652581-The_Gallivant_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "A TRUE MUST READ REVIEW!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "A TRUE MUST READ REVIEW! - Review of The Gallivant Times Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "79a59bc6ce9980f6724b23605e2371863ce8a5d1"}, "author": "Raubie R", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d75711-r467652581-The_Gallivant_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "A TRUE MUST READ REVIEW!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I honestly wouldn't even give it 1 star.\nThere was a lot wrong with this hotel experience and it was the worst I've ever had. Every good reviewer here that I have seen booked one of the more spacious rooms that are highly expensive such as the penthouse which is $715 dollars a night. I shouldn't have to pay for so much money for a decent room. We received a standard king bed room with a rollaway bed since we were a group of 4. The staff also recommended this room for us. Service initially seemed amazing. We got to the room and it was extremely small. The photos we saw of the room differed SIGNIFICANTLY from the picture. From the bedding on the sheets to the actual sizes of the beds itself. They most likely took most of their pictures from just their penthouse suites or family rooms and posted on the hotel to look good. We literally could barely fit our luggage in the room without having to trip over them (each of us had 1 standard suitcase and a small book bag). We couldn't control the heating. Your options were either extra toasty or crispy burnt bacon. We had to open and close the window almost every two hours throughout the night to get optimal temperatures. In the middle of the night we heard clanging noises from inside of the walls, which kept us up for an hour. I notified the front desk that we would be leaving after that night and check out. Everything was fine and we got to a much spacious hotel that was definitely worth our buck (Hotel Pennsylvania). However, when I got back home I see that I was charged over 400 dollars because they charged me for the two more nights we obviously didn't stay for! I've called countless times and no one could properly answer me besides the fact that their system says that I stayed the whole 3 nights I planned to stay. They would constantly redirect me to accounting and I will ALWAYS get sent to voicemail. I called every hour or two to see when accounting would come in and 5-6 hours later, THEY STILL AREN'T THERE. At this point, I can no longer get a hold of anyone at all! And it wasn't because the line was busy, but there was no one there at all to even answer the front desk! This is extremely unacceptable no matter how you look at the situation. If you are getting a standard room, IT IS NOT WORTH YOUR MONEY!! For 658 dollars and some change, I expected much more from the hotel than this and the person reading this review can find a better room for equal or much cheaper that is actually worth it. NEVER COMING BACK!", "external_links": [], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-30T19:07:18.383+03:00", "highlightTitle": ""}