{"organizations": [], "uuid": "dc9c66cafa0df5c9b8f8a3421e0f8ab2cd4734ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/6a/1b/1e/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93352-Reviews-DoubleTree_Suites_by_Hilton_Hotel_New_York_City_Times_Square-New_York_City_New_York.html", "section_title": "DoubleTree Suites by Hilton Hotel New York City - Times Square - UPDATED 2017 Reviews &amp; Price Comparison - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93352-r470669212-DoubleTree_Suites_by_Hilton_Hotel_New_York_City_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "High cost didn't match its standard", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "High cost didn't match its standard - Review of DoubleTree Suites by Hilton Hotel New York City - Times Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "dc9c66cafa0df5c9b8f8a3421e0f8ab2cd4734ac"}, "author": "kcloo74", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93352-r470669212-DoubleTree_Suites_by_Hilton_Hotel_New_York_City_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "High cost didn't match its standard", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I booked DoubleTree Suites as a retreat for myself. I had a rather high expectation because: the cost is rather high compared to other 4-star or even 5-star hotels in the same area, 2. DoubleTree hotels around the world have so far given me a good impression. However, after my stay with them, the only thing I would rate 5 Stars is their location. That's it! The overall service in this hotel only deserve a 1 Star (except for my room attendant and one bellman did show that they care). The receptionists and even the phone operator were very impolite. Management, is that a New York thing or just your good hotel's service standard? Secondly, the room, closet and facilities are very dated. (this wasn't my biggest concern anyways. The service standard was!) On my last day, instead of helping me get a cab as I requested, the bellman convinced me to take the black hotel limousine to go to the JFK airport for $80 (he stressed that it's inclusive of the tips). However, after recklessly driving and speeding, the driver finally got me safely to the airport. Guess what, he started asking for additional tips and refused to let me go. I finally had to raise my voice and quickly pulled my luggage into the departure hall when the cars behind were honking him to move his car. My sincere advice to anyone who'd like to choose this hotel: check out other hotel options around this area first (eg. Renaissance, Marriott Marquis, etc). If you can find a decent hotel with lower price, do go for that option because it's really not worth it to spend this much for this kind of ignorant service.", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-29T04:49:14.531+03:00", "highlightTitle": ""}