{"organizations": [], "uuid": "a9e5f065e2c009697efb6d388092a9d4abf54fc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/cd/60/54/hotel-monsieur.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d8516017-Reviews-Hotel_Monsieur-Paris_Ile_de_France.html", "section_title": "Hotel Monsieur - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d8516017-r470564232-Hotel_Monsieur-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "WTF TRIPADVISOR!!!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "WTF TRIPADVISOR!!! - Review of Hotel Monsieur, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "a9e5f065e2c009697efb6d388092a9d4abf54fc7"}, "author": "Theoysterand", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d8516017-r470564232-Hotel_Monsieur-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "WTF TRIPADVISOR!!!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Now to qualify, Paris is a city we are greatly familiar with and my wife grew up here. Also there is no city amongst many we love more.\nWe have the hotels we stay with regularly. And they are typically the 4 star boutique genres, when we noted that TripAdvisor has this hotel marked as \"travelers choice\" we felt excited to add another 4 star boutique hotel to our repertoire.\nFirst of all one must consider their neighborhood, and while this hotel has some amazing districts close by, the immediate circumference is greatly lacking, especially on Sundays, where most businesses are closed in Paris.\nSecond: service\nDaniele was kind and as helpful as he could be, though and a big 'though' he was the only one servicing all the needs of a busy front desk, no house man or any assistants. Subsequently leaving him always in a scramble.\nAND they advertise an honor bar that is no longer offered, which on its own may not seem like much, but the theme of gives one a warm fuzzy feeling that personally helped us make this choice. Also, if it's Sunday, will be one of your few choices for a glass of wine.\nMeeting of staff in the elevator was cold and off putting, as if we were an inconvenience\nThird: The Suite! Generous enough in size (2 rooms 2 baths) thought that's where it ends\n2nd room was a coach bed left open and made, which was strange for us, when closing it preferring the coach to the bed it not only would not close but appeared to be a well used piece of cloth furniture that was dusty and otherwise dirty with an improvised version of plywood support lying beneath.\nThe decor, albeit modem, left it feeling cheap with the closets looking more like dorm room shelves. Color was all black which help reveal all the greasy hand prints on counters and walls including the entrance.\nThe bed: also generous in size, though with someone else's pubic hair still on the crisp otherwise clean sheets.\nAppointments: a very nice Nespresso machine with 0 pods, leaving the typical freeze dried option.\nNo robes\nNo face towels\nNo alcoholic beverages in mini bar\nUSB charge outlet not operational\nFloor dusty\nFinally, customer service\nWe booked the room for three nights, cancelled after the first for aforementioned reasons and booked with a hotel we knew. As for a refund, on remaining 2 nights, the staff was not empowered to resolve this, leaving us very uncomfortable. It seems at the time of this review there may be no refund.\nAnd let me be clear! When making the booking on American Express Platinum Travel we did not see any mention of \"nonrefundable\" even if they do refund in the future, they have left us with this unnecessary inconvenience.\nIn closing, if you love 4 star boutique hotels in Paris, there are many others you may wish to start with, for example,\nHotel Franklin Roosevelt 8th arr.\nHotel Powers 8th arr.", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-29T19:33:25.617+03:00", "highlightTitle": ""}