{"organizations": [], "uuid": "f9ce68ebb5774ffb57fc30d8146b1654c60ea5a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/01/a3/c8/db/chambre-double.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d1065159-Reviews-New_Hotel_Opera-Paris_Ile_de_France.html", "section_title": "New Hotel Opera - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1065159-r466107559-New_Hotel_Opera-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Quite noisy, dated, very slow Wifi", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Quite noisy, dated, very slow Wifi - Review of New Hotel Opera, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-10T02:00:00.000+02:00", "replies_count": 1, "uuid": "f9ce68ebb5774ffb57fc30d8146b1654c60ea5a0"}, "author": "cqfp123", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1065159-r466107559-New_Hotel_Opera-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Quite noisy, dated, very slow Wifi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed three nights - chose this hotel because the hotel website states that rooms are sound-proofed. That’s not at all the case - walls are paper-thin and one can hear it all: conversations in the hallways and adjacent rooms, the water running, the elevator beeping loudly at every stop, noise from the street if one's room is facing the street.\nThe building is quite old with very narrow hallways. The room was very small, dimly lit and dated. No luggage rack or in-room safe. Few and inconveniently located power jacks (none available near the desk, unless one unplugged the lamp). Reasonably comfortable bed and pillows. The black-out curtains didn’t close properly and had sizable gaps between them.\nThe bathroom was quite dated with minimal shelf space and no place to hang anything, not even the towels (there was only one tiny towel bar). Bathtub with high sides and a half-shower door – impossible to shower without getting the floor wet. Good water pressure.\nCleanliness left some to be desired: I found an old pair of slippers under the bed and hair in the bathroom and on the carpet.\nMediocre breakfast with very limited selection – no fresh fruit, cheese or healthy items; cereal was provided but was extremely sugary.\nOn the day of departure the key stopped working way before check-out time – quite inconvenient when one is in a hurry. And no, it had not been sitting next to any credit cards: it worked the night before and it sat on the desk all night.\nThe staff needs an attitude adjustment, starting from housekeeping, who leaves their supplies lying across the narrow hallways, blocking the way. The front desk staff is also unfriendly: when I asked to change rooms due to noise from the street (I had specifically asked for a quiet room at the time of reservation), the front desk clerk spoke with a man (the manager?) who made some angry comments in French, probably thinking that I didn’t understand.\nWifi was extremely slow, to the point that certain pages didn’t load at all.\nThe location is very good, near the St. Lazare train station and very close to the subway. Lots of shops and restaurant nearby.\nI would not stay there again. Not up to par for a 3-star hotel and the price charged.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-10T02:00:00.000+02:00", "crawled": "2017-03-28T11:07:16.497+03:00", "highlightTitle": ""}