{"organizations": [], "uuid": "f9302e6d65b008338cff999941bf3eb954a0bbf2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/ff/a2/1a/paramount-hotel-times.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93517-Reviews-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "section_title": "Paramount Hotel Times Square New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93517-r470590178-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Horrible Stay", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Horrible Stay - Review of Paramount Hotel Times Square New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "f9302e6d65b008338cff999941bf3eb954a0bbf2"}, "author": "jcarroll100317", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93517-r470590178-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Horrible Stay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The only good thing I have to say about the Paramount is that they left me check out early!\nI booked a “deluxe room” (I use that term very lightly) for 5 nights for my honeymoon. Despite reading some bad reviews I thought having booked a deluxe room that we would be fine and I thought going on the pictures it looked like a great hotel and the location was ideal, plus I’m not fussy when it comes to hotels once you get a room that matches the description I’m happy.\nOn arriving in The Paramount I found the lobby extremely dark with a strong smell as if they had been spraying air freshener to cover up a bad smell, on check in I was asked for my visa card as security (which is the norm) however I wasn’t told that I was paying for my stay I usually pay on check out. I later found out I was immediately charged for my stay and I was charged a higher rate than what I had booked. We went to the lifts where we could barely see the floor numbers as it was so dark. When we got to our room I was bitterly disappointed, despite it being a “deluxe room” it was tiny when we opened the curtains our window faced a wall giving us a claustrophobic feeling there may as well have been no window. Then there was the bathroom it was hideous like something out of the 70’s, not what you expect in what is described as a Funky New York Hotel, there was no wardrobe in the room just a small one in the bathroom not enough room to accommodate 2 adults and no where to store luggage. My husband went down to reception immediately to express our concerns and was basically told they had no other rooms available. Upset we decided to just get on with it and ventured out, however when I couldn’t sleep that night due to the banging pipes I checked my bank account and realised I had been over charged. After a sleepless night I again approached reception at 6am, I spoke about the noise from the plumbing the response I got was “oh yeah we have a good few rooms with that noise” when I also stated that there was no way the room was deluxe I got a nod in agreement. After 20 mins of arguing with the receptionist she finally agreed to charge us for one night and allow us to check out that morning. We went out for breakfast and researched other hotels in the area, we called into the Crowne Plaza who couldn’t have been nicer and gave us a great rate, a great room with a view and great hospitality. On returning to the hotel to get our bags I walked in on the cleaning lady using the toilet, needless to say we got our bags and ran! Please do not book into this hotel it nearly ruined for us what turned out to be the holiday of a lifetime and 10 days on I am still waiting for my money to be returned to my bank account", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-30T19:02:37.702+03:00", "highlightTitle": ""}