{"organizations": [], "uuid": "a13f8861f5e18c00e8d6ebe434b89542fe65d0c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/6b/d5/b0/legend.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d3217278-Reviews-Legend_Hotel_by_Elegancia-Paris_Ile_de_France.html", "section_title": "Legend Hotel by Elegancia - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d3217278-r469712758-Legend_Hotel_by_Elegancia-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Nightmare! Bed bugs! Infestation!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Nightmare! Bed bugs! Infestation! - Review of Legend Hotel by Elegancia, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "a13f8861f5e18c00e8d6ebe434b89542fe65d0c1"}, "author": "Fifia1212", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d3217278-r469712758-Legend_Hotel_by_Elegancia-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Nightmare! Bed bugs! Infestation!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It is with deep regret that I am writing this review, but unfortunately I must be true to all fellow users of Trip Adviser, who like myself rely on this site to obtain an honest and impartial account of ones experience.\nMy stay at the Legend hotel was for 2 nights only from 19.03.17 to 21.03.17.\nOn the morning prior to check-out I woke up with a horrible itch and to a total of 12 bites along with the culprit bed bug (to my disgust) lying dead right beside me.\nI have enclosed pictures of the bites I have suffered, which are mainly spread on my arms and hands, but, you will also see that I was bitten on my eyelid!\nLuckily enough we did not suffer from any bites on the first night and the most plausible explanation as to why this could be the case is because the bed sheets were freshly laid and clean.\nUnfortunately for the second night although we had requested for our room to be tidied (and presumed bed sheets changed) we had noticed upon our return that although our bed was re-made, the sheets had not been changed. I knew this because my partner had a fresh cut on his hand which had faintly stained the top of the bed sheet on the first night and this remained there on the second night, despite the cleaners attempt to flip over the sheets.\nI presume therefore that because the bed sheets had not been changed for 48 hours, this provided the bed bugs with plenty of time to travel to the bed sheets and consequently bite at night.\nWe informed the assistant manager and showed him pictures of the bug we found on the bed and the mother bug we later discovered upon packing. He apologised for our experience and assured us that they would be calling a pest controller in. He offered us a refund but unfortunately could not proceed with this as we had made our purchase via lastminute.com. He nonetheless tried his best endeavours to show his sincerity by offering us a bottle of champagne, tea, coffee etc (though we did not accept).\nDespite the managers sincere attempts, the fact of the matter remains and that is that there should not have been bed bugs in our hotel room in the first place (had standards of cleanliness been maintained). In addition, no customer should have to leave a hotel with inflamed and itchy bites and/or frantically disinfecting all of their belongings prior to leaving the hotel and upon returning home from a weekend break!\nOur last day in Paris was consequently ruined and we have returned home with the stress of enduring precautionary measures to avoid any of our belongings bringing home the infestation. In addition, I am still suffering with these extremely itchy swollen bites, which have yet to fade away!\nAll I can therefore say, is avoid at all costs!", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-27T07:50:32.449+03:00", "highlightTitle": ""}