{"organizations": [], "uuid": "22d2762663affb1f3f9a2d972f276bdf8fed05a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/2c/a4/42/the-queen-s-gate-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d215295-Reviews-The_Queen_s_Gate_Hotel-London_England.html", "section_title": "The Queen's Gate Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d215295-r464772830-The_Queen_s_Gate_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Very disappointing, would not go back.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Very disappointing, would not go back. - Review of The Queen's Gate Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 1, "uuid": "22d2762663affb1f3f9a2d972f276bdf8fed05a4"}, "author": "domashea", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d215295-r464772830-The_Queen_s_Gate_Hotel-London_England.html", "ord_in_thread": 0, "title": "Very disappointing, would not go back.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We booked this hotel due to the location being so close to the Royal Albert Hall as we had booked to see Cirque du Soleil, and also like some of the restaurants in the area. As we travel to London quite regularly, we phoned the Hotel to ask about booking a quiet CLUB room. We were told the higher rooms at the rear of the hotel would be best and to put it on our booking form online, which we did. On arrival we were given a ground floor, front of hotel room with no double glazing, looking out onto the street and next to the Bar. I asked at reception if we could change and was told that the Hotel was full. Resigned to it, we put up with two sleepless nights with noise levels that felt like we were sleeping on the pavement. In addition our room should have robes and slippers. We had one robe and no slippers. My husband asked at reception and ten minutes later a member of staff brought four?? packs of slippers and told us the extra robe would be delivered to our room the following day it never came. At no point did anyone apologise. Breakfast was a buffet affair and their fruit selection consisted of orange segments, pineapple segments and whole bananas. The boxes of cereal were Bran Flakes and Special K with some other muesli type choices. No sign of Cornflakes, RIce Krispies, Weetabix or any of the popular standard cereal choices. I will say that the breakfast staff were absolutely lovely, and very welcoming. We have stayed in much better hotels than this for less money. There was nothing about the hotel that I could rave about so we would not go back and I am afraid we would not recommend the hotel to anyone either.\nRoom Tip: The hotel advised us to request a high floor to the rear. If you ask for it you won't necessari... See more room tips", "external_links": [], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-31T16:38:45.386+03:00", "highlightTitle": ""}