{"organizations": [], "uuid": "6885abc6470dfb164e9e2986a9b9cc5285292af4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/c5/16/00/double-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d2458180-Reviews-or20-Point_A_Hotel_London_Liverpool_Street-London_England.html", "section_title": "Point A Hotel, London Liverpool Street - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d2458180-r470240548-Point_A_Hotel_London_Liverpool_Street-London_England.html", "country": "US", "domain_rank": 189, "title": "Nightmare from Start to finish Never Again", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Nightmare from Start to finish Never Again - Review of Point A Hotel, London Liverpool Street, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "6885abc6470dfb164e9e2986a9b9cc5285292af4"}, "author": "Erica R", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d2458180-r470240548-Point_A_Hotel_London_Liverpool_Street-London_England.html", "ord_in_thread": 0, "title": "Nightmare from Start to finish Never Again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We got to the hotel easily enough. Booked in and went to the room . Small compact and bijou. 1ft either side of the bed, no window and my claustrophobic husband could not have coped. Went to reception to get a room with a window and was asked for £20.00 per night extra. The room was no bigger and we could not see through the window. I wonder what the point of £40..00 was for. Not the view... there was none. Breakfast the next day was an arguement because although we had paid for the breakfast they assured us we had to pay. It was eventually sorted out...a a courtesy to us. Not a courtesy we had paid!! There is no ironing service and both ironing boards were manky, not usable and did not work. The staff member offered to iron my husband shirt and it was ruined with 4 metal burn marks and so could not take his suit jacket off at graduation. The next morning was a basic breakfast no coffee in the room!! Up to the room and the fire bel went. No instruction as to where to go. When I stopped a member of staff \"No english\" she said. down to the reception and it was a test except no-one knew except the staff. I think it is illegal to not have instructions in the rooms about what to do in the event of a fire. The TV stopped working . back to reception. It seemingly goes off when we were due to check out except we were staying another day. Fixed again. A strange smell in the corridor going to the room. No-one seemed to care about service apart from one young man who kept on saying sorry every time we saw him. I didnt realise this was a youth hostel. The rooms were very basic with bits falling off the wall. hair on walls and towels need replaced. Hard and grey. shocking \"hotel\" . Do not stay if you want anything more than a bed. Very basic and inconsistent with service. No view despite a Window which we could not see out of and never again. I will write for a refund to the company. and a new shirt. spoiled the day.\nRoom Tip: Pick somewhere else See more room tips", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-31T21:24:17.156+03:00", "highlightTitle": ""}