{"organizations": [], "uuid": "300f931f0eb6be95d055daffc6e52ed3f100cfd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/af/67/a1/exterior-at-night.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d10723260-Reviews-The_Westbourne_Hyde_Park-London_England.html", "section_title": "The Westbourne Hyde Park - UPDATED 2017 Hotel Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d10723260-r467661865-The_Westbourne_Hyde_Park-London_England.html", "country": "US", "domain_rank": 189, "title": "Beautiful hotel close to Paddignton station - disappointing experience", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Beautiful hotel close to Paddignton station - disappointing experience - Review of The Westbourne Hyde Park, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "300f931f0eb6be95d055daffc6e52ed3f100cfd1"}, "author": "cousineau101", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d10723260-r467661865-The_Westbourne_Hyde_Park-London_England.html", "ord_in_thread": 0, "title": "Beautiful hotel close to Paddignton station - disappointing experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My wife and I spent 10 nights here in March 2017. We arrived just after noon and staff said they could check us in early, they even offered us a slightly larger room given the duration of our stay, which was great. The room was clean and the look of the hotel and room is very modern. Our first night however, we could hear loud banging coming from upstairs the entire night, we were already jet lagged and we were hoping to get a good sleep, which didn't happen. We could clearly hear everything going on upstairs. The next morning, we brought this up with front counter staff and we ultimately switched to a room on the 4th floor (second from the top). Same issues. Although the people in the room above were more quiet, any move they made could still be heard. My conclusion - this was a sound insulation issue that was overlooked when this hotel was renovated. Furthermore, two out of our 10 nights, the fire alarm went off two consecutive nights, the first at 3 a.m. which woke up the entire hotel and caused quite the disturbance, and the second at 11 p.m, still annoying given that we were already asleep. Another night, we lost power in our room and staff advised we would need to switch rooms, which I found ridiculous as only the breaker needed to be reset, not how we're were expected but to pack and move in the dark. Ultimately a front counter member switched the breaker and the issue was resolved to their credit, but was inconvenient nonetheless. Unfortunately given these inconveniences, I do not recommend.", "external_links": [], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-31T17:53:05.137+03:00", "highlightTitle": ""}