{"organizations": [], "uuid": "a920ac2999cf6f4b6ae626e33b779c01af35d5bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/03/53/74/hotel-eiffel-segur.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d248399-Reviews-Hotel_Eiffel_Segur-Paris_Ile_de_France.html", "section_title": "Hotel Eiffel Segur - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d248399-r468933350-Hotel_Eiffel_Segur-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Sexual Harassment Claim Waiting to Happen", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Sexual Harassment Claim Waiting to Happen - Review of Hotel Eiffel Segur, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 1, "uuid": "a920ac2999cf6f4b6ae626e33b779c01af35d5bb"}, "author": "Hannah V", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d248399-r468933350-Hotel_Eiffel_Segur-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Sexual Harassment Claim Waiting to Happen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I sent this exact message to the hotel and never received a reply. Excellent customer service I will say, this was a nice hotel yet a very TERRIBLE experience.\nI arrived late Friday night February 17th and was greet by a man at the front desk. We briefly spoke and he asked how long would I be in Paris I said one night. He said I should make the most of my stay and I assumed jokingly, he said I can close down the hotel and to to dinner with you and have drinks. Not thinking he would be serious I laughed. I told him I was going out for a walk once I get myself settled in my room.\nLater as I was leaving, he again said he would shut down the front desk and go with me, again I assumed he was being funny and hospitable I laughed and walked away. Before I left he said when I come back I should have a drink with him. I didn't believe he was serious and I left.\nUpon my return he asked how my walk was and what would I like to drink, I told him I purchased some food and wanted to go to my room to eat. He said, you sure just one drink? I obliged and accepted a gin and tonic. He said there was no tonic was and had to go to the kitchen to find tonic water. He returned with a drink mixed with gin and orange juice which I was not comfortable drinking because I did not see him prepare it.\nWe spoke for the little bit of time I ate my sandwich and had a few sips of the drink he made, it was strong so I did not finish it. I told him I was very tired it was 1:30am and I wanted to sleep. He asked me not to go to my room to stay a little longer and I again said I was very tired.\nI entered my room and a few minutes later my phone rang and it was Adam from the front desk asking if he could come to my room before I went to sleep. I told him no, he asked if he could continue to keep in contact with me and asked my information. He already had my information because upon my arrival he asked me to complete a short form with my full name, address and email. He said he had my information. Then he asked me again if I was sure that I did not want for him to come to my room and I again said I am sure I do not want you to come to my room. He told me that he missed me already and I told him good night.\nBeing a woman traveling alone for the first time in a new city and country this incident left me feeling very uncomfortable knowing that he has access to my room. I locked the door with the deadbolt and placed the chair under the door knob to make my room more secure.\nThe next day, I told the front receptionist about the situation that took place and she was very apologetic. My daughter, who had booked this hotel for me, called and was asked to send an email. I did, and have yet to receive a reply.\nFor the sake of solo women travelers.. I hope Adam no longer works there.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-31T05:33:56.403+03:00", "highlightTitle": ""}