{"organizations": [], "uuid": "1298ee7516bbcc1dfcccf9c7e153bb8030c97848", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/3a/e4/60/atrium.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g32124-d80932-Reviews-or40-Hyatt_Regency_San_Francisco_Airport_Burlingame-Burlingame_California.html", "section_title": "Hyatt Regency San Francisco Airport - Burlingame - UPDATED 2017 Hotel Reviews &amp; Price Comparison (CA) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g32124-d80932-r463288328-Hyatt_Regency_San_Francisco_Airport_Burlingame-Burlingame_California.html", "country": "ZA", "domain_rank": 189, "title": "Slamming doors, dust, no fresh air, no views", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Slamming doors, dust, no fresh air, no views - Review of Hyatt Regency San Francisco Airport - Burlingame, Burlingame, CA - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-27T02:00:00.000+02:00", "replies_count": 0, "uuid": "1298ee7516bbcc1dfcccf9c7e153bb8030c97848"}, "author": "Fromer", "url": "https://www.tripadvisor.com/ShowUserReviews-g32124-d80932-r463288328-Hyatt_Regency_San_Francisco_Airport_Burlingame-Burlingame_California.html", "ord_in_thread": 0, "title": "Slamming doors, dust, no fresh air, no views", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I had high expectations for this stay but I was sorely disappointed.\nOnce I got off the elevator, I had to lug my bags for several minutes until I reached my room. Since there is only one set of elevators, if your room is located on the opposite side of the property, you will be very fit by the end of your stay.\nI was looking forward to a nice view of the bay. Imagine my surprise when I parted the curtains and was treated to a view of hundreds of other rooms around the atrium! This meant I wouldn’t ever be able to open the curtains or see a ray of sunshine. I felt very claustrophobic. Even though I had booked my room through a hotel employee, I was never told I could choose a bay-view room for a slight premium.\nThe room was not quite ready and the bedspread was still lying on the floor. So much for hygienic practices. Every surface of the room was covered in dust. When I checked the air filter, it was completely clogged. It obviously hadn't been changed in a quite a while.\nThe air in the room was a bit stale so I wanted to crack open to window. No such luck. I was informed all the room windows had recently been sealed shut. I later inquired what provisions had been made to supply fresh air to the rooms. No one could provide me an answer.\nI went down to the restaurant. The meal was fine but then I had to wait half an hour to get my check, even though the place wasn’t busy.\nI was exhausted after a long day of travel and I couldn’t wait to get a good night’s sleep. No such luck. I was kept awake until 4 am by a door slamming every couple of minutes. There is no excuse for a hotel to have slamming doors. None! Many manufacturers make soft close systems. A quick search turned up many results. A hotel stay is first and foremost about sleep and rest. A hotel of this caliber cannot afford to screw this up. Instead of sealing the windows shut, the hotel should have spent the money on soft close systems to make sure guests get a good night’s sleep.\nIt is disappointing that a Hyatt Regency had so many failures. Hotel management needs to step up its game. Until then, I will not return.\nRoom Tip: Bring good earplugs. With the doors constantly slamming, you won't get any sleep without earplug... See more room tips", "external_links": [], "published": "2017-02-27T02:00:00.000+02:00", "crawled": "2017-03-26T20:29:25.227+03:00", "highlightTitle": ""}