{"organizations": [], "uuid": "3d6d2900dfaf31119d60d8a8e0c87c30db824a74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/ff/a2/1a/paramount-hotel-times.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93517-Reviews-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "section_title": "Paramount Hotel Times Square New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93517-r470321321-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Even Horrible when Upgraded", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Even Horrible when Upgraded - Review of Paramount Hotel Times Square New York, New York City, NY - TripAdvisor", "spam_score": 0.009, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "3d6d2900dfaf31119d60d8a8e0c87c30db824a74"}, "author": "MaureenKeyes", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93517-r470321321-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Even Horrible when Upgraded", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I came to this hotel by Hotwire's automatic selection. It was listed as Times Square North and it was dead centre so I took a chance crossing my fingers it would miss this hotel. I stayed here in 2008 and again this past weekend. Both times were a Hotwire lottery. Horrible is an understatement. I was travelling with my six year old and it was NOT family friendly or convenient for a child this age. Cold, angry doormen, nobody to open doors or greet you upon return. Dark and dingy lighting so as to camouflage the horrible condition of the hotel. Wifi NEVER WORKED. I had to phone support twice and was hung up on both times. Phones the front desk multiple times regarding the issue and they didn't care at all. Hello to my international data roaming phone bill! The kind gentlemen at the front desk did upgrade us to a room with two double beds after we realized we were in a tiny closet with one double. Even after the upgrade our room was no larger then a walk in closet. Our room was right off the elevator which was noisy and felt unsafe. We didn't use maid service once as we were scared of theft. Did not get a good feeling at all from this place. Felt like a prison. Upon review of my bill, with a resort fee of $25/night our daily room rate was over $200/usd a night. I stayed at the Westin /W in Times Square in December and paid less, had amazing service and wifi the entire time. For the location I would return, but only if I had every single available upgrade AND it was fully paid for by the hotel.", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-30T19:02:24.545+03:00", "highlightTitle": ""}