{"organizations": [], "uuid": "135ce60b8e9b15b266631542127eadd337fadf86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/7d/28/2d/bedroom.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197555-Reviews-BEST_WESTERN_Hotel_Le_Montmartre_Saint_Pierre-Paris_Ile_de_France.html", "section_title": "BEST WESTERN Hotel Le Montmartre Saint Pierre - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197555-r465680491-BEST_WESTERN_Hotel_Le_Montmartre_Saint_Pierre-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Literally depends what member of staff you have", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Literally depends what member of staff you have - Review of BEST WESTERN Hotel Le Montmartre Saint Pierre, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-08T02:00:00.000+02:00", "replies_count": 1, "uuid": "135ce60b8e9b15b266631542127eadd337fadf86"}, "author": "Xcloose", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197555-r465680491-BEST_WESTERN_Hotel_Le_Montmartre_Saint_Pierre-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Literally depends what member of staff you have", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The price and location was good so we opted to stay here\nUpon arrival, we were stood waiting there while the receptionist was typing away. No greeting to say he would be with us - just ignored us for a while. He finally dealt with us but seemed really disinterested. We thought whatever and went up to the room\nUpon getting in the elevator, it was the smallest elevator I have EVER been in! It was a tight fit for 2 people with hand luggage. But we thought whatever and went up to our floor which had TINY hallways\nWe then entered the room and it was TINY! There was barely enough space to walk around the bed. And the shower was there in the room with ONLY a frosted glass effect on the window, but you could still see what was inside\nAnd my knees were almost touching the wall when sat on the toilet. It was horrible!\nWe then went out for dinner and after being ignored by the new receptionist, we were finally spoken to and went on our way\nUpon arrival, there was another new receptionist who actually seemed friendly towards us! We went up to the room but upon flushing the toilet, it blocked! We went to reception to tell them and he moved us to a new room. This changed EVERYTHING!\nThe room had space, the bathroom was just that - a ROOM! It was just more pleasant. And every time we saw him in the evening, he was just so nice and polite to us\nSo yeah, decent room IN THE END and horrid staff apart from 1 who should not be working with people like that!\nAnd the sweets on reception were AMAZING! I literally got addicted to them\nRoom Tip: Twin room was SO MUCH BIGGER than a double See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-08T02:00:00.000+02:00", "crawled": "2017-03-29T08:28:25.003+03:00", "highlightTitle": ""}