{"organizations": [], "uuid": "8d708a003bf5369ee8e26890bc4ef7c48f846e85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/02/4a/b8/5f/premier-inn-london-islington.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d2403100-Reviews-or10-Premier_Inn_London_Angel_Islington_Hotel-London_England.html", "section_title": "Premier Inn London Angel Islington Hotel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d2403100-r466658826-Premier_Inn_London_Angel_Islington_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "BED BUGS", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "BED BUGS - Review of Premier Inn London Angel Islington Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-12T02:00:00.000+02:00", "replies_count": 1, "uuid": "8d708a003bf5369ee8e26890bc4ef7c48f846e85"}, "author": "ab2157", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d2403100-r466658826-Premier_Inn_London_Angel_Islington_Hotel-London_England.html", "ord_in_thread": 0, "title": "BED BUGS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The reason I didn't write a review earlier is because the company who paid for this 2 day stay tried to get a refund and was refused, and so as I lay here at 3am scratching and seething at the thought of that stay, I thought now may be appropriate .\nSo on the 1st day I took a 3 hour 'nap' to be woken by bedbugs running over my face.\nI was kind and discreet enough to Premier Inn to not go to reception shouting about it ( since reception was full), and a guy inspected the room and then asked \" do I want a room change?\" - I'd say so, and if you've got a change of my skin whilst you're at it that would be perfect.\nI then had to ask if I could have my clothes laundered that had been on the bed, and then had to further ask for some compensation - the clothes laundering was met by some head scratching ( prob from their hotel being infested ) as they \" don't provide that service\", and the company refunded 1 of the 2 nights stay. Since it was my partner's company that paid, I thought I'd let Premier Inn take it up further with them themselves.\nAt no point did a manager come to the room and apologise and at no point any lovely things offered to ease my wrecked mind that bed bugs may be nesting in my suitcase ( and knickers).\nSo off we go home to then worry for the next month about harboring hitchhiking bedbugs in the luggage- (since it can take a few months to know in your own bed if you have), and then continue to obsess and google about this in the small hours, leading to purchase 100% alcohol spray to then spray everything down subsequently rendering our abode 100% flammable.\nSo, if the manager reads this, it would be nice if he/ she could at least offer the other nights stay refund? - but I doubt it since he/she couldn't even be bothered coming to the 3rd floor to apologise.\nI also have a video of these critters and I'm being nice not posting it to see if Premier Inn will play nice back and refund the night.", "external_links": [], "published": "2017-03-12T02:00:00.000+02:00", "crawled": "2017-03-31T22:17:56.955+03:00", "highlightTitle": ""}