{"organizations": [], "uuid": "88868cb2e48ee2d5ac6ca12a44b56adffb1a29de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/9d/6a/ea/marriott-vacation-club.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1186070-Reviews-Marriott_Vacation_Club_Pulse_New_York_City-New_York_City_New_York.html", "section_title": "Marriott Vacation Club Pulse, New York City - UPDATED 2017 Hotel Reviews &amp; Price Comparison - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1186070-r469709283-Marriott_Vacation_Club_Pulse_New_York_City-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Still under construction, extremely small room, couldn't find back personal belongs that forgot in night stand's drawer", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Still under construction, extremely small room, couldn't find back personal belongs that forgot in night stand's drawer - Review of Marriott Vacation Club Pulse, New York City, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 1, "uuid": "88868cb2e48ee2d5ac6ca12a44b56adffb1a29de"}, "author": "voyageur080", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1186070-r469709283-Marriott_Vacation_Club_Pulse_New_York_City-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Still under construction, extremely small room, couldn't find back personal belongs that forgot in night stand's drawer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The hotel is still under construction, it's noisy, messy, the exercise room is not ready, and the elevators were extremely slow (not sure if it's due to the construction work.) The location is good, but the room is extremely small, especially for a one-week long vacationer, not 1 day or 2 days business trips or getaways, it's too small to even put a sofa chair inside the room!! My husband and I used to spend our weekends staying in various Marriott hotels in Manhattan, including JW Marriott Essex house, Residence Inn Bryant park, Residence inn Central Park, Marriott Marquise, the Edition Hotel, Lexington Hotel, Renaissance hotel 57, Marriott hotel Downtown, Courtyard downtown/world trade center, Fairfield Inn Chelsea, etc. Non of them has such tiny room. We spent one week here by exchanging timeshare through Interval International. When I did the vacation exchange, I had no choice but only Pulse NYC in Manhattan, but if I book hotel rooms from Marriott, I will definitely avoid Pulse NYC, it's just so disappointing! With pretty much the same price or 40,000 Marriott points (category 8) I can easily find other roomier hotels and without construction undergoing. One last thing: 3 hours after my checking out, I realized that I left some personal belongs inside the night stand's drawer. Unfortunately, I could not get them back, those things just disappeared. I was told that there was nothing they found inside the room. They also told me that the housekeeping supervisor will check every room right after the checking out of the guest, before other housekeeping personnel go inside to clean the room.", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-31T21:34:24.291+03:00", "highlightTitle": ""}