{"organizations": [], "uuid": "2ecb05f8bf6d8535ef228479896577ee8e0107db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/d1/b4/86/guestroom-king-day.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d564851-Reviews-Courtyard_New_York_Manhattan_Upper_East_Side-New_York_City_New_York.html", "section_title": "Courtyard New York Manhattan/Upper East Side - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d564851-r468977067-Courtyard_New_York_Manhattan_Upper_East_Side-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Feelin' hot, hot, hot, hot", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Feelin' hot, hot, hot, hot - Review of Courtyard New York Manhattan/Upper East Side, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 1, "uuid": "2ecb05f8bf6d8535ef228479896577ee8e0107db"}, "author": "KFerg", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d564851-r468977067-Courtyard_New_York_Manhattan_Upper_East_Side-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Feelin' hot, hot, hot, hot", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I had a hard time finding this hotel on the Marriott site initially and on my corporate site when searching for hotels in NYC. Now I wonder if it's because it's a new affiliate or a soon to be no affiliate for the Marriott chain.\nThere is a need for hotels in the Upper East Side near the hospitals - I was excited to see decent rates for this Courtyard and booked it. Upon arrival it looks as if it used to be an apartment building and has been converted to a hotel. The neighborhood is ok - you're right in the middle of a couple housing projects, so depending on your city/street smarts you may or may not be comfortable with that. As a solo female I'd probably not be comfortable going out alone at night, and I'm used to a city.\nThe lobby is lovely, and it smelled great! Seriously, a really great clean scent was piped in, and I loved it. The gentleman at the desk was efficient in checking me in.\nNow, the temperature - it's real, and it's a real problem. When I got to my room it was 83+ degrees. I turned the HVAC down as far as it would go (63) and it just blew hot air. Checked the windows and they open about a half inch. Called the front desk and they offered to send maintenance to try and assist with the temperature in my room - when he arrived, he didn't bother checking anything, but told me that they don't have ability to cool in the winter months, so he could bring me a fan but there was no way to cool it down otherwise. I headed to the front desk to request to get out of my reservation and the clerk (perhaps the manager) was very decent about letting me pack up and depart. I found it a little odd that when I explained how the maintenance guy said there was no way to cool my room he clarified, \"he told you that?\" and then agreed to let me depart. Upon reading reviews here it's obvious that this is a problem, and that it's come up a lot lately, why would the front desk insist on sending an employee up to \"help\" me with the thermostat when they know the entire system is an issue? Save me the time waiting for someone to come to the room, when it's spring and this is an issue - tell the people checking in that there may be issues with the temperature and if they are sensitive to that they should book elsewhere, or take a dramatic discount off the price of the room. I would have appreciated the heads up and would have saved on the packing and unpacking time.\nSo Marriott - you must advise potential customers that there are issues with climate control here. Nobody should pay upwards of $260+ a night to sleep in rooms of this temperature. Kudos to the manager for being flexible and allowing me to go elsewhere.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-29T06:49:25.697+03:00", "highlightTitle": ""}