{"organizations": [], "uuid": "61e6ef9684f1ce460f308e642bdfcc4d1d298bec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/01/69/ee/b4/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d1488818-Reviews-Maison_Albar_Hotel_Opera_Diamond_BW_Premier_Collection-Paris_Ile_de_France.html", "section_title": "Maison Albar Hotel Opera Diamond, BW Premier Collection - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1488818-r469477907-Maison_Albar_Hotel_Opera_Diamond_BW_Premier_Collection-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Very disappointed", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Very disappointed - Review of Maison Albar Hotel Opera Diamond, BW Premier Collection, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-22T02:00:00.000+02:00", "replies_count": 0, "uuid": "61e6ef9684f1ce460f308e642bdfcc4d1d298bec"}, "author": "amhj103", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1488818-r469477907-Maison_Albar_Hotel_Opera_Diamond_BW_Premier_Collection-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Very disappointed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This is a very difficult review to write. The hotel is in a good location and it has the potential to be very good but our stay was ruined. I could overlook the broken furniture in the room and stains to the carpet, the £200 holding deposit no one tells you about but I can not accept the attitude of the staff. Our stay was ruined by the staff allowing a number of guests to use the central courtyard until the early hours of the morning. If it had been until midnight or 1am I could have dealt with it but serving drinks outside in a central courtyard from a private hotel guest only bar until 3:30 in the morning is unacceptable. Then proceeding to clear up the glasses and slamming the doors at 4am takes the biscuit. A staff member then took a personal call out in the courtyard at about 5.30am. The bar and courtyard are supposed to close at 11:30pm so be warned that this doesn't happen so if you have an internal facing room you are going to disturbed. I raised this with the reception staff the next day and was basically told I was wrong and it wasn't from the hotel. I could see the people in the courtyard from my room so I argued the point. I received a mumbled apology and I asked for this to be looked into. I didn't receive a response and am still waiting. We were also rudely asked on more than one occasion as we sat in the reception waiting for a friend what were we doing there as if we had just walked in off the street! I won't go into the fine detail of other issues except to say they are house keeping related. Would stay in this location but not at this hotel. No where near five star.", "external_links": [], "published": "2017-03-22T02:00:00.000+02:00", "crawled": "2017-03-27T12:30:44.897+03:00", "highlightTitle": ""}