{"organizations": [], "uuid": "1b511397e426f011119b333ef8017b287b2e6a59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/a5/c9/fa/ruskin-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d3578909-Reviews-Ruskin_Hotel-London_England.html", "section_title": "Ruskin Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d3578909-r464584363-Ruskin_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Never Again", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Never Again - Review of Ruskin Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-04T02:00:00.000+02:00", "replies_count": 1, "uuid": "1b511397e426f011119b333ef8017b287b2e6a59"}, "author": "brightstars2011", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d3578909-r464584363-Ruskin_Hotel-London_England.html", "ord_in_thread": 0, "title": "Never Again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This is my first ever negative review but I feel it has to be done.\nMy young daughter needed to be in London early on a Monday morning in half term so we both decided to stay in a hotel the night before to get a good nights sleep.\nOn arrival we opened the door to find a single bed, that was fine, however i went to reception and asked for an extra pillow. I was told I had to upgrade to a double for that to happen, so paid for an upgrade.\nThe room was clean. The bed wasn't overly comfortable but acceptable. I turned the light off and we both had to endure listening to busses go past, car horns, police sirens, people shouting. I hoped I would soon be able to switch off and fall asleep however around Midnight we had people trying to get into the room. They finally got into their own room and we had to endure listening to their conversation from next door, the walls were that thin we could hear everything they were saying, sneezes included. Rang reception to ask if they could politely be asked to keep the noise down. Got a very frosty response from the night porter. Around 12:45 we had both had enough. The noise from the main road and our next door neighbours was too much. I contacted reception again and asked to change rooms. I then had to wait for him to ring me back. I then had to drag my daughter downstairs in the middle of the night to get the key for another room. To be fair when he saw how tired she looked he apologised and changed our room. Finally after 1am we were in a quieter room. Had we had this room first, this review may have been different.\nThat morning my daughter was so tired I couldn't wake her up so we both missed breakfast (that was included) as I had to get her to her appointment. Informed the receptionists about the night we had and just got a shrug and a \"well you changed rooms\"\nSent the manager an email to complain but never received a reply.\nDecided to go for a more well branded hotel chain at the end of the week. What a difference. Comfy bed, good nights sleep, will stick with them from now on!", "external_links": [], "published": "2017-03-04T02:00:00.000+02:00", "crawled": "2017-03-31T21:21:17.646+03:00", "highlightTitle": ""}