{"organizations": [], "uuid": "dbe239ed0cc8d9cdcdd3a17568ae1002449f679d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/07/de/35/hudson-hotel-new-york.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d223023-Reviews-or50-Hudson_Hotel_New_York-New_York_City_New_York.html", "section_title": "Hudson Hotel New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d223023-r466001406-Hudson_Hotel_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great Location, Terrible Rooms", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Great Location, Terrible Rooms - Review of Hudson Hotel New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-10T02:00:00.000+02:00", "replies_count": 1, "uuid": "dbe239ed0cc8d9cdcdd3a17568ae1002449f679d"}, "author": "PinkSands242", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d223023-r466001406-Hudson_Hotel_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great Location, Terrible Rooms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I have never given a resort a bad review. I always try to find something positive about every location that I visit, and focus on these attributes. However, this place is extremely rundown and I would feel terribly if someone else visited this hotel without being prepared for what they are getting.\nSo, let's start off with the good. The resort has a great location, the check in process was fast and the young man that checked us in, Alex, was very upbeat, friendly, polite and professional.\nThat is where the resort's positive attributes come to a close. This is the worst hotel experience that I have ever had.\nI was unpleasantly surprised when I walked into our room. The room was VERY rundown and did not feel clean. The bathtub was cracked and chipped and looked dirty, the floor tiles were mismatched, the trash can and tissue box holder were from the dollar store, and the towels were old, cheap, worn and had stains. The bathmat also had stains. Everything was chipping and peeling. The faucet was rusted and nearly falling off. The drain was clogged and the water just settled instead of running out when I took a shower. The power sockets were also falling off and there were hairs in the shower. The room was just basically a dump. The room truly needed to be put out of service.\nNormally, I would let it go and suck it up since it was only two nights, but the bath tub faucet nearly falling off was worrisome for me. I went downstairs and the agent I spoked with was not interested in what I was saying at all and looked down as he spoke to me. After I finished he sighed and went through the motions of a monotone \"so sorry to hear that.\"\nHe gave us another room, that felt cleaner and wasnt as rundown. However, the bathroom's lock was missing and the facebowl's drain was clogged. The window was also slightly open and could not be closed so it kept blowing the bathroom door open.\nThe young lady who assisted me when I came down to return the first room's key was apologetic and friendly. She sent someone up to add the bathroom door's lock, close the window that was stuck open and to clear the drain.\nI do appreciate that she kept her word. However, the hotel basically shrugged their shoulders about the poor state of the property and the unacceptable rooms and didnt even offer a sincere apology.\nI worked in hospitality for years and travel a lot - this experience was a first for me.\nDespite the ideal location, I cannot recommend this hotel. The $30 per night resort fee for such a subpar property is outrageous. Also, like clockwork, at nearly 6am every morning the air conditioning makes a really loud noise, that was loud enough to wake us up\nSee all photos", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-10T02:00:00.000+02:00", "crawled": "2017-03-30T01:55:10.286+03:00", "highlightTitle": ""}