{"organizations": [], "uuid": "ca0d896cf64cd15dc72478f2a89a83ac71db9511", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/4e/4c/c9/standard-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1553789-Reviews-World_Center_Hotel-New_York_City_New_York.html", "section_title": "World Center Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1553789-r469650711-World_Center_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "the service of the staff is horrible!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "the service of the staff is horrible! - Review of World Center Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "ca0d896cf64cd15dc72478f2a89a83ac71db9511"}, "author": "shal22042", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1553789-r469650711-World_Center_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "the service of the staff is horrible!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I arrived at this hotel on Saturday 18th March, from a 4hr bus ride visiting from Washington DC. I got to New York and it was ice raining, walked into the lobby and the front desk person that was supposed to help me check in hardly ever made eye contact with me, he was constantly looking into his computer screen, even while he was talking to me. Any way I am new to the area where the hotel is located so I asked the front desk person if he had any cab/taxi numbers because I was planning to go out late that night and given the location of the place did not want to have to walk out to the main street by myself to stop a yellow cab it was also scheduled to snow that night, his response to me in a rude tone was \"no\", he offered no other type of assistance and not even sounding bothered, anyway I just walked away and headed to my room, which by the way is very confusing to get to (1719) the door that I was supposed to go to said \"charter club members\" I did not know that applied to me ( I am not a chater club member). finally got to the room and decided to watch TV, and the remote did not work so I had to wait for someone to come fix it, and he said apparently it was a common problem because they got a few complaints. It was then Sunday morning and time to check out, so I called down to the front desk at 1145am to ask for a late check out which I was told 12:30 was okay for me to leave. My male companion was in bed and I am standing in the room making a phone call and was not properly dressed, I heard a knock on the door around 12:10 and before the person waited for me to allow them to open the door they just barged in. YES an employee walked on us naked, with no apology the person left immediately. (how humiliating).\nI was so shocked I could not even believe what had happened.\nI emailed the hotel as soon as I got back to DC, only get a canned response from the hotel, it was not even apologetic. It actually sounded like they could care less if I ever came back to their establishment.\nRoom Tip: the rooms are very very very small See more room tips", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-29T05:22:57.705+03:00", "highlightTitle": ""}