{"organizations": [], "uuid": "b61bcb9a2c68e47190e3ed326db40dd9253ca6f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/8a/f0/71/lobby-main.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99766-Reviews-or10-The_Roosevelt_Hotel-New_York_City_New_York.html", "section_title": "The Roosevelt Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r469490772-The_Roosevelt_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Noisy neighbours runied our holiday", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Noisy neighbours runied our holiday - Review of The Roosevelt Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-22T02:00:00.000+02:00", "replies_count": 0, "uuid": "b61bcb9a2c68e47190e3ed326db40dd9253ca6f5"}, "author": "oliviafurey", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r469490772-The_Roosevelt_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Noisy neighbours runied our holiday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed here for 4 nights over St Patricks weekend. On the day we arrived we were told on check-in that we were being upgraded to a Kingsize room, delighted with this so off to a good start. On entering the room we were totally disappointed by Kingsize they meant a Kingsize bed that just about fitted into the room, you had a bit if space on either side of the bed but had to walk sideways by the bottom of the bed to avoid bumping into the wall mounted TV, with practically no storage space. First night we struggled to sleep with the extremely noisy heating system in the room, street noise and then at 5am the corridor outside our room became party central for about 1.5 hours which resulted in us having to go out and confront the party people in the corridor. My husband mentioned the incident to a member of the reception staff later in the morning who advised that they could move us to a higher room, when we went down to reception to arrange the move we got a different member of staff who told us the room was no longer available, not happy with this we want back to our room and rang down to reception, we got to speak to a very helpful lady in accommodation who organised a room change for us no problem and we could move at any time during the afternoon. We went out for a few hours and returned in the afternoon and changed our room, we were delighted with the new room, much bigger, on a higher floor at the end of a corridor, so no passing room traffic etc. How wrong could we be, there was a connecting door in our room to the room next door and we ended up beside what I can only describe as the neighbours from hell. Security had to be called twice on the first night before things settled down, the next night St Patricks night we were kept awake for about 3 hours listening to the partying next door, it was like they were in the room with us, finally on our last night things deteriorated even more ending up in them having a physical fight next door, security called again and spent 45 mins trying to calm the situation down, in the end they removed one of the guests from the room to another room. The noise abated until 7.30am when it erupted again as it did on the previous mornings. These people have no respect for anyone, anything or or even themselves, they were foul mouthed, drunk, drugged up cretins. We rang down to reception complaining about the previous nights events and reception put us onto security, we could not get a straight answer when we asked what hotel policy was in dealing with behaviour of this nature and ended up being transferred back to reception who were equally as evasive on the hotels policy. At no point were we offered any sort of compensation for the disruption and stress caused to us over the 4 nights. In the end we had to come right out and ask how they were going to compensate us, we were offered a complimentary breakfast and a late check out!! We did accept the offer as it was obvious that we were not going to be offered anything further. Breakfast was average at best, the best part being the fresh fruit. The final insult came on checking out later that day when they had in fact charged us $60 for breakfast. I booked this hotel through a travel agent who I have advised in the strongest terms to avoid sending anyone else visiting NY to this hotel. I do not blame the hotel for the class of people we ended up being roomed beside but I hold them completely responsible for ruining our holiday in how they dealt with them, or should I say how they did not deal with the situation and their paltry offer of compensation to us. Needless to say we will never stay in this hotel again and will be sure to advise anyone we know visiting NY to avoid it all costs.", "external_links": [], "published": "2017-03-22T02:00:00.000+02:00", "crawled": "2017-03-29T07:07:17.640+03:00", "highlightTitle": ""}