{"organizations": [], "uuid": "0fba32cc3025b5026be4f8e7868ace6c9d3f7524", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/86/55/aa/living-room-penthouse.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d229087-Reviews-The_Inn_At_The_Spanish_Steps-Rome_Lazio.html", "section_title": "The Inn At The Spanish Steps - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d229087-r464396974-The_Inn_At_The_Spanish_Steps-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Very overrated hotel in decent location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Very overrated hotel in decent location - Review of The Inn At The Spanish Steps, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "0fba32cc3025b5026be4f8e7868ace6c9d3f7524"}, "author": "JamesTX68", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d229087-r464396974-The_Inn_At_The_Spanish_Steps-Rome_Lazio.html", "ord_in_thread": 0, "title": "Very overrated hotel in decent location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Considering all of the amazing reviews, and this hotel's status as a Small Luxury Hotel, we found the Inn a general disappointment. The room was rather spacious, but overcrowded with furniture (you run into the mounted LCD tv with your shoulder as you pass in front of the bed). The room had a very odd mix of contemporary and traditional elements, and the decor was just not what one would expect in such a highly rated hotel.\nWorst part of the stay was the arrival -- the hotel has a tiny door on the Via. You walk with your bags down a long, narrow corridor to a small flight of stairs, with a locked door at the top. We had to bring our bags all the way down the hall, drag them up the stairs (about 5) and knock on the door while trying not to fall back down the steps with the weight of our bags. When the door was unlocked, we had to bring our bags through the narrow door, without falling back as we pulled each bag into the \"lobby,\" which is no more than a tiny vestibule. It took a number of minutes for anyone resembling a bell man to approach us.\nThe reception area is another small flight down into a dinky little room filled with cluttered desks. The staff was nice, but the atmosphere was more like a cheap but practical hotel elsewhere in Rome rather than a \"luxury\" hotel.\nThe halls are narrow. The stairs are unimpressive. The one elevator is tiny. There is no restaurant. No bar. Only some little salon in the hallway, disconnected from the hotel. No room service. Only a buffet breakfast in the morning on the top floor.\nThe best rooms in the hotel face the Via, which is of course one of the top streets in all of Rome. OUr problem was that the morning noise, beginning 6 am or so, was unbearable. Trash trucks, other trucks, beeping from trucks reversing, street sweepers, car alarms. It really could not have been worse. So, unless you are willing to accept the fact that you will not be sleeping much past 6:30 am or 7 am, if you are deep sleeper, then you are limited to the ordinary rooms in the hotel, which I presume have no view, as the rooms are situated between two adjoining stores.\nThere are no rooms with a view of the Spanish Steps, unless you step out on the window ledge and crane your head 90 degrees to the left. So, the name is deceptive compared to the Hassler or other nice hotels actually on the Spanish Steps. This is not so much the Inn at the Spanish Steps as the Inn One Half Block from the Piazza di Spagna.\nThis is possibly the most overrated hotel I have ever encountered. I have heard it extolled for nearly two decades and was thrilled In other words, if this were a 150 EU per night hotel, then no one would ever complain or be concerned about the lack of facilities, the lack of service, the lack of a restaurant or bar. But Small Luxury Hotels are exquisite throughout the world.\nThe only reason this hotel can claim anything other than mediocrity is its location, which is decent. But NOT quite as advertised. Again, if it were much cheaper and more humbly advertised as an upscale but generally mid-range budget hotel, no one would complain. I certainly would not. I have stayed at many similar hotels in Rome, and they are fine -- but only when paying 150 EU or less per night.\nI do not recommend for the luxury traveler. Very little that is \"luxury\" about it. Stay at the Russie, the Hassler or somewhere far better in the same area should you want a more valuable experience. this Inn is overpriced and overrated.\nRoom Tip: See above. Not a lot of good choices -- each has cons. See more room tips", "external_links": [], "published": "2017-03-03T02:00:00.000+02:00", "crawled": "2017-03-26T18:19:53.310+03:00", "highlightTitle": ""}