{"organizations": [], "uuid": "6d6e7feadc9a7884d88a37ed5e0a1b49dab2ba86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/ff/a2/1a/paramount-hotel-times.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93517-Reviews-or30-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "section_title": "Paramount Hotel Times Square New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93517-r466376662-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Bad experience", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Bad experience - Review of Paramount Hotel Times Square New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-11T02:00:00.000+02:00", "replies_count": 1, "uuid": "6d6e7feadc9a7884d88a37ed5e0a1b49dab2ba86"}, "author": "MeniBrakha", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93517-r466376662-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Bad experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The only reason someone could pick this hotel is the nearby times-square, but this is a false notion. A good location in nyc is actually somewhere adjacent to a metro station and in a hip neighborhood. The location of this hotel is tempting, but it also means you're going to stay in a place almost unreachable by taxi (so much traffic around times-square) and not too close to the metro (about 5 blocks, try doing this with your heavy bags or in a freezing day).\nThe hotel itself is also giving you the illusion it's good, since the lobby is really well designed. Going up to your room would change that illusion, with tidy and very old rooms, weary bathroom, dirty vibe and the most tiny space you could imagine (and iv'e seen small places before) - I've ordered a double room as a single for the extra space just to realize the double room is actually a single room for two people.\nSleeping experience was horrible with weird noises coming out of the walls and the AC system (which didn't really work), when you can find yourself waking up on 3 am from metallic noises just out of nowhere, not to mention the noise from outside (the windows are not double-layered or anything).\nThe staff were not so helpful where they didn't want to give me a later check-out for a fee like any other place and asked for a full-day charge for the extra few hours. They also charge a fee for bag deposit, a service that is giving away for free in each and every hotel iv'e seen before. The extra charge called \"hotel fee\" on-top of the total bill was disturbing, since it made me pay an extra 200$ for basically nothing (they explained its for internet and 24/7 gym I don't use).\nReally, stay away from this place. Find yourself a nice hotel in the upper west or upper easy side, for less money and better experience.\nRoom Tip: Stay in another hotel See more room tips", "external_links": [], "published": "2017-03-11T02:00:00.000+02:00", "crawled": "2017-03-30T19:12:06.763+03:00", "highlightTitle": ""}