{"organizations": [], "uuid": "c2c67e8e1b4bcb27cfdfffb9158e8f18e5425446", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/8a/f0/71/lobby-main.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99766-Reviews-or30-The_Roosevelt_Hotel-New_York_City_New_York.html", "section_title": "The Roosevelt Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r468779436-The_Roosevelt_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "High-end Mid-town Manhattan hotel? Not quite.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "High-end Mid-town Manhattan hotel? Not quite. - Review of The Roosevelt Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "c2c67e8e1b4bcb27cfdfffb9158e8f18e5425446"}, "author": "Katrina D", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r468779436-The_Roosevelt_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "High-end Mid-town Manhattan hotel? Not quite.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Roosevelt's location in mid-town Manhattan would have you think that this is going to be a high-end experience; however the service is truly lacking.\nAs I drove up to the hotel, my taxi driver warned me that the doormen at this hotel are notorious for not being helpful. He was kind enough to help me unload my bags, and while I think there was a doorman outside the hotel; I'm unsure as I had wrangle my own way into the hotel past the herds of tourists and slow-moving elevators. Walking into the lobby it certainly looked grand, however the service didn't match the grandeur at all.\nMy check-in was especially bumpy due to how the front desk staff were not able to properly assess what was going on with my reservation until the manager got involved. The whole issue could have been avoided if the front desk staff had been more patient, listened more carefully to what information I had, and also identified the solutions on how to fix it instead of just insisting it was all impossible. Once the solution was found, and it was clear that they had been responsible for the miscommunication there was no apology, or recognition at all from their side.\nThe rooms are fine here- they are a bit sparse in terms of amenities, but comfortable and clean. Considering it's a Manhattan hotel, the rooms are surprisingly spacious.\nThere's a bar that serves a small menu, and the food I had was reasonably good. The staff at the bar were the most helpful in the whole hotel, and I certainly wish that the rest of the staff had been as kind and helpful as they were.\nThis hotel has potential in terms of it's location and rooms, but the customer service and hospitality leave much room for improvement.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-31T18:36:48.905+03:00", "highlightTitle": ""}