{"organizations": [], "uuid": "727338490014aad7e053faea55e7e508519fee6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/be/29/af/entrance.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99368-Reviews-Courtyard_New_York_Manhattan_Times_Square-New_York_City_New_York.html", "section_title": "Courtyard New York Manhattan/Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99368-r467310267-Courtyard_New_York_Manhattan_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "DISAPPOINTED", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "DISAPPOINTED - Review of Courtyard New York Manhattan/Times Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 1, "uuid": "727338490014aad7e053faea55e7e508519fee6d"}, "author": "believeittravels", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99368-r467310267-Courtyard_New_York_Manhattan_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "DISAPPOINTED", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I was at this hotel from March 9 - 13th. I had never been to NY and as a travel agent, I was hoping to have a memorable experience that I could share with my customers later. The city, itself, lived up to its reputation. However, the hotel did not. I have stayed at other marriott properties and was very happy with my experiences. But my stay at this hotel proved to be the worst I have ever had. The first night we were looking for a place to eat and when I called down to the concierge desk, I had to leave a message. I never got a return call. We ended up getting a recommendation from Miguel at the front desk who was very nice. My friend's birthday was on Saturday, so on Friday afternoon I called and arranged to have some balloons and a non-alcoholic beverage placed in our room as a surprise for when we got back from sightseeing on Saturday evening. Needless to say, they weren't there and the surprise was ruined when I had to call to find them. I spoke with Karen the manager who seemed as though she was irritated with me for inquiring about them. Her attitude was not the best. I was told that they did not have time to bring them up. I know they are busy, but to not be able to grant the request of a customer within a 24 hour period is ridiculous. About an hour later, the balloons arrived tied to a bottle of chardonnay (an alcoholic drink). The icing on this disastrous cake came when I called down to the concierge desk to have them get us a cab to go to dinner. I started calling the desk around 6:30pm and no one answered. I called until about 6:55 when we decided to get dressed and go down to the front desk. We were told that the concierge had gone on break until 7:30 pm. We explained to no avail that we had been trying for over 20 minutes to get him prior to coming down. Aside from Miguel's pleasant attitude when we checked in, the hotel's location and the comfortable bed in my room, my stay at this hotel was my last one. I will not be recommending this hotel to any of my clients.", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-29T13:55:33.994+03:00", "highlightTitle": ""}