{"organizations": [], "uuid": "c472950340041bc95a8da6da1d81eee8bc46fdc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/99/27/00/relais-christine-entrance.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d219977-Reviews-Relais_Christine-Paris_Ile_de_France.html", "section_title": "Relais Christine - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d219977-r469552752-Relais_Christine-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Very surprised and disappointed", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Very surprised and disappointed - Review of Relais Christine, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "c472950340041bc95a8da6da1d81eee8bc46fdc8"}, "author": "travellingmary529", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d219977-r469552752-Relais_Christine-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Very surprised and disappointed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We had stayed in the Relais Christine last November and loved it and as we had an anniversary to ceobrstr. were really looking forward to a return visit in March. It is a very expensive but we thought that the rate of € 350 per night was worth paying to stay again in this lovely hotel. We got an email from the hotel two weeks before our intended visit to say that them final phase of renovations being carried out on the hotel had not been completed and that there would not be access to the new lounge and spa areas but that they looked forward to welcoming us and apologised for any inconvenience. We assumed therefore that the repair works were of a fairly minor nature and wouldn't interfere with our visit. We arrived at the hotel to find that far from minor renovations to be finished, the hotel was\nlike a building site. There was workmen working away everywhere- it was very noisy with the sound of drills from different directions - there was dust everywhere and there was a strong smell of paint all over. The two lounge rooms that we had enjoyed sending time so\nmuch in the last time were blocked up and a tiny room that was like a small waiting room with very uncomfortable looking chairs was the only common area in which to sit.\nWe were so disappointed that we could hardly believe our eyes and ears.\nWe expressed our dissatisfaction to the front desk and the lady there was understanding when we said that we couldn't stay due to the noise, the smell and the all pervasive dust in the air. This lady offered to ring another hotel to see if there was a vacancy and after a while, another hotel was found for us. The manger called a a taxi to the other hotel and told us that the Relais Christine would pay the fare. He also apologised and said that if we came back another tjme, we would be upgraded to a suite. We got the taxi and when we mentioned to the driver that the Relais Christine had paid the fare, the driver knew nothing about about it and we had to pay! I don't think we would be relying on the promise of being upgraded if we were to come again!\nWe really couldn't believe that the hotel actually expected that we would want to stay in the hotel in the state that it was in, for the rates we were paying.\nVery unhappy and disappear with the experience.", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-27T22:29:59.356+03:00", "highlightTitle": ""}