{"organizations": [], "uuid": "5f127595b55b515cfdfe3f6de7a1df2de17e0acc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/1d/07/ce/lobby-artwork-by-gregory.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d8680787-Reviews-or10-The_Renwick_Hotel_New_York_City_Curio_Collection_by_Hilton-New_York_City_New_York.html", "section_title": "The Renwick Hotel New York City, Curio Collection by Hilton - UPDATED 2017 Reviews &amp; Price Comparison - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d8680787-r469848966-The_Renwick_Hotel_New_York_City_Curio_Collection_by_Hilton-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Very Disappointing", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Very Disappointing - Review of The Renwick Hotel New York City, Curio Collection by Hilton, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-24T03:00:00.000+03:00", "replies_count": 1, "uuid": "5f127595b55b515cfdfe3f6de7a1df2de17e0acc"}, "author": "tint7003", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d8680787-r469848966-The_Renwick_Hotel_New_York_City_Curio_Collection_by_Hilton-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Very Disappointing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For a two night stay in early March we decided to try the Renwick instead of our usual Hilton NYC choices and we regretted it. We're diamond members of Hilton's Honors programme but there was nothing special about our stay here that acknowledged this loyalty.\nThe Hotel is good looking on the surface and trendy, and it offers a great location. The bed was comfortable and the shower excellent.\nWe checked-in online as Hilton urges you to do, but this was a pointless process because the Hotel hadn't loaded any floor plans on to the system so room choice was just a lottery. In our reservation we had requested a room away from the elevators but were allocated one right alongside them. This room was very small and dark. We requested a move and got a slightly larger room but this too was directly alongside the elevator.\nThe rooms have no coffee making facilities so complimentary coffee is offered in the lobby in the mornings only - but not until 7am which was too late for us. Breakfast too isn't available until 7am.\nRooms offer a bathrobe, but only one, regardless of the number of guests staying. We were two guests - we complained about this and were told by an unsympathetic manager that one robe per room was the hotel policy and that this wouldn't change. A second robe was eventually sent up. The complimentary bottled water offered to Honors members was not supplied and we had to chase this too. We certainly weren't left with the impression that the Renwick had in any way prepared for our stay.\nThere was very limited storage space in the room and the air-conditioning unit made a huge amount of noise which disturbed us. There was just a light blind across the window so it was impossible to get the room dark for sleeping.\nOn our first night before 5am an alarm sounded throughout the property and we evacuated. This turned out to be a false alarm so we returned to bed, only to have the process repeated 40 minutes later. No apology was offered.\nWe shared our feedback constructively with the Duty Manager at the time of our stay but he was unreceptive to this and it was only when we raised our concerns to Hilton subsequently that the Hotel paid any attention to these.\nIn our experience the Renwick focuses disproportionately on appearances and surface chic. It lacks real warmth and fails to pay sufficient attention to the all-round guest experience. We won't be back.", "external_links": [], "published": "2017-03-24T03:00:00.000+03:00", "crawled": "2017-03-31T17:50:07.633+03:00", "highlightTitle": ""}