{"organizations": [], "uuid": "1228902d9af0b74e1cda3c447c057a1892776f59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/ff/a2/1a/paramount-hotel-times.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93517-Reviews-or20-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "section_title": "Paramount Hotel Times Square New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93517-r467301752-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Disappointing.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Disappointing. - Review of Paramount Hotel Times Square New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "1228902d9af0b74e1cda3c447c057a1892776f59"}, "author": "Adam G", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93517-r467301752-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Disappointing.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I had really high hopes for the hotel and was sadly disappointed.\nArriving at the hotel and walking into the dark, and odd smelling lobby (minty/musty smell). The first thing we noticed was lots of people sitting around eating fast food with their suitcases waiting to be picked up. Felt more like a bus station than a 4* hotel.\nCheck-in was the most awkward/disappointing part of the stay - They say first impressions count and I feel like our interaction here tarnished the whole stay.\nTravelling with my partner the lady who checked us in mistakenly assumed we were friends and advised us on 3 different occasions throughout the checking in process that we had booked a double room and the beds were small, despite after the first time she said it. Acknowledging it was absolutely fine. Made us feel quite uncomfortable. This was in between her shouting to a colleague in the back office a personal conversation regarding her lunch.\nThe bedroom was perfectly pleasant. Beds very comfortable. TV remote did not work particularly well. But that's all fine because you don't go to New York to sit in a room and watch TV. Outside noise was perfectly tolerable too.\nBathroom was a bit poor. Bath tub in a state of poor repair with big chips missing in the enamel. Damaged toilet seat.Sink slow to drain and water pressure and temp not great. - I know this is due to it being an older building though.\nHotel is in a fantastic location. Could not fault that one bit!\nDidn't use the restaurant. But did have a drink at the bar. Reasonably priced for New York and a nice atmosphere. Expert staff made great cocktails.\nOverall I felt let down by the reception staff and the lobby environment. I think both could be managed a lot better to provide a 4* quality of service. The location was great, but as there are so many other hotels within a few blocks of the hotel, as a result I would not stay here again or recommend it to anybody else.", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-30T19:06:00.996+03:00", "highlightTitle": ""}