{"organizations": [], "uuid": "8b183ecdff9c7aaa5f0323cffdd92ff86772ae4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/01/a3/c0/asara-wine-estate-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g312673-d1056686-Reviews-Asara_Wine_Estate_Hotel-Stellenbosch_Western_Cape.html", "section_title": "Asara Wine Estate &amp; Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Stellenbosch, South Africa) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g312673-d1056686-r467647931-Asara_Wine_Estate_Hotel-Stellenbosch_Western_Cape.html", "country": "US", "domain_rank": 189, "title": "Asara, not a place for a group.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Asara, not a place for a group. - Review of Asara Wine Estate & Hotel, Stellenbosch, South Africa - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "8b183ecdff9c7aaa5f0323cffdd92ff86772ae4e"}, "author": "Robert M", "url": "https://www.tripadvisor.com/ShowUserReviews-g312673-d1056686-r467647931-Asara_Wine_Estate_Hotel-Stellenbosch_Western_Cape.html", "ord_in_thread": 0, "title": "Asara, not a place for a group.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I'm a tour director with over 30 years experience in the travel industry who comed from a family of hoteliers.\nI recently had a group which was supposed to stay at the Spier wine estate.(I was recently at Spier as well which was a real professional setup. ) Unfortunately Spier was overbooked and our group had to stay at Asara. The experience was like chalk and cheese.\nAn hour prior to arrival when I phoned Asara I was informed by their manager on duty that each guest needed to present their credit card and leave an imprint with the office.Now this is not a practice with groups, because with hotels experienced in dealing with groups, the hotel already has each gues'ts details. The hotel has a rooming list and the tour director gets a copy. On checkout the front desk informs the tour director if any accounts are outstanding and the matter is taken care of before departure iInstead of wasting time and belittling the guests. Eventually all presented their credit cards under extreme duress because the bottom line was if we didn't comply we couldn't stay.Bearing in mind the account was already pre paid.\nImmediately thereafter the establishment presented all with indemnity forms which we were forced to sign with the same threat. \"If you don't sign you don't stay.\" I pointed out to all present including the manager that I was signing under extreme duress.\nOne guest asked why such draconian measures and was given a whole list of reasons which ended off \" in case someone smokes in their room.\"\nTwo days after departure I received a phone call from Asara informing me that two of my guests had smoked in their rooms and that R1,500.00 was being deducted from the credit cards. The one guest swore she had not smoked in the room, merely thrown her cigarette stubs in the waste basket after returning from dinner as she didn't want to throw them in the garden.\nThe approach of Asara toward its guests is a very inhospitable way to treat groups and it appears that pouncing on smokers is a sly way of making money.\nRoom Tip: Ask for room with balcony facing wineland and not one that opens onto a dark, dingy courtyward. See more room tips", "external_links": [], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-27T03:43:33.706+03:00", "highlightTitle": ""}