{"organizations": [], "uuid": "9960fa260253476928288b5acea764e494c1b933", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/22/dd/ba/hotel-du-midi-paris-montparnas.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197628-Reviews-Hotel_Du_Midi_Paris_Montparnasse-Paris_Ile_de_France.html", "section_title": "Hotel Du Midi Paris Montparnasse - UPDATED 2017 Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197628-r464844967-Hotel_Du_Midi_Paris_Montparnasse-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Not again, would advise others to steer clear", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Not again, would advise others to steer clear - Review of Hotel Du Midi Paris Montparnasse, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "9960fa260253476928288b5acea764e494c1b933"}, "author": "Rhubarb_banana", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197628-r464844967-Hotel_Du_Midi_Paris_Montparnasse-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Not again, would advise others to steer clear", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Where to start, we arrived in Paris after the flight from hell from Gatwick, to find our room not ready. After 2pm (the check in time), we had to wait over two hours for our room. Having worked in hotels i brushed this off as these things happen and it was no ones fault really. From there is where the saga begins though. Having emailed ahead to give a heads up of mine and my girlfriend's engagement they kindly (or so i thought) offered us a newly refurbished room and a bottle of champagne in the room on arrival. A nice gesture? Think again. On check out we were due to settle our €280 bill, which had somehow now turned into a €470 bill. The staff member on reception was as polite as she could be considering the massive language barrier, and advised that we had been charged for three bottles of champagne, at €50 a pop. We managed to get this sorted fairly quickly, however we couldn't fathom why we had been charged an additional 20 euros to borrow two adaptors as we had forgotten ours and were offered them when we arrived with no mention of a cost. We were simply told there was nothing they could do about that. We left our cases at the hotel and returned on our way to the airport when we were actually given the 20 back for the adaptors, as i think they must have realised the sheer audacity. The room we stayed in was okay but basic, we had a lovely view of one of Paris's nicest carparks, it was very romantic. Bar the nice young girl on reception, every other staff member was incredibly rude and unhelpful. It seems as soon as they hear an English accent you are a no go.", "external_links": [], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-28T14:09:10.529+03:00", "highlightTitle": ""}