{"organizations": [], "uuid": "121b46283be45dfcd5c40c89c05c638c7d874d96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/57/33/73/prince-s-square-apartments.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d1216992-Reviews-Prince_s_Square_Apartments-London_England.html", "section_title": "Prince's Square Apartments - UPDATED 2017 Hotel Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d1216992-r466744988-Prince_s_Square_Apartments-London_England.html", "country": "US", "domain_rank": 189, "title": "Good location but that's about it", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Good location but that's about it - Review of Prince's Square Apartments, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "121b46283be45dfcd5c40c89c05c638c7d874d96"}, "author": "422lily", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d1216992-r466744988-Prince_s_Square_Apartments-London_England.html", "ord_in_thread": 0, "title": "Good location but that's about it", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The hotel is a good choice if the reason for your stay is to go partying and you could not care less about the quality of your environment.\nWe stayed with my boyfriend in a double room for six nights. What first struck me was the disgusting kitchen area, with a huge moldy/wet/burnt stain on the floor in front of the fridge. Some of the equipment were not working like the hi-fi and one of the lamps. The Wi-Fi was working now and again, but most of the time not really.\nThe windows were in such poor condition that even with the heating on it was really cold sometimes.\nThe bathroom shelf would need a good cleaning.\nIn the beginning of our stay there were moments when we had no hot water and for the last 3 days I couldn't take a warm shower anymore, although I tried in 30 min intervals. This particularly was very inconvenient.\nWhen it comes to the housekeeping, we always received new and clean towels and our bed was done as well. But that's all. The floor had not been cleaned for the whole week and the kitchen area was not touched either.\nThere was a fire drill during our stay which turned out to be false. All the guests were awkwardly waiting in the hall, later moved outside then decided to go back when the alarm sound ended. During this time the receptionist was talking on his phone and did not bothered to instruct the guests at all. Eventually we went back to our rooms when one of the guests asked the receptionist if it is safe to go back.. Even if it was a false alarm, the overall carelessness and lack of interest/management skills were very shocking.\nBy the check-out from the hotel we weren't even asked if we liked our stay, if everything was fine or not even thanked for our stay. It is a really minor thing but it does make a difference. I have never been to any hotel where I was not politely thanked for my stay in the end of my visit.\nOn the positive side, the location is truly excellent, the Bayswater and Queensway tube stations are within 15 min walking distance, Hyde Park reachable by foot within 10 min. Tesco, Sainsbury's and countless restaurants nearby.\nAll in all, the stay in the hotel was okay. With minor fixes and with minimum effort the hotel could be improved greatly. But it seems that the management is not willing to invest money and I am sure they have their reason for it.", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-31T17:39:29.170+03:00", "highlightTitle": ""}