{"organizations": [], "uuid": "d4c63bd0c26250f6009196ff70d68e1dc8e0de4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/7f/ee/6f/street--v7963142.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d567407-Reviews-Hotel_du_Prince_Eugene-Paris_Ile_de_France.html", "section_title": "Hotel du Prince Eugene - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d567407-r468750914-Hotel_du_Prince_Eugene-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Good Hotel but BAD SERVICE!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Good Hotel but BAD SERVICE! - Review of Hotel du Prince Eugene, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 1, "uuid": "d4c63bd0c26250f6009196ff70d68e1dc8e0de4b"}, "author": "PoojaNataraj", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d567407-r468750914-Hotel_du_Prince_Eugene-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Good Hotel but BAD SERVICE!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed there last week, checked in a bit late at about 2200 hrs. The man at the reception was not very warm and did not mention anything about the extra taxes that needed to be paid (It was collected while checking out when we were getting late to get to the airport early in the morning!). Allotted the Attic room on the 6th floor. Although the room is tiny, it is well furnished and the bed is very comfortable, the bathroom is very clean and well maintained.\nGood Points: The hotel has great connectivity in terms of trains and lovely restaurants around the neighbourhood. The Hotel is very well maintained and the room is cleaned everyday. The bathroom is a good size and is comfortable.\nThe bad part is here: The air-con wasn't working and I called the reception and requested a change of room or at least the air-con be fixed, he categorically said they have no rooms available (which wasn't the case as I immediately checked online and it was available) and said he will send someone to repair the air-con the next day. I had to open the window and it is a busy street with vehicles all night and I couldn't sleep. The next day no one came to fix the air con and thus went by the remaining 6 days that I stayed there - with very little sleep. They had mineral water in the room on the first day and after that no water was provided and when asked about it they very coldly answered that it is their policy to offer a bottle of water only on the first day, how funny! Either give a bottle of water everyday or don't give at all!\nThe elevator is a bit senile and responds late!\nOver all, although the hotel is very boutique and well designed, the staff attitude makes it a poor hotel experience. I do not recommend it to those who are used to warmer hospitality!\nRoom Tip: Attic rooms on the 6th floor are tiny and stuffy See more room tips", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-28T02:30:56.194+03:00", "highlightTitle": ""}