{"organizations": [], "uuid": "b9d59fc4b7844d96be8e9d00d8ad704b57924be6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/37/e2/6a/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d559692-Reviews-Eiffel_Villa_Garibaldi-Paris_Ile_de_France.html", "section_title": "Eiffel Villa Garibaldi - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d559692-r468997267-Eiffel_Villa_Garibaldi-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "You and your belongings are not safe in this hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "You and your belongings are not safe in this hotel - Review of Eiffel Villa Garibaldi, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "b9d59fc4b7844d96be8e9d00d8ad704b57924be6"}, "author": "qltyhlth", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d559692-r468997267-Eiffel_Villa_Garibaldi-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "You and your belongings are not safe in this hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I knew that when I booked my room at this hotel that I was going to get what I paid for. When I arrived, I was not surprised to find that the walls are paper thin and you can hear everything from the hallway and neighboring rooms; that the toilet seat was broken; the door on the closet didn’t shut correctly; very few coat hangers in the closet and one was broken; things had to be taken out of the closet to have room to hang any clothes; and the extra blankets in the closet were dirty. They also offer breakfast in the morning for 13 euros, which is worth more like 6 euros. It’s no more than a basic continental breakfast.\nWhat I did expect is that I spent enough money for my belongings and I to be safe while I was staying there. I am a female that traveling by myself, so wanted to feel safe. If feeling safe is important to you, this hotel is not for you. You’re better of splurging and spending the extra money at a better hotel or just spending less and staying at a hostel, you will probably be safer at a hostel.\nAfter the first day of exploring Paris, I came back to find each of the zippers on each of by bags had been opened. All my things had been gone through and money I had left inside of one the compartments of my suitcases had been stolen ($100 USD and $100 Euros). I know it was probably not the best idea to put it in there, but I was worried about getting pick-pocketed in the touristy areas in Paris, so I did not want to carry all my cash around with me. I was only later told that the hotel has a safe. There is no notice of this anywhere in the hotel and the front desk staff member never notified me of this.\nI immediately reported this to the only staff member available and he was extremely rude and told me that I was lying to him about having the money stolen. The next day I saw the manager and she tried to blame me by asking if I left the door open. I always check to make sure the door is shut, but the doors close automatically behind you, so it doesn’t matter. I asked the manager if she has checked the video camera that is pointing at my door and she said no because they must request the footage from the company and she did not plan on requesting the footage. Why have video cameras if you won’t use them when a crime is committed? I guess they are just for show. Both the front desk staff member I reported it to and the manager shrugged it off eventually by saying I could just submit to my insurance company, like it didn’t matter that I felt violated by having someone on their staff go through all my belongings.\nI felt so unsafe in this hotel after this experience and my encounter with the staff that I slept with one of the beds pushed up against the door each night. I was offered no apology, no reimbursement for what was stolen, and no refund (even partial) for my stay. I have emailed the hotel four times about this with no response.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-31T05:53:38.099+03:00", "highlightTitle": ""}