{"organizations": [], "uuid": "a57eac84a3ee5b8cfeaa0d64aa9281419612c212", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/07/de/35/hudson-hotel-new-york.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d223023-Reviews-or60-Hudson_Hotel_New_York-New_York_City_New_York.html", "section_title": "Hudson Hotel New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d223023-r464151311-Hudson_Hotel_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Unremarkable, with unpleasant surprises", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Unremarkable, with unpleasant surprises - Review of Hudson Hotel New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-02T02:00:00.000+02:00", "replies_count": 1, "uuid": "a57eac84a3ee5b8cfeaa0d64aa9281419612c212"}, "author": "Y7343KRwilliamm", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d223023-r464151311-Hudson_Hotel_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Unremarkable, with unpleasant surprises", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's easy to be duped by the outward swagger of this hotel, but fundamentally it is an unremarkable hotel with some unpleasant surprises.\nPositives: The hotel is well located in Midtown/Hell's Kitchen, walkable to the famous avenues and just around the corner from Central Park. It is also relatively well priced, but look out for the hidden charges I note below.\nNegatives: The compact room was stylishly lit but ultimately too dark, with no main light, and had no wardrobe or drawers, so we could barely unpack. The heater/cooler was ludicrously noisy, and the hotel provides no beverages whatsoever in the room (we ended up asking the lobby staff for little bottles of Voss water behind the check-in, which they were happy to give, begging the question why they weren't simply provided in the rooms - the answer is that it's cheaper if a minority of guests ask). The hotel is huge and very busy - the lobby has the bustle of an airport, and the bars are typically packed, so forget having a quiet drink before heading out in the evening. Whatever room rate you find online, ADD $32 A NIGHT TO IT, because the hotel levies this as a non-negotiable daily fee. Only a minority of this amount is a state tax, the remainder made up of a $10 credit usable in the bars and restaurants, and a \"WiFi charge\" (which is scandalous when you consider that free in-room WiFi is now almost ubiquitous in big cities). The hotel staff didn't make clear at check-in that the $10 credit is non-accruing (i.e. \"use it or lose it\"), which was annoying when, relying on our assumed credit, we had breakfast in the hotel and were charged the full whack (the hotel staff assured us at check-in that any unused credit would be \"refunded\", another misleading titbit given, as the credit was non-accruing, the maximum refund could only ever be $10). When I challenged this at checkout I was met with irritated indifference. The breakfast, by the way, was extortionately expensive - $69 for a lukewarm buffet for two, and two coffees. Finally, the crowd that gravitates to the hotel and lingers in the common areas is, broadly, the bad type of instagram hipster.", "external_links": [], "published": "2017-03-02T02:00:00.000+02:00", "crawled": "2017-03-30T01:56:32.136+03:00", "highlightTitle": ""}