{"organizations": [], "uuid": "ed30efea6ce7bda968a1e93aeef0da987d0c5378", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/23/78/44/rome-times-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d3964772-Reviews-or5-Rome_Times_Hotel-Rome_Lazio.html", "section_title": "Rome Times Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d3964772-r468763340-Rome_Times_Hotel-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Good location but noisy, smelly and bugs", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Good location but noisy, smelly and bugs - Review of Rome Times Hotel, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "ed30efea6ce7bda968a1e93aeef0da987d0c5378"}, "author": "rheannac768", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d3964772-r468763340-Rome_Times_Hotel-Rome_Lazio.html", "ord_in_thread": 0, "title": "Good location but noisy, smelly and bugs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Booked this hotel through a package with British Airways and seemed like a good deal. The location was perfect when we arrived and was in good walking distance from important sightseeing locations! That and the breakfast were the only positives! (Staff in breakfast area were fantastic!!)\nWe originally had room 105 and seemed okay but it was right at the top of the stairs and we could hear them setting up breakfast and hear the cutlery being placed on the tables- and then throughout the night banging from reception below! We spoke to reception which thankfully changed us to a room on the next floor up 206!\nOn entering the room there was a strong smell of paint but we just put this down to them maybe painting recently and opened the windows.\nOn the third day the safe in our room broke- we think the battery has died so we let reception know, we also mentioned the AWFUL SMELL OF STRONG PAINT in the room all through the night, they sent someone up to look at it and what they could do the guy said that he would return with a new battery as soon as possible, after waiting 45 minutes we decided to just take the valuables with us as we weren't wasting the rest of the day.\nOn our return 4 and a half hours later we saw that the battery hadn't been replaced and the room stunk of paint still, we could air this out through the day with the window but at night it was so noisy we couldn't open the window.\nI visited reception again to ask about the safe to which they told me they would send someone up. After another hour and 2 visited downstairs to reception someone finally came up to fix it with no apology for the delay.\nIt was so frustrating having to deal with going downstairs to talk to reception, when they clearly didn't want to help with regards to the smell so I gave up trying with them!\nThey still didn't do anything about the smell which was nauseating at night, apparently they had painted a few days ago but we had been there 5 days at this point and that strong a smell shouldn't be there for 5 days! To top it of we found silverfish (small bugs that live near damp) in the bathroom!\nWhen I explained this to reception as we left no apology or were even asked how was our stay.\nWould avoid if you want a decent nights sleep.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-28T02:35:49.959+03:00", "highlightTitle": ""}