{"organizations": [], "uuid": "0c220f72d29f95880c4602234f456d6eb0b49e2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/6f/74/26/reception-area.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d3235844-Reviews-or20-Pod_39_Hotel-New_York_City_New_York.html", "section_title": "Pod 39 Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d3235844-r464269945-Pod_39_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Pass on This Poor Pod -", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Pass on This Poor Pod - Review of Pod 39 Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "0c220f72d29f95880c4602234f456d6eb0b49e2b"}, "author": "MDGypsy", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d3235844-r464269945-Pod_39_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Pass on This Poor Pod -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I've stayed at Hotel Pod 51 numerous times with a good feeling of above average bang for the buck. I wrongly assumed the Pod 34 would be similar. The only similarity was the size of rooms. But I believe the size of a queen was smaller in 34 than 51. It was not comfortable for 2. There is no way to be comfortable sitting almost in the bathroom with your partner even if you're standing as far away as possible. If you have more than two large bags, then you will not fit here and be able to open the door. But I can deal with the lack of size, but not lack of cleanliness. I had to dust the windows and shades, and no one had touched inside the shades for ...a very long time. The bed headboard is smashed up under this dirty window, and the cold air vigorously blows onto your head. Your options are to stuff the holes with towels and blast the heater which then leaves you with a cold head and dehydrated. The comforter is dirty. They need duvets that can be washed for each guest. I had to just ask for extra towels to use as blankets. The noise is difficult to sleep with from the streets below. The TV channel options are very nice. The elevator and lobby smell badly and make you feel like your staying in a run-down 1-star hotel. The front desk is cordial, and that's all. They advertise that they have an airport shuttle. They mean the Super Shuttle which comes to most hotels anyways. But they can arrange a car to the airport for you at 65$. Uber would be about 48-50$ to/from the JFK airport. The location is just OK, and not by anything special, including food. For 25$ more I could have stayed at a much nicer hotel in a better location.\nRoom Tip: Get the largest you can book, which is Queen, if you must stay here. See more room tips", "external_links": [], "published": "2017-03-03T02:00:00.000+02:00", "crawled": "2017-03-31T21:50:17.764+03:00", "highlightTitle": ""}