{"organizations": [], "uuid": "67e89d2dbc5220826e2581bac43cba13a84db66a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/79/04/ca/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d207568-Reviews-BEST_WESTERN_Hotel_Eiffel_Cambronne-Paris_Ile_de_France.html", "section_title": "BEST WESTERN Hotel Eiffel Cambronne - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207568-r469317378-BEST_WESTERN_Hotel_Eiffel_Cambronne-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "\"Awful\" Cambronne", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "\"Awful\" Cambronne - Review of BEST WESTERN Hotel Eiffel Cambronne, Paris, France - TripAdvisor", "spam_score": 0.003, "site_type": "discussions", "published": "2017-03-22T02:00:00.000+02:00", "replies_count": 1, "uuid": "67e89d2dbc5220826e2581bac43cba13a84db66a"}, "author": "Kentgirl123", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207568-r469317378-BEST_WESTERN_Hotel_Eiffel_Cambronne-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "\"Awful\" Cambronne", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed here for 3 nights (currently still here actually) and we wish we didn't. We had read reviews before and knew it wasn't going to be free at, but we thought it says it has a good location and we wouldn't be spending much time in the hotel. We booked through Expedia and paid for breakfast.\nWhen we first got there, lady was pleasant, we were on the 6th floor and the lift is so small we couldn't actually fit us 2 people and a bag each. We ended up just walking up instead. The room is small with a small balcony with fake grass. Room was okay until we laid on the bed, two singles pushed together with one double sheet, even though we asked for a double. No main light, just two lamps, so at night and in the morning, it's very dark.\nThe shower was quite good however. The toilet was in a corner, barely any room to move, and right next to a radiator which had been put on full heat, so when sitting, I burnt my arm on it.\nBreakfast....we knew it was just continental and the first day we went down, we thought it wasn't too bad. (Apart from the one lady who just stares at you and hovers waiting for you to finish so she can clear away). There were croissants, bread, cereals, egg and sausages, yoghurts, fruit and cakes. Then we went down a second day, it was the same loaf of bread and loaf of cake as the day before, so it was stale. The third day, there were no sausages, none of the cereal that my boyfriend had been eating (he's obviously just eaten the last box the day before and they did not replenish), no loaf of bread, and no apple juice. Oh also no plates or cutlery on any of the tables. I had to ask, and then she bought over ONE plate which was dirty, and the other plate and cutlery about 5 minutes later.\nI ended up eating a croissant on a napkin.\nFairly decent Location, about a 15-20 minute walk to the Eiffel Tower and Uber's are always around so we used those quite a lot.\nThey obviously don't have people stay for multiple nights very often as when we checked in and said three nights, the lady looked very happy and shocked at the same time (now we know why!).\nI wouldn't recommend this hotel, even for the location, and I definitely will not be going 'budget' in the future regardless of how much (or little) time I think we'll spend in the hotel!", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-22T02:00:00.000+02:00", "crawled": "2017-03-29T08:35:59.836+03:00", "highlightTitle": ""}