{"organizations": [], "uuid": "bec9a8eb719a3ce407d3fd9f8fa2ae811847a361", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/ce/2a/a9/junior-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d207854-Reviews-Villa_Beaumarchais-Paris_Ile_de_France.html", "section_title": "Villa Beaumarchais - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207854-r450903384-Villa_Beaumarchais-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "WORST hotel experience of my life!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "WORST hotel experience of my life! - Review of Villa Beaumarchais, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "bec9a8eb719a3ce407d3fd9f8fa2ae811847a361"}, "author": "LadyMP1", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207854-r450903384-Villa_Beaumarchais-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "WORST hotel experience of my life!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DO NOT STAY AT THIS HOTEL!! I have never had an issue with a hotel before, let alone made a complaint or left a negative review. But after my atrocious hotel experience at Villa Beaumarchais, I feel it's absolutely necessary to inform other potential guests.\nI came back to my room after housekeeping had visited to find my perfume broken and placed back on the side table with the cap on to cover up the damage. The damage to the nozzle was irreparable. Upset, as the perfume was a gift and this has never happened to me before, I immediately informed the staff at reception and was told that the manager would contact me to arrange compensation for the bottle. The manager was incredibly difficult to contact and appeared to be avoiding my repeated requests to talk with her. I had to follow up numerous times over the course of several days before sending two emails and calling the head of the hotel group. I was told that the manager would telephone me by 5pm - she never did. Finally, the manager emailed me to say that the housekeeper had \"found the bottle lying on the floor\" (unsurprisingly), denied any responsibility for the safety of my belongings (despite being a hotel, isn't that what you pay for?) and refused to compensate me for my loss. I am absolutely appalled by the way the staff and manager handled my situation - the staff were rude, dismissive and unsympathetic. Not only this, but the carpet in the room was wet when we arrived and the wifi worked intermittently. I was woken by a baby crying in a nearby room at 3am several nights and we had to pay to print a boarding pass at reception. Our room was small, cluttered and uncomfortable. I repeatedly came back to the hotel rooms to find my belongings moved around, despite specifically asking reception to kindly ask housekeeping not to. We had to pay extra to use an iron and there was no complimentary water or tea/coffee facilities. Our stay at Villa Beaumarchais completely ruined our holiday and impression of Paris - beyond disappointed that I am coming home with broken belongings that I now have to pay to replace. Will never EVER stay here again.", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-30T07:30:24.917+03:00", "highlightTitle": ""}