{"organizations": [], "uuid": "4b3349fede3716ba11269c2baefeb26d4db87559", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/55/ae/de/park-lounge-bar.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93520-Reviews-Park_Central_Hotel_New_York-New_York_City_New_York.html", "section_title": "Park Central Hotel New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93520-r471535055-Park_Central_Hotel_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Less than a one star hotel! Very disappointing!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Less than a one star hotel! Very disappointing! - Review of Park Central Hotel New York, New York City, NY - TripAdvisor", "spam_score": 0.029, "site_type": "discussions", "published": "2017-03-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "4b3349fede3716ba11269c2baefeb26d4db87559"}, "author": "Omar-ALZaid", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93520-r471535055-Park_Central_Hotel_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Less than a one star hotel! Very disappointing!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed in the hotel for about 4 or 5 nights. All of the staff are very rude, not welcoming, stand off attitude, and not helpful at all!! The only helpful lady was a Chinese lady in the gust relations, other than that All were rude!!\nWhen we firs checked in our room was very noisy, you can hear people talking from down the street, cars and busses passing by, even people in their rooms next to you!!\nI asked to move to another room and the guest relation told me to wait for the next day and bring all my luggage down to the storage before noon and they will arrange another room for me at around 4pm! The next day we were shifted to another room, is was somewhat better, but still had this noise as if you were located next to a metro station! The room was not a 4 star hotel room! The furniture could use some 4 star hotel upgrade, wardrobes and cabinets could use some fixing!\nOne of the electricity sockets in the toilet was very dangerous! There was a metal thing hanging out of it, i think if someone touches it he might be electrocuted (see picture below)!!!\nThere was no mini bar in the room and no coffee or tee or any of the complimentary utilities other 4 star hotels offer. if you want a fridge you will have to sign your name and wait! The same exact words by the front disk lady!\nThe room was not acceptable for a 4 star hotel in time square and for what i have paid!\nI went to the concierge to ask some questions, the lady was very rude and unfriendly, gave me a bunch of papers, and when i asked about direction she gave me this look as if it was not her job, and told me 2 words and that was it!\nNever recommending this hotel to a friend \"or enemy\"!\nDO NOT GO THERE", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-30T03:00:00.000+03:00", "crawled": "2017-03-31T19:59:15.443+03:00", "highlightTitle": ""}