{"organizations": [], "uuid": "62c7b3d91a658384b3d551a72590804d8e697eaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/03/bf/08/f1/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1783324-Reviews-Sheraton_Tribeca_New_York_Hotel-New_York_City_New_York.html", "section_title": "Sheraton Tribeca New York Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1783324-r468864556-Sheraton_Tribeca_New_York_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Would have been an excellent stay but", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Would have been an excellent stay but - Review of Sheraton Tribeca New York Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 1, "uuid": "62c7b3d91a658384b3d551a72590804d8e697eaa"}, "author": "nico4016", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1783324-r468864556-Sheraton_Tribeca_New_York_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Would have been an excellent stay but", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Check-in was smooth and quick and our room was spacious and clean. It was all great until we tried to place an order for room service breakfast the next morning. We followed the directions on the card that was given to us and hung it on our door for them to take. We requested a delivery between 10:15-10:30am. Woke up the next morning and no breakfast. Checked the door and the card was taken, so they must have received the order. We called to inquire about what happened and to cancel the breakfast since we had made plans that we needed to get to. Spoke to a gentleman who said he would get back to me about what happened and we never heard back from him. So that was very disappointing.\nWhile we were getting ready to leave for the day, housekeeping came by our room. We simply told them we were leaving shortly and to come back in a half hour and they said no problem. On our way out, we even spoke with the front desk and told them housekeeping stopped by and we want to be sure our room gets cleaned and she said she would notify them now. So, we came back well after five hours to our room not cleaned. We went down to the front desk and the man told us they were \"backed up and he'll check on it for us\" he also thought we had our DND sign on the door, but we never used it. Nothing ever happened, there was no follow through, so we gave up and had to request a whole set of things for the room (towels, soaps, shampoo, toilet paper, coffee, etc) and the woman rushed me off the phone so quickly and forgot half of the items we requested.\nEverything about this trip and hotel would have been wonderful had those few things not happened. It's frustrating to spend all of this money and simple things like getting your room cleaned doesn't get done or your breakfast order just mysteriously disappears.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-30T19:52:46.672+03:00", "highlightTitle": ""}