{"organizations": [], "uuid": "83a0efee6e82d01c6b7c0241e0908f9a6a5d027d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/73/86/43/living-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d112066-Reviews-or10-W_New_York-New_York_City_New_York.html", "section_title": "W New York - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d112066-r467358290-W_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Hilariously small room, robbery prices, priced gouged us for breakfast", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Hilariously small room, robbery prices, priced gouged us for breakfast - Review of W New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 1, "uuid": "83a0efee6e82d01c6b7c0241e0908f9a6a5d027d"}, "author": "Kinnsao", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d112066-r467358290-W_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Hilariously small room, robbery prices, priced gouged us for breakfast", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I booked this room through a sister hotel last minute as our flight changed a to day earlier and they were out of rooms there. This was literally the worst place i've ever stayed in my entire life, and I have spent nights on frat couches. Still worse.\nMy sister and I got placed in a \"cozy\" sized room, which I didn't realize was an actual hole in the wall that they threw some furniture into and hoped for the best. The bathrobe hanging in the barbie closet was a lovely shade of sweat-yellow. As soon as my sister turned on the hot water tap, it literally crumbled and snapped clean off. I don't even know how that happens. How does maintenance not catch that ? Either they cleaned our room without hot water, or were smoking a fat one and didn't care. The bathroom door, by the way, was translucent, so my sister could see me sneak away and gently sob on the tiny toilet. I won't even talk about the mini-bar. You know what you've done.\nOur \"view\" of New York was spectacular. We got to gaze into a beautiful dingy alley where i'm sure at least 57 drug deals have taken place. I have to say, however, that the tiny bed wasn't that uncomfortable at the times when my sister's kneecaps weren't stabbing into my spleen.\nThe real kicker was breakfast this morning. Because of the storm, the only option available was a \"buffet.\" My 4-year-old nephew could provide me a better breakfast with oven mitts taped to his hands. That is not a buffet, W. There were some small dishes of eggs, bacon(???) and potatoes, and it took them 40 minutes to refill the yoplait. I think we had a waiter. Not sure- didn't see him around. But this is all to expect for continental breakfast OH WAIT! Breakfast cost us 70 (that's SEVENTY) dollars plus a mandatory 18 percent service fee. That's great, W. Don't allow your guests to order a 17 dollar waffle because it's snowing and price gouge them instead. Real ethical. Please, at least use that money to fix the faucet and provide a new bathrobe for the next sucker that ends up in our room.\nAll in all, this stay in pseudo-Hades cost us hundreds of dollars, one wasted night, and irreversible psychological distress. Do you people have a conscience? You're a disgrace. Please, close your hotel and open a terrible dentist's office instead. At least when you ruin people's day, you'll be contributing to smiles.", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-31T19:57:55.431+03:00", "highlightTitle": ""}