{"organizations": [], "uuid": "11ee596b4bcb3f373a0590d51e9d8cec6acea516", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/86/8f/f0/suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d242962-Reviews-Relais_Hotel_du_Vieux_Paris-Paris_Ile_de_France.html", "section_title": "Relais Hotel du Vieux Paris - UPDATED 2017 Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d242962-r465024656-Relais_Hotel_du_Vieux_Paris-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Disappointed to say the least", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Disappointed to say the least - Review of Relais Hotel du Vieux Paris, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-06T02:00:00.000+02:00", "replies_count": 1, "uuid": "11ee596b4bcb3f373a0590d51e9d8cec6acea516"}, "author": "Danni_Smith", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d242962-r465024656-Relais_Hotel_du_Vieux_Paris-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Disappointed to say the least", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My sister had booked us flights and a night at this hotel as a wedding gift. When the airline told her they had moved our departure flight a day earlier my sister cancelled our reservation for this hotel and re-booked for two nights instead of one through booking.com.\nFinding the hotel was easy when we arrived due to it's great central location. On arrival when I told the concierge our details he said he had no booking for us, after checking mine, my husband's and my sister's names he was quite dismissive and questioned if we had the right hotel. - Perhaps this is a regular occurrence for them?\nWhilst I was trying to contact my sister another customer came down to reception to complain about her room and he told her very sharply that they were fully booked for the weekend and there was nothing he could do.\nAfter a panicked phone call to my sister she forwarded on the confirmation however, the concierge said the room had been cancelled. He said he could accommodate us for the Friday night but not Saturday, which we agreed to, intending to get further details from my sister to come back later once we had refuelled to deal with the issue of the missing night's booking.\nTo cut a long story short we were involved in an incident outside of the hotel's control, we returned to the hotel to ask for help and whilst we were in reception at this point the surly concierge was having a lovely conversation with another couple, so I wasn't quite sure why he had been so rude to us. He directed us to where to get help and was reasonably dismissive once again despite us being visibly shaken and upset.\nWhen we returned from a trip to A&E a new man was on reception who was the polar opposite of the original concierge, but he had no idea of what had happened with the rooms or with the incident (we had to explain everything all over again despite having been through a horrible ordeal). I would expect that both of these things would have been included in a handover between staff members on a shift change but this was not the case.\nThe room that was available was a superior room, it was up in the eaves and was whitewashed rather than wallpapered. A reasonably standard hotel room with a large double bed, TV, mini bar, I suppose the 'superior' part was due to a mezzanine floor with a small reading area. The room itself was completely fine but the bathroom was very cramped with barely room to stand in and the shower flooded the whole room with no wetroom drainage in place.\nAfter everything that had happened we weren't in the mood for a confrontation about our second night's accommodation, so after an awful first day, instead of an enjoyable second day in Paris we had to pack up, check out and go to another hotel (Odeon Hotel). The other hotel was actually much more reasonable, the room was slightly smaller but with a much nicer bathroom and included a good breakfast without the high additional charge (15 euros each) that the Hotel Relais Vieux wanted us to pay. They also gave us free bottled water for my husband to take the medication the hospital had given him to treat his injuries, not making us pay for it like the Hotel Relais Vieux did.\nOur trip was definitely tainted by the booking issue, I will definitely be confirming bookings made through third party website's in future so would recommend doing this for this hotel if you book this way. Further to that my advice for this hotel would be to deliver a more personal service for customers when something has gone wrong. A simple handover so we didn't have to go through what had happened to us again would have been my minimum expectation.\nIn summary, a disappointing service and not such great value on the room.", "external_links": [], "published": "2017-03-06T02:00:00.000+02:00", "crawled": "2017-03-29T09:04:38.773+03:00", "highlightTitle": ""}