{"organizations": [], "uuid": "4d3a76487be6c4194def623019380953a77dc1d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/2e/8d/c5/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g48080-d5523553-Reviews-or10-The_Paper_Factory_Hotel-Long_Island_City_Queens_New_York.html", "section_title": "The Paper Factory Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Long Island City, New York) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g48080-d5523553-r458553320-The_Paper_Factory_Hotel-Long_Island_City_Queens_New_York.html", "country": "US", "domain_rank": 189, "title": "Not Worth it.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Not Worth it. - Review of The Paper Factory Hotel, Long Island City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-04T02:00:00.000+02:00", "replies_count": 1, "uuid": "4d3a76487be6c4194def623019380953a77dc1d5"}, "author": "Velesha B", "url": "https://www.tripadvisor.com/ShowUserReviews-g48080-d5523553-r458553320-The_Paper_Factory_Hotel-Long_Island_City_Queens_New_York.html", "ord_in_thread": 0, "title": "Not Worth it.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed here back in January due to work.\nFront desk staff was immature and snippy. Not friendly, and only greeted me one time out of a 3 day stay. Did not properly inform me about any of the hotel amenities or facilities (you know things like game room, room service, restaurant or any of that stuff). Nor is there a hotel book in the room to tell you important things about the nearby area. I got more information about the hotel from the internet and trip advisor than the staff.\nI was given a room with a view of Northern Blvd, Kaufman Studios, and the Mercedes dealership next door it was located on the 5th floor. The room is arranged a bit awkward. The shower and toilet is in two separate rooms. The contractors who did the room, did a terrible job, water gets all over the floor when you shower.\nThe windows in the room are not insulated well, so its freezing. It took a long time before the room heated up (about 3 hours). After the room heated, the condensation started on the windows, bathroom and shower area so be prepared for water everywhere.\nBed was comfortable (My queen bed reservation was \"upgraded\" to a king upon check-in). The the room was not cleaned properly. As a wet towel was left on top of my window sill (I assumed b/c of the condensation) when I got into the room and it was never removed.\nYou're only given two bath towels and they are not large or plush at all.\nThe room only had one bar of soap, but lots of shampoo. (Luckily, I carry my own stuff).\nParking, in the area is difficult if you are driving as your have to be prepared to deal with street cleaning and construction. At night parking was fine, the area is safe. The train is down the block its a few minutes into the city if you need that, but the drive in is quick to the city at night.\nFor the price per the night they charge this is more like an upscale motel. It has the potential to be more but management needs to pay attention.\nWill not be staying here again. I would not recommend this hotel to anyone else. Not unless, it has a major change in management and customer service.", "external_links": [], "published": "2017-03-04T02:00:00.000+02:00", "crawled": "2017-03-30T23:55:27.717+03:00", "highlightTitle": ""}