{"organizations": [], "uuid": "137f392bcddf7d6114c81480d3ee635578fa8b00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/4b/8b/07/captain-s-room-at-rare.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1601249-Reviews-Hilton_New_York_Fashion_District-New_York_City_New_York.html", "section_title": "Hilton New York Fashion District - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1601249-r468799892-Hilton_New_York_Fashion_District-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Can't even get someone on the phone!!!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Can't even get someone on the phone!!! - Review of Hilton New York Fashion District, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 1, "uuid": "137f392bcddf7d6114c81480d3ee635578fa8b00"}, "author": "57clanof5", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1601249-r468799892-Hilton_New_York_Fashion_District-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Can't even get someone on the phone!!!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I have not yet stayed at this hotel but it's already been a nightmare. First, even calling to try to make my reservation a couple of months ago was a disaster. For some odd reason that I cannot comprehend, I couldn't get through. It was as if something was wrong with their phone system. I tried literally dozens of times to get through. I would have given up after just a couple of tries, but this was a reservation as part of a wedding block so I was feeling a bit committed to this hotel. Then I had problems with the block, such as availability (when we were still well within the window), pricing was off, and minimum nights stay was incorrect. Basically a disaster. Finally we got the reservation locked in, after a million calls and much wasted time. Then, nightmare part 2, which I'm still suffering through. My plans have changed and I need to change my arrival date. Over the past 2 days, I have been trying to contact the hotel at their main number and I literally cannot get through. Many many times, it has just rung and rung and rung and then I get a beeping noise and disconnected. Finally last night I was able to get in contact with someone at main guest services and tried to change my reservation. After 25 min of trying, they were unable to get into the system to change my reservation. They suggested I try back AGAIN this morning, which I did. So...again this morning I had to try several times to even get through. After getting through to someone at guest services, SAME THING. She was unable to change my reservation in the system. Said the reservation system was down. She also couldn't get through directly to the hotel, and SHE IS IN GUEST SERVICES!! Even she was blown away and couldn't understand what was going on. If it was just a one-off thing, I'd say whatever...the system goes down every now and then. But this - I have never seen anything like it. I do A LOT of travel for work, and have called hotels a million times. The difficulty I have had with this hotel has been unrivaled. I don't even want to call them again, but I'm forced because I need to change my reservation. Something is seriously wrong here. I hope once I get there, the hotel doesn't suck, but I'm so aggravated already and I haven't even gotten there yet. Not looking good. Good luck staying there if you can actually make an accurate reservation and get through to someone.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-30T20:24:24.855+03:00", "highlightTitle": ""}