{"organizations": [], "uuid": "595accdf51c1c5ab22a1fa3c20f33775e5b76069", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/6f/03/90/guest-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d233763-Reviews-Hotel_Roma_Sacre_Coeur-Paris_Ile_de_France.html", "section_title": "Hotel Roma Sacre Coeur - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233763-r466518026-Hotel_Roma_Sacre_Coeur-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Two Nights in Paris.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Two Nights in Paris. - Review of Hotel Roma Sacre Coeur, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-12T02:00:00.000+02:00", "replies_count": 0, "uuid": "595accdf51c1c5ab22a1fa3c20f33775e5b76069"}, "author": "AndyTheHuman", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233763-r466518026-Hotel_Roma_Sacre_Coeur-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Two Nights in Paris.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Hotel Roma Sacre Coeur was recommended to me on the basis of it being an affordable, well positioned hotel with clean rooms. Suffice to say two of the three promises were delivered. The hotel did have it's negatives but it also had it's positives.\nLocation: The location of the Hotel Roma Sacre Coeur cannot be disputed as excellent. Located in the city of Paris just above a metro station. The hotel does afford access to a wide range of things to do in Paris. There are a handful of tourist activities located a short walk from the hotel and there are bars and restaurants galore in the immediate area. The hotel does provide access to the heart of Paris. The view from the upper story rooms is particularly beautiful and offers a romantic Disney's Ratatouille-esque panoramic view of the wonderful city of Paris.\nAmenities: As a budget hotel, the Hotel Roma Sacre Coeur is not overly equipped with an abundance of amenities, which is to be expected at the price in the city of Paris. There was the usual safe for storage of valuables and a mini-fridge. Importantly, there was also air conditioning, which allows you to set the room temperature to your liking, regardless of the floor on the building you are located on. Useful for the lower level floors as the street can be rather noisy and opening windows will only serve to expose you to the sounds below. The free Wifi provided is excellent and the signal was very strong, even on the 5th floor where our room was located.\nCleanliness: The cleanliness of the room was perhaps the biggest downfall of the Sacre Coeur. To name but a few issues our room had mould on the curtains, rips and cigarette burns on the bed sheets and most disgustingly, dried urine on the toilet bowl. In addition to this, there was absolutely no shower curtain. Even under strict control the floor had to be wiped clean after each and every shower. The cleanliness of the hotel room was in my opinion, rather poor. Other broken articles include one of the two chairs was broken and unusable, the window would not lock correctly. The room had two doors, once of which prevented the door with the lock on it closing. The first night, we had not realized we slept with the front door open all night!\nRoom Size: For the price and the location, a large room would be unexpected. There was not enough room for two grown adults to move around without one having to step aside but this is not a major issue considering the circumstances. The room had two single beds in it which took up the vast majority of space. This is not a major issue however.\nCustomer Service: The staff were uninterested at best. Often friendly and welcoming until questions were asked. I found that they lacked knowledge of the local area and could not advise on how to get around the city. I had to look to Google to determine how to get places.One staff member struggled to find the hotel location on the free map provided by the hotel. Additionally, when it came time to check out at 5am there was no staff member at reception despite the boasts of 24hr reception. The front door was locked and we could not exit the hotel to catch our flight. We had to wake the receptionist from the luggage room in order to exit the hotel. Not an ideal sitution where urgency is required.\nValue: Overall, the Hotel Roma Sacre Coeur has it's positives and negatives. While the location and Wifi availability are strong positives, the cleanliness and the customer service were big drawbacks for me personally. For the cost of this hotel we would expect more from a hotel in terms of cleanliness, particularly when it came to the bathroom. I would be of the opinion that the Hotel Roma Sacre Coeur would be best viewed as a lower grade hostel at the price point of a mid-range hotel. I would give this particular hotel a 4/10.\nRoom Tip: Request upper story rooms for the best views of Paris. See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-12T02:00:00.000+02:00", "crawled": "2017-03-28T10:43:46.733+03:00", "highlightTitle": ""}