{"organizations": [], "uuid": "59e601ab1f7baae9f9b37d8422eb036d4a502694", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/7e/66/e8/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d587294-Reviews-or5-The_Westin_Paris_Vendome-Paris_Ile_de_France.html", "section_title": "The Westin Paris - Vendome - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d587294-r467924755-The_Westin_Paris_Vendome-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Much needed renovation", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Much needed renovation - Review of The Westin Paris - Vendome, Paris, France - TripAdvisor", "spam_score": 0.002, "site_type": "discussions", "published": "2017-03-16T02:00:00.000+02:00", "replies_count": 1, "uuid": "59e601ab1f7baae9f9b37d8422eb036d4a502694"}, "author": "Diana C", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d587294-r467924755-The_Westin_Paris_Vendome-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Much needed renovation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed at this hotel many times in the past and often continued to rebook due to location. This time will probably be our last time there as we checked out after the first night of a originally 5 night stay. This was also our first time with a child. This Westin should not be noted as a category 7 hotel within SPG. The rooms are run down, the furnitures are stained and worn, and beds are definitely not heavenly beds. The carpet was also very dirty which was possibly ok when it was just me and my husband but now we have a baby that wants to crawl every where. We booked a junior suite and was upgraded to a prestige suite due to our platinum status. You would have thought a prestige suite or above would have nice furnishing but this was not the case. I believe only if you book an ambassador suite or above, you will get a room that is worthy of the category 7. We ordered room service that night after arrival. A dirty glass full of old orange or lemon pulp was delivered with our meal. We were very surprised that such a glass even left the kitchen to be delivered to a room.\nIt was unfortunate that our stay was not satisfactory. I love the location of this hotel and only wish they would renovate soon as many hotels within Paris have gone through extensive renovations. We originally booked our stay under a prepaid rate but after showing management the condition of our room and the glass, they were kind enough to refund our money and allow us to move hotels. We were happy that they recognize that the conditions were not suited for our baby.\nI hope one day we can return again as the location is incredible. But until the Westin goes through an extensive renovation, we will be staying at the Prince de Galles.", "external_links": [], "published": "2017-03-16T02:00:00.000+02:00", "crawled": "2017-03-27T13:17:39.100+03:00", "highlightTitle": ""}