{"organizations": [], "uuid": "6b55987488e8d66f39bd8f1f04c9bb72b89a8202", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/03/f8/c1/b8/novotel-london-city-south.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d273194-Reviews-or20-Novotel_London_City_South-London_England.html", "section_title": "Novotel London City South - UPDATED 2017 Hotel Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d273194-r464768417-Novotel_London_City_South-London_England.html", "country": "US", "domain_rank": 189, "title": "Really, really disappointing", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Really, really disappointing - Review of Novotel London City South, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "6b55987488e8d66f39bd8f1f04c9bb72b89a8202"}, "author": "jessiecaitlin0", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d273194-r464768417-Novotel_London_City_South-London_England.html", "ord_in_thread": 0, "title": "Really, really disappointing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I had booked this hotel online for one night only through a third party booking website, and paid for it upfront about a month in advance. When me and my boyfriend arrived on the day of our stay, I was told by the French receptionist that I would have to pay a deposit, which surprised me as we were only staying for one night, and this was not mentioned at all in either my booking confirmation from the website or the confirmation email from the hotel themselves. When I put my card in to take the deposit, we were told it was going to be £120!!! That wasn't too far off what the room itself cost - £120 deposit for a 1 night stay when the room is already paid for. Anyway, I paid it begrudgingly as the receptionist assured me it would be released immediately after checkout and carried on with our day. When we got back to the room that evening, our key card didn't work. We reported this to the front desk staff who were very rude and looked at/spoked to us like we had somehow purposely broken the key ourselves and it was our fault it wasn't working - We think this may have been because we are 20 and 24. After eventually getting a new key and going back up to our room, we got a phone call from reception rushedly asking us to confirm all of our booking details which we found outrageously rude, as it was like they didn't believe the room was ours, which is maybe why they were so salty and suspicious about giving us a new key. On the call, they asked us to come all the way back down to the desk when we next left the room, which we were very confused by. When we went back down, the blonde female manager started 'quizzing' us about who checked us in, which website we booked through, and asking us to confirm our details AGAIN. She also disclosed how much I paid for the room in front of my partner which I found SO rude and completely unacceptable as it was a surprise for his birthday. I was absolutely furious at this point and asked her why she needed this info from us as she was now wasting our time. She advised me that firstly the person who checked us in should never have taken a deposit from us as it was already covered by the booking site, and secondly that she hadn't logged it on the system so they had no proof of it. I was absolutely livid at the sheer incompetence of the staff and this absolutely ruined our night. In addition to this, she spoke ONLY to my boyfriend the entire time despite everything being under MY name and it was ME who booked and paid for it. Even when I corrected her several times, she still spoke only to him and pretty much ignored me. She advised him that if I brought the receipt down to her that she would refund it immediately as she would still be there. I went and did so straight away, only she was no where to be found when we returned. We asked the gentleman at the desk, Mario, to go and get her. He went away for a long time only to come out without her, and advised she was busy. Busy HIDING!! We saw her quickly sneak away out of the door as we were talking - She just didn't want to deal with us any more. Mario took my receipt and advised that he would start the returns process. I asked him for something in writing to confirm but he said there was nothing he could do but he would try and send me and email confirming it, however he gave me really wishy washy vague answers and I was not convinced. When we came back from dinner that evening, we spoke to a completely different staff member and asked him to look on the system to see if it had been done. Lo and behold, it had not. Mario had not started the returns process at all, had made no notes and had not sent an email. Again, I was furious. The member of staff then told us that he would start the returns process for us immediately, would write us up a confirmation letter and leave it for us at the front desk for when we checked out. Following a lovely night, we came down in the morning to check out only to find the same French girl who had checked us in. We tried to explain the situation to her and that she shouldn't have taken our deposit, but she said she didn't understand our English. We asked her to look for the letter that had been left for us - She looked in one desk drawer, half heartedly rummaged for about 5 seconds before claiming she couldn't find it. There was no point arguing with her as she clearly was not interested in trying to find it for us. She instead called her manager Babaye over, who was honestly the loveliest person we encountered on our whole stay. Thank God we found him - Firstly he looked on the system and my deposit WAS on the system despite the blonde lady saying it wasn't at all, and in 2 seconds he had printed me out all documentation to confirm and given me his name and phone number in case we had any problems. This was really sweet of him, however it was still really annoying as he had printed everything I needed and explained it all to me within 2 seconds, which ANY staff member could have easily done instead of advising me there was 'nothing they could do' and there wasn't anything in writing they could give me. He advised that it would not be 'released immediately' like we were told, but could take up to 7 days. However he said he would ring the bank immediately and get them to return it sooner. He apologised for everything and gave us 2 drinks vouchers for the bar for the inconvenience which was nice. I actually don't know what we would have done if we hadn't have found Babaye, he was the ONLY person at this whole hotel who was polite, willing to help and not completely incapable. The room itself was absolutely lovely don't get me wrong, but I will never ever ever be returning to this hotel as all I will remember is what terrible service we received from everyone apart from Babaye and the bartender who was also absolutely LOVELY. After the first initial encounter it was not about the money in the SLIGHTEST anymore, it was about the service. I can confidently say that service wise, with the rudeness, incompetence, blatant lies and misinformation, this is the worst hotel I've ever stayed at in my entire life. To rub salt in the wound, my follow up 'please write us a review' email was addressed to MR - Because apparently it's not possible for a woman to make a booking in 2017.", "external_links": [], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-31T22:37:53.275+03:00", "highlightTitle": ""}