{"organizations": [], "uuid": "7baeccabb05925c6839e67da2285c784b72ac1cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/3f/0e/2a/comfort-inn-lower-east.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d5888246-Reviews-Comfort_Inn_Lower_East_Side-New_York_City_New_York.html", "section_title": "Comfort Inn Lower East Side - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d5888246-r470403896-Comfort_Inn_Lower_East_Side-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Would not stay here again. . . even if it were free.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Would not stay here again. . . even if it were free. - Review of Comfort Inn Lower East Side, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 1, "uuid": "7baeccabb05925c6839e67da2285c784b72ac1cd"}, "author": "Demetria B", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d5888246-r470403896-Comfort_Inn_Lower_East_Side-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Would not stay here again. . . even if it were free.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you want a hotel that offers poorly cleaned rooms that is located directly across from a housing project on one side, and directly next to an elevated train that runs all night on the other side, and locks you out of your hotel room the night before your stay is scheduled to end then this is the hotel for you! This hotel is no where near the financial district, and is located in a part of NYC that is less than desirable. Had I known that the hotel was next to a housing project, I would not have booked it!\nThe first issue, was that the hotel failed to provide enough towels and toiletries (including toilet paper) for a group of five staying in one of their \"suites\". After an hour and a half of waiting for no towels to be brought up, I finally went downstairs and waited until I was handed enough towels for our group. If you know that five people are staying in a six person room, why would you only stock two wash cloths?\nAdditionally, the hotel's cleaning staff needs a lesson in the cleaning department. We were staying in a \"suite\", and to our absolute HORROR, the next day as we were fluffing our pillows, we found that our pillows were soiled an dirty and that they had been \"hidden\" behind a clean pillow!!! This was absolutely disgusting (see picture of pillow below)!! I went down to request new bedding, however, because half of our group was staying behind in the room, not much was done until much later in the evening.\nThe let out couch was a complete joke! It was as hard as a rock, and they didn't even provide pillows for it! We had to take one of the pillows off the bed for the person sleeping on the sofa rock to have a pillow to lay on.\nThe bathroom was WAAAYY too small! It had no bath tub at all, just a small shower stall that was maybe 3 feet in diameter!! There were no shelves underneath the sink, nor was there a hook on the door to hang your clothes.\nThe lighting in the room was horrible! Who ever heard of a reading table without a reading lamp?! There was no closet in the room, just a swivel hook for maybe two or three coats at best. There wasn't even a luggage rack, which can be found in the most basic of hotels!!!\nThe final evening when we returned from dinner, 4 out of our 5 key fobs had completely stopped working!! I went back downstairs to ask for toilet paper and kleenex, which had not been replenished when we returned to our room, and also to ask for pillows, which also had not been replaced after giving the front desk person the soiled pillow earlier in the day. I get 4 newly coded keys, only to find that none of them worked! I brought the keys back to the front desk, at which point the lady at the front desk asked if she could bring the keys and pillows up to the room because she had to go see about a loud party that was disturbing guests on the third floor of the hotel. She brought the pillows and the keys up about 15 minutes later. However, in the morning when we went down for breakfast, we found that none of the new keys that she had brought worked either, and had to have the front desk make yet another key!\nThis hotel was very poorly thought out. From the location of the hotel, to the size of the rooms, lack of cleanliness, and total lack of attention to detail, this hotel is just poor in all respects. The few staff members that are attentive do not make up for the shortcomings that we experienced during our stay. Needless to say, if I'm ever in NYC again, I will steer clear of this place!!!", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-30T19:33:41.158+03:00", "highlightTitle": ""}