{"organizations": [], "uuid": "86eaad79f551134948f1d866fe33777f7b39ed71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/b2/26/bc/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99447-Reviews-La_Quinta_Inn_Suites_New_York_City_Central_Park-New_York_City_New_York.html", "section_title": "La Quinta Inn &amp; Suites New York City Central Park - UPDATED 2017 Hotel Reviews &amp; Price Comparison - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99447-r470615880-La_Quinta_Inn_Suites_New_York_City_Central_Park-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "I expected a tiny room but not all the long black hair in my tub and on my towels, yuck!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "I expected a tiny room but not all the long black hair in my tub and on my towels, yuck! - Review of La Quinta Inn & Suites New York City Central Park, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 1, "uuid": "86eaad79f551134948f1d866fe33777f7b39ed71"}, "author": "MissHennessy", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99447-r470615880-La_Quinta_Inn_Suites_New_York_City_Central_Park-New_York_City_New_York.html", "ord_in_thread": 0, "title": "I expected a tiny room but not all the long black hair in my tub and on my towels, yuck!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed a week for business. I liked the area and all the conveniences. The staff was friendly but that is where my positive review stops.\nThere are like 14 floors and only one elevator. I chose many times to walk the flights down versus waiting for the elevator. It can't be helped and I understand but give yourself time to exit, because it can take a while. The breakfast area is tiny, there were times when there was no seating and the line to get food was long. The breakfast was not good. The eggs and sausage were not appealing, the oatmeal consisted of packets of plain but no brown sugar or nuts or dried fruit to add. The orange juice was good one day but terribly watered down the next. After the first few days I just didn't access this area. My room was tiny but I read the reviews and expected it, but I was just disappointed in the care of the room. My bed had a wrinkled comforter, it was nicely made each day when I returned to the room but had stains and wrinkles. The bathroom had bath towels and hand towels and wash cloths all hanging on a towel rack. Two days before I left I picked up a washcloth to wash my face and it was full of long black hair! This is a tiny washcloth and they fold it in such a way to make it a little fancy to finish their towel ensemble on the towel rack. So please don't expect me to believe the house cleaning person didn't see it! The first day of my stay, I took a shower and at the conclusion I noticed several long black hairs in my tub and tried to reason to my self that perhaps when wiping out the tub after they cleaned, maybe some hairs stuck to the side. But as I stood there staring at this tiny washcloth with at least seven long black strands, I couldn't help but think that someone was bitter with their job and planted them there! It grossed me out and I just could not appreciate my stay. The last complaint is the wifi, I could not upload my data to my company and had to use my phone as a hotspot.", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-30T19:44:58.685+03:00", "highlightTitle": ""}