{"organizations": [], "uuid": "728867e03aa65f89d507e2cf009ade6bb5832275", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/0e/a1/23/the-inn-at-irving-place.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93581-Reviews-The_Inn_at_Irving_Place-New_York_City_New_York.html", "section_title": "The Inn at Irving Place - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93581-r466997797-The_Inn_at_Irving_Place-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Blown circuits, broken light switches,no heat and no towels: Not charming.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Blown circuits, broken light switches,no heat and no towels: Not charming. - Review of The Inn at Irving Place, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "728867e03aa65f89d507e2cf009ade6bb5832275"}, "author": "Lilactea", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93581-r466997797-The_Inn_at_Irving_Place-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Blown circuits, broken light switches,no heat and no towels: Not charming.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After a cross-country flight, we were looking forward to a delightful, quiet evening at The Inn. This was our third visit (more on this below) and we were prepared for The Inn's quirky appeal. Who cares if the furniture bares a striking resemblace to second-hand store finds - or if the housekeeping is spotty, the shower squeaky? The young man who lugged our bags up the stairs to our room was, as before, terrific - and the location is great.\nBut: When we got to our room, it was freezing. We were told that the heat was off because NY had a heat wave the week before (this was late February.) We were told to use the space heater in room.. When we turned it on, some of the lights blew - as did the small flat screen TV. We called downstairs again. They came up with another heater. More lights blew. After a flurry of phone calls, we were promised the radiator heat would come on. Freezing, I took a shower, which had this horrid screech. But the water was hot. When I reached for a towel -I realized there weren't any. No wonder: only one dim vanity light was working. When we went to bed, we discovered that the switch on the circa 1970 light switch was broken, as was the one on the other side of the bed. Thankfully, the heat finally came on.\nWe had stayed here twice before. First time:a welcome change from hotels. Second time, more issues with maintenance. The lights were so dim that I was tempted to buy bulbs. No real place to put cosmetics, etc. Charm, however, overcame inconvenience. This time was sadly too much. For $350+ a night - in the off season no less -- guests should at least get heat and towels.\nWe left the next morning and booked at an upscale,boutique, hassle-free hotel. Faded charm might be okay; putting yourself in peril with a antiquated electrical and heating system is not.\nThe breakfast room, however, is lovely - as is the helpful staff.", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-30T23:56:27.995+03:00", "highlightTitle": ""}