{"organizations": [], "uuid": "8a264a69dd464325a2715c61f1803c5ea4dfdcf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/8a/f0/71/lobby-main.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99766-Reviews-or80-The_Roosevelt_Hotel-New_York_City_New_York.html", "section_title": "The Roosevelt Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r466045564-The_Roosevelt_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Avoid!! Not 4* as stated...", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Avoid!! Not 4* as stated... - Review of The Roosevelt Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-10T02:00:00.000+02:00", "replies_count": 0, "uuid": "8a264a69dd464325a2715c61f1803c5ea4dfdcf8"}, "author": "annaliese2209", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r466045564-The_Roosevelt_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Avoid!! Not 4* as stated...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We booked this hotel on the advice of an independant travel advisor, after first selecting The Rowe off Broadway for our honeymoon, we were sold this as a far more luxurious 4* hotel, in a better location, so trusted their judgement and booked The Roosevelt. Having read reviews I was cautious-I've always been of the opinion \"each to their own\" as what one person likes in a holiday, another person may not, and you're never going to please everyone. And for the amount of time you spend in the room (it's really just a base) does it really matter?\nThat said, when we arrived after an 8 hour chaotic flight and almost two hour taxi drive, we were greeted by very rude reception staff. No hello, welcome or congratulations (our travel agent had made the reservation team aware it was our honeymoon) just a \"NEXT\" called down the line, given our room keys and pretty much left to our own devices. Room on 17th floor we were given. Which wouldn't be so bad if the lifts work. They don't. The wait for them is ridiculous. There's a sign up saying under improvements however we saw no sign of that in the 6 days we were there! When we found our room, disappointed was an understatement. Trust me when I say, there is NO luxury here..other than the grand lobby which is beautiful... but certainly not in the rooms anyway. The standard you are when you enter the hotel is not carried through to the rooms. They are shabby and dated and dirty. The \"queen size\" luxury bed we were expecting was a small double, smaller than our standard at home. Not even a metre either side of the bed to move around! Thick dust everywhere, dirty hand prints and finger prints on the bathroom door (which didn't even close night I add), and mildew on the tiles and wallpaper coming away. A tiny built in closet where the safe is- 4 hangers for clothing, certainly not enough room to hang clothes for a week for two people, and couldn't even fit our standard size cases in it either. No drawers for underwear or personal belongings etc neither. Ended up having to live out of our cases for the week, whilst tripping over them in the process due to lack of room. There wasn't even enough room to put the ironing board up. And, It was -5° Saturday and Sunday and the heating didn't work either! Our bedding wasn't changed in the 6 days we were there nor was the room hoovered! I had worn fluffy boot socks on the Saturday and some cotton had come away on the carpet, which was still there when we checked out yesterday! Not good at all and not the standard you expect from a four star hotel...and certainly not for our honeymoon. As I said we only used it as a base but even so, we paid for four star luxury and didn't get it. Very disappointed. The location was good but that's the only positive from our stay here, I wouldn't book again nor would I recommend it to anyone.\nAll the facilities advertised i.e. Roof top bar, gym, we didn't see. No tea tea or coffee making facilities in rooms as advertised neither. In all honesty I've stayed in better 2 and 3* hotels than this.\nDon't go expecting luxury here, there isn't any...for the facilities and state of the rooms the price should be a lot less than it is, and the star rating I can only guess, was given based on the grandeur of the lobby.\nBut don't be fooled. This certainly isn't the 4* luxurious hotel it portrays itself to be.\nWe won't be going back!\nSee all photos", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-10T02:00:00.000+02:00", "crawled": "2017-03-31T21:31:46.516+03:00", "highlightTitle": ""}