{"organizations": [], "uuid": "b81c95f6a383541cd4451cc90485912f33353081", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/4b/06/9c/la-camera.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d257015-Reviews-Hotel_Des_3_Nations-Paris_Ile_de_France.html", "section_title": "Hotel Des 3 Nations - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d257015-r467538453-Hotel_Des_3_Nations-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Not even a mediocre two-star hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Not even a mediocre two-star hotel - Review of Hotel Des 3 Nations, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "b81c95f6a383541cd4451cc90485912f33353081"}, "author": "Jan T", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d257015-r467538453-Hotel_Des_3_Nations-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Not even a mediocre two-star hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There were good and bad points to my stay in this hotel. The bedding was nice...bed sheet, duvet, pillowslips were all clean, white, unstained. (Three pillows provided,soft medium and firm.) But there were stains (or possibly bleached marks) on the carpet.It's an old building, of course, so it's not pristine, and the room was small, but that's to be expected. There was lots of heat available from an old-fashioned radiator, but there's no air conditioning for summer. The hot water was almost instant and there was plenty of it. The shower drain didn't! I ended up standing in about two inches of water (and who knows what might have already been in that drain), and then it took almost 10 minutes to seep away. The hair dryer didn't work. When I called the front desk, the man there said that I could come down and he'd give me another one. I had just gotten out of the shower, was ready for bed and had wet hair, so I explained that to him and asked if he could bring it to the room but he said no, that he was the only one there. I thanked him for his help and ended the call. (The next morning I discovered that the hair dryer really did work. There are two different light switches for lights in the bathroom and apparently the one I had on wasn't the correct one. When I mentioned it to the same man at the front desk when I checked out the following morning, and said that I wish he had explained that to me, he said, \"Well, I didn't know.\" One would think that if someone works there, they'd know.) The rest of the service was fine: check-in went smoothly and the they held my bags after my early arrival until check-in time so I could go out and not have to drag my luggage with me. The wifi worked quickly and well. Sounds could be heard coming from the hallway, including the sound of footsteps on the carpeted stairway, even though the room was not adjacent to the stairs. The whole room was very poorly maintained except for the bed. I've stayed in some pretty decent 2-star hotels, but this wasn't one of them.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-28T07:02:39.972+03:00", "highlightTitle": ""}