{"organizations": [], "uuid": "543889fbd6dd983908e53232ace0b88f35822ca8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/02/52/38/75/guest-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d316644-Reviews-Raffaello_Hotel-Rome_Lazio.html", "section_title": "Raffaello Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d316644-r463592325-Raffaello_Hotel-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Terrible Staff, Tiny Rooms", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Terrible Staff, Tiny Rooms - Review of Raffaello Hotel, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-28T02:00:00.000+02:00", "replies_count": 0, "uuid": "543889fbd6dd983908e53232ace0b88f35822ca8"}, "author": "Nicholas W", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d316644-r463592325-Raffaello_Hotel-Rome_Lazio.html", "ord_in_thread": 0, "title": "Terrible Staff, Tiny Rooms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Having spent 20 years in hotel management, and having travelled around the world and stayed in countless hotels, I know the business. Never have I been so condescended to, and the moment I arrived, by the patronizing, seemingly full-time FD Agent. Think John Cleese in the 'Vacation' movies; this guy clearly hates his guests, thinks they are beneath him, and talks to everyone - I witnessed him with other guests - like they're special needs children who are incapable of handling the most simple of instructions.\nUpon arriving, I was asked for my passport, and given a form, with all blank fields, written in Italian, and asked to sign it. When asked what it was for, his immediate response was, 'All guests have to sign it.' I replied I appreciate that, but what exactly am I signing? It's entirely in Italian and I can't read it.' To this, his response was, 'You should really research Italy before coming here.\" Again, no answers as to what it is, just instantly patronizing. It took a few back-and-forths to clarify it was the standard Politzia form. All further exchanges between he and his guests were just like this.\nThey also don't let you take the room key. They keep it. I have never seen that in any hotel. Thus, you have no feeling of security, despite knowing they have extra keys, of course. Turndown service was a mint; no bed turndown or towel refresh, so why do they have to keep the keys, I wonder?\nThe hotel was quite clean, so props to Housekeeping. Rooms are crazy small; two people would have a very hard time. Breakfast was decent, not great, and the breakfast staff were far nicer than the jerk at the Front Desk.", "external_links": [], "published": "2017-02-28T02:00:00.000+02:00", "crawled": "2017-03-26T21:23:05.541+03:00", "highlightTitle": ""}