{"organizations": [], "uuid": "23b1573876c3ffc0de5a30b0bbc2e41ab14abf4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/9e/b1/08/nobleden-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d7363884-Reviews-or10-NobleDEN_Hotel-New_York_City_New_York.html", "section_title": "NobleDEN Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d7363884-r460977611-NobleDEN_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Good hotel great location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Good hotel great location - Review of NobleDEN Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-12T02:00:00.000+02:00", "replies_count": 1, "uuid": "23b1573876c3ffc0de5a30b0bbc2e41ab14abf4c"}, "author": "John B", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d7363884-r460977611-NobleDEN_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Good hotel great location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We spent five nights here week just gone and the hotel is very comfortable in a great location. Plenty of local restaurants but be careful we found quality of food poor. There is a great Italian round in Mott st called Pepe rosa - simple but well done Italian. Other Italians were commercial and fair to middling. Always beware of spruikers out the front my Italian Nona told me. Means poor food. Generally she has been right.\nHotel staff we found good and helpful but , depending who is on, some of them ok some very very helpful. But that's a small criticism. In retrospect the small room was probably too small for a stay of this length and our other hotels inNY had larger rooms. But the room had a great shower and separate toilet , good bed, and a desk and some hanging space . Just not a lot of room to do anything else.\nOne thing I believe the staff should have better awareness of the best local food and offer more information on attractions etc. We found great restaurant tips from the guy in the liquor store next door.\nThe worst thing with the hotel was the wifi which kept blocking all sorts of sites including our newspaper ap which was damn annoying. ...plus continually needing to log in even if you didn't leave the room. Over time we found that tiring and annoying and would want that sorted before staying again. It seems a common theme in our USA hotels however . Poor wifi with lots of constraints and polices to make you use the wifi less. Go figure !\nAnyway we certainly enjoyed our stay here apart from the twentieth century wifi thingy.\nWould we return? Probably not but that's as much wanting to stay in another area as much as wanting a different hotel experience.\nBtw don't go to the supposed malaysian restaurant across the road. It's Chinese not Malaysian and put me off any type of Asian food for the rest of my holiday.it was terrible. Great Aussie coffee cafe in Mott st just nearby and also great eggs for brekky and very good coffee cafe ' the egg Shop' Elizabeth st. Walk to ground zero which is amazing and lots of subways nearby. Anywhere in New York is amazing. What a place !\nRoom Tip: Not facing the road See more room tips", "external_links": [], "published": "2017-03-12T02:00:00.000+02:00", "crawled": "2017-03-29T15:54:09.492+03:00", "highlightTitle": ""}