{"organizations": [], "uuid": "3ab8802ffe94b63da1ca8409b5da91f0743d1d2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/fc/0e/c2/w-new-york-union-square.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d220243-Reviews-W_New_York_Union_Square-New_York_City_New_York.html", "section_title": "W New York - Union Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d220243-r468406404-W_New_York_Union_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great location, good sleep - but not top-notch W experience", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Great location, good sleep - but not top-notch W experience - Review of W New York - Union Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-18T02:00:00.000+02:00", "replies_count": 1, "uuid": "3ab8802ffe94b63da1ca8409b5da91f0743d1d2e"}, "author": "Sven A", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d220243-r468406404-W_New_York_Union_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great location, good sleep - but not top-notch W experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Before you read on: I was at the W Union Square twice for business over the past weeks. I am a 29-year-old business traveler, appreciate a good sleep and effortless experiences, and am normally quite easy to please.\nThe W Union Square is located at the north-east corner of Union Sq and is thus in the coolest part of town if you're a tourist: both mid and downtown experiences are not far away, Soho etc. are just around the corner. For business travelers, the location depends on what you prefer: easy access to JFK/LGA/EWR vs. proximity to your office. My office is 5min walking, which is why I stay in the area. Transport to JFK is always 1-1.30h in the afternoon.\nAs for the rooms: they are spacious for NYC, the bed is very comfy and the AC operates quietly. The bathroom is clean but seemed a bit aged both of the times. The only drawbacks that I've experienced are non-soundproofed windows (rare in NYC anyways), scarce amenity kit (no comb, file, shoe horn, ...). Compared to other W hotels I've been in, the rooms could definitely need an overhaul if they want to fit in the W design world.\nService was great at the Front Desk, they got me nice quiet rooms (although no upgrade despite status, seemed pretty booked). Doormen are something you need to get used to. I had two big suitcases and would've loved if they opened the door for me when I was leaving. But then again, as soon as you ask they were very helpful.\nOverall a solid 4/5 rating, esp. when compared to the Standard East Village, which is my preferred hotel in the area.\nRoom Tip: rooms ending -15 are nice and quiet See more room tips", "external_links": [], "published": "2017-03-18T02:00:00.000+02:00", "crawled": "2017-03-30T22:52:09.183+03:00", "highlightTitle": ""}