{"organizations": [], "uuid": "6685804efa6ebba3c0a0abef292fb76ed38f0603", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/8c/5a/c5/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d188961-Reviews-Hotel_41-London_England.html", "section_title": "Hotel 41 - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r470952659-Hotel_41-London_England.html", "country": "US", "domain_rank": 189, "title": "Best birthday treat EVER", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Best birthday treat EVER - Review of Hotel 41, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "6685804efa6ebba3c0a0abef292fb76ed38f0603"}, "author": "uktraveltips", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r470952659-Hotel_41-London_England.html", "ord_in_thread": 0, "title": "Best birthday treat EVER", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I live in London but it's always fun to stay somewhere nice, be treated like a queen and play tourist and that's what my friend did for me. We stayed here the day after my birthday. From the moment you arrive, the concierge took over, our bags were taken to our room, we were given complimentary drinks and then also escorted upstairs. I found a huge fruit basket and birthday cake upon arrival and the staff all wished me a happy birthday. We unpacked, the room wasn't huge but it wasn't small, it felt cosy, the bed high and comfy and a bathroom filled with Penhaligon products.\nHe had booked an afternoon tea in the salon, which is where we went next, it was very nice and the salon itself was lovely, I suppose it could feel crowded if completely full but there were only 2 other couples there that day. In the salon itself, there are lots of 'nibble's even a fridge with ice-cream which you can help yourself too throughout your stay.\nWe then headed out for a walk/show and dinner then on our return, he had booked a massage in our room for me.\nHe excused himself to the salon and I was treated to a massage in my bedroom after which I was totally relaxed and promptly fell asleep.\nBreakfast is also in the salon and delicious as expected. After a leisurely time, we then gathered our belongings and ordered a taxi home (with all my presents and balloons)\nIt was truly an outstanding experience and one I hope to be able to repeat or treat someone to one day.\nIf you want to feel pampered and looked after on a more personal level rather than a big impersonal hotel, then this is for you.", "external_links": [], "published": "2017-03-28T03:00:00.000+03:00", "crawled": "2017-03-29T20:27:06.691+03:00", "highlightTitle": ""}