{"organizations": [], "uuid": "e6d4b8be654d33935cff5c9bbd7bacf286edbfc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/02/55/e2/f5/conservatory.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d192064-Reviews-or10-The_Chesterfield_Mayfair-London_England.html", "section_title": "The Chesterfield Mayfair - UPDATED 2017 Hotel Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192064-r467589577-The_Chesterfield_Mayfair-London_England.html", "country": "US", "domain_rank": 189, "title": "Best birthday ever!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Best birthday ever! - Review of The Chesterfield Mayfair, London, England - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "e6d4b8be654d33935cff5c9bbd7bacf286edbfc0"}, "author": "Little W", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192064-r467589577-The_Chesterfield_Mayfair-London_England.html", "ord_in_thread": 0, "title": "Best birthday ever!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Every now and then a hotel stands out for getting it just right and The Chesterfield, Mayfair did just that for us. It has a quiet confidence as a hotel, it is not an arrogance or smugness, it’s a calmness and an assuredness. We found a massively warm welcome from start to finish. Its staff are so well trained, nothing is too much trouble and their customer service is effortless, whether it was the best shoe shine ever or the best breakfast, this hotel nailed it!\nThe location between Oxford Street, Bond Street and Piccadilly was what originally drew us to book, together with the promise of it’s British heritage building and some great Trip Advisor reviews. Like our stay at Only You, Madrid last year, I hardly want to divulge some of its treasures, as for sure a lot of our “wows” came from this hotel delivering the unexpected.\nThank you so much for adding to my incredible birthday week. The Jungle Suite was sensational. I loved every feature of it from the 'just look at the carpet', to the chairs to the wall art, the fluffy white towels with the C emblem, the rose petal bath and the amazing nights sleep after a day walking around London. Thank you too for the little extras the fruit platter and canapes sent to the room and the Happy Birthday cards from the staff.\nBreakfast was amazing, I was back in my childhood with the porridge, given a modern twist made with coconut water, and then wow my all time Aussie favourite the smashed avo was on the menu (although called something more fashionably London like avocado toast!), my husband was in his element with a traditional British bacon and eggs.\nIn fact, that's it, it is the combination of the great British tradition with a modern twist, which gives this hotel the edge. No wonder this hotel has won two top twenty-five Travellers Choice awards.\nThe mix of other guests, lots of Italians and Americans made the whole stay a delight, whether it was a good evening in passing in the bar, or an 'after you' in the lift. We all had a grin on our faces like 'weren't we clever to book to stay here?!'\nCongratulations to all the staff and thank you for adding to my best birthday ever!\nRoom Tip: looking at the floor plan the rooms are variable in size, the Jungle suite was perfect! See more room tips Green Features: The hotel makes an effort to remind guests of its environmentally friendly practices with regard to saving energy, lights, air con temperature and reuse of towels etc", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-27T13:38:04.192+03:00", "highlightTitle": ""}