{"organizations": [], "uuid": "a1a0aa274e357c9e60c5ae2ce0e893c0048276cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/50/9d/58/intercontinental-paris.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d207742-Reviews-InterContinental_Paris_Le_Grand-Paris_Ile_de_France.html", "section_title": "InterContinental Paris Le Grand - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207742-r470347759-InterContinental_Paris_Le_Grand-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Beautiful building but a bit lacking in service", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Beautiful building but a bit lacking in service - Review of InterContinental Paris Le Grand, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "a1a0aa274e357c9e60c5ae2ce0e893c0048276cf"}, "author": "Natek3232", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207742-r470347759-InterContinental_Paris_Le_Grand-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Beautiful building but a bit lacking in service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I have stayed here for 2 separate weeks while traveling for work. The building is very special and I really enjoyed staying here. The rooms are the perfect combination of class and modern. It is an old historic building so the room layouts can be a bit unconventional. During my first trip the room on the top floor had a low slanted ceiling so I could not stand up without hitting my head in about half of the room, and it also had no space for a stand up shower stall (only a bath tub with a hand shower).\nUnfortunately the service did not live up to expectations to make this a true 5-star experience during either of my trips. When I visited during a very cold week in the winter, my room heat would not keep the room any warmer than about 65-70 F and I tried multiple times to call the staff to help. They were unable to communicate anything in English more than very basic greetings and could not understand the problem or explain what could be done to fix it. No one ever apologized later for not being able to address my concern or offered to try a different room. Once by the front door of the hotel the greeter was not holding the glass door after another guest left and it slammed into me and made a very loud noise. Instead of apologizing or coming to help he just said \"oof!\" and then kept talking to another coworker on the side. No member of the staff ever greeted me by name or seemed to express that they remembered who I was. I realize that all of these things are not a big deal but they are not in line with experiences at other highly rated hotels I have stayed at in other cities.\nThe last thing to comment on is the breakfast. I love staying at hotels with big and diverse breakfasts available. This one seemed very promising at first with a huge selection of both western style items along with a table full of pastries and also Asian items. The dining room is also another amazing space to experience in the hotel for how it looks. Unfortunately the actual taste and quality of the food did not match the appearance. There was also little to no diversity and each day throughout the week had almost the exact same items available as the previous day. I think there was an omelet bar but I never saw a single person requesting anything from it for all 10 breakfasts that I ate there. I would eat there again if it was included in my rate but definitely not worth the extra cost alone.\nRoom Tip: avoid the top floor due to weird room layouts with no stand up shower stall See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-30T21:24:11.058+03:00", "highlightTitle": ""}