{"organizations": [], "uuid": "e250568a888aa86f7739e431a6a3439bc0fd54ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/e3/bc/44/park-hyatt-new-york.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d6582176-Reviews-Park_Hyatt_New_York-New_York_City_New_York.html", "section_title": "Park Hyatt New York - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6582176-r470190330-Park_Hyatt_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great facilities. Spacious room. Impressive service", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great facilities. Spacious room. Impressive service - Review of Park Hyatt New York, New York City, NY - TripAdvisor", "spam_score": 0.037, "site_type": "discussions", "published": "2017-03-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "e250568a888aa86f7739e431a6a3439bc0fd54ec"}, "author": "AroundTheWorld8080", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6582176-r470190330-Park_Hyatt_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great facilities. Spacious room. Impressive service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From the very first hotel employee to the last one that we interacted with, everyone was gracious and seemed to sincerely care about the attentive service they were providing. Very impressive. We dropped off our bags upon arrival, and they were automatically placed with care in our room without delay.\nThe facilities were all top notch. The pool is very large for NYC and tastefully designed. Our room was very spacious and luxurious as expected - albeit not as amazing as the Park Hyatt in Vienna.\nWe were celebrating a birthday, and we were pleasantly surprised to have a bottle of champagne and treats placed on our room desk upon arrival. The turn down service was prompt with a nice added touch of pre-setting our complimentary room slippers bedside.\nHere's a tip when it's cold outside: Take the tunnel on the first floor to quickly get from the front of the hotel (57th street) to the other side of the hotel (58th street). And then right across the street, you can enter the back door of the JW Marriott hotel which you can walk through all the way to the lobby which leads right to Central Park.\nBut when we tried to return with our key card through this back door hallway, it malfunctioned. Luckily, we were able to wave down a hotel employee who let us in through the adjacent garage.\nThe only odd element was the ambient lighting in the elevator lobby areas on each floor. It's quite dimly lit which gives a very dark and gloomy atmosphere. Not the best choice.\nAlso, beware of the surprising lack of soundproofing. While we were inside our room, we could hear the neighboring doors open and close. Thankfully, our neighbors didn't return to their rooms very late at night", "external_links": [], "published": "2017-03-25T03:00:00.000+03:00", "crawled": "2017-03-29T14:20:16.093+03:00", "highlightTitle": ""}