{"organizations": [], "uuid": "1ef443ab9c45afa9dbd4995a7afad5918119d406", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/a7/c7/d2/citizenm-new-york-times.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d6385164-Reviews-CitizenM_New_York_Times_Square-New_York_City_New_York.html", "section_title": "citizenM New York Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6385164-r469745252-CitizenM_New_York_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Yes, it really is as good as the reviews say!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Yes, it really is as good as the reviews say! - Review of citizenM New York Times Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "1ef443ab9c45afa9dbd4995a7afad5918119d406"}, "author": "Anthony G", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6385164-r469745252-CitizenM_New_York_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Yes, it really is as good as the reviews say!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wasn't too sure about this hotel and was apprehensive about booking it for a full week because of references on previous reviews about the small size of the rooms. Sure, they're not huge but they are very functional and comfortable. A lot of thought has gone into the design of the rooms. The beds are huge and very very comfortable. Perfect for resting after a long haul flight or a busy day (or night) in Manhattan.\nMood lighting, wide screen HD tv, blackout blinds and an iPad to control all of the room functions add to the ambience and allow you to control things to the way you like them, make this a perfect oasis for your NYC trip. Coupled with this is the rain shower which is really nice first thing in the morning and last thing at night.\nBut the greatest thing about this hotel isn't the room, it's the whole ambience of the hotel. It's a very relaxing environment and the staff are down to earth and very helpful. For example many hotels I've stayed in there has been a pressure to get up and allow the maid in to clean your room. Not in Citizen M. They understand the international traveller and the need to sleep in late post flight (or whilst you are on holiday). Not that you'll want to stay in bed! The central location makes it very easy to visit uptown and downtown. (Buy the 7 day unlimited metro card when you arrive)\nYou don't feel like you're in a stuffy hotel. The public areas really are like your living room, where you can chill, watch tv, read a book, catch up on Facebook. The wifi is free and super fast so it's easy to stay in touch with home.\nI've never stayed in a hotel which made me feel as at home as the Citizen M has. Will I stay again? Absolutely yes, without hesitation. In fact I want to visit the other Citizen M hotels in London and Amsterdam. Would I recommend it? Yes, it's a home away from home and the reviews do reflect how excellent the hotel is. Proud to call my self a Citizen M.\nWell worth a stay. Try it....\n(Declaration of interest: absolutely none.)", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-27T03:12:31.810+03:00", "highlightTitle": ""}