{"organizations": [], "uuid": "eca36554725d0eec22a99e5ae886024a076d4709", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/1f/7a/fb/mercure-london-paddington.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d195221-Reviews-Mercure_London_Paddington_Hotel-London_England.html", "section_title": "Mercure London Paddington Hotel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d195221-r465323160-Mercure_London_Paddington_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "A comfortable and cozy room", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "A comfortable and cozy room - Review of Mercure London Paddington Hotel, London, England - TripAdvisor", "spam_score": 0.896, "site_type": "discussions", "published": "2017-03-07T02:00:00.000+02:00", "replies_count": 1, "uuid": "eca36554725d0eec22a99e5ae886024a076d4709"}, "author": "Daniel C", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d195221-r465323160-Mercure_London_Paddington_Hotel-London_England.html", "ord_in_thread": 0, "title": "A comfortable and cozy room", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This hotel is right next to Paddington station, which has a direct express train to Heathrow Airport every 30 minutes. There is also an entrance to the Underground subway there. We were able to easily travel to the best spots in London from here.\nThe Staff in the lobby is beyond excellent in their kindness. Upon arrival we were given a map of London with many marked locations of interest along with helpful information about obtaining tickets for the trains and the Underground subway.\nThe room was small, comfortable, cozy, clean, and modern. I'm from Texas and everything is bigger in Texas, but the small size of the room was actually a benefit because it made the room feel more manageable. The television is large and placed in a good viewing distance from the bed. There were hundreds of channels to choose from. The bed was extremely comfortable. We had a Full/Queen Size bed that was soft and clean. Temperature control in the room was easy to use. The windows in the room opened up to let in fresh air. We had a view to the park/courtyard that was great. Wi-fi was available for free. Also the refrigerator was stocked with complimentary water.\nThe bathroom was contemporary with a sleek \"rainfall\" style shower and a very nice sink. We were able to plug our American iPhone jacks into the bathroom outlets.\nThe breakfast was to die for. It was absolutely delicious. They had the full buffet with grains/cereal, milk, juice, yogurt, fresh fruits, croissants, danishes, eggs (multiple types), sausage, toast, mushrooms, potatoes, coffee, and more. We loved the breakfast.\nNearby the hotel, there are plenty of restaurants and convenience stores all within 1-minute walking distance (literally right outside the hotel). Victoria Pub was a good restaurant just down the street. Hyde park is also within walking distance, and we walked from the Hotel to Hyde Park to Buckingham Palace. It was very enjoyable.\nI would recommend this hotel because of the ideal location near the Heathrow Express terminal.\nRoom Tip: Rooms facing the courtyard are the best. See more room tips", "external_links": [], "published": "2017-03-07T02:00:00.000+02:00", "crawled": "2017-03-31T17:17:06.689+03:00", "highlightTitle": ""}