{"organizations": [], "uuid": "5a54c4156f4ab019d0f01c25eb53af19048f9941", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/c1/2b/e7/regina-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d207792-Reviews-Regina_Hotel-Paris_Ile_de_France.html", "section_title": "Regina Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207792-r469490391-Regina_Hotel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Unforgettable--exceeded all expectations!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Unforgettable--exceeded all expectations! - Review of Regina Hotel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-22T02:00:00.000+02:00", "replies_count": 0, "uuid": "5a54c4156f4ab019d0f01c25eb53af19048f9941"}, "author": "T2Leary", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207792-r469490391-Regina_Hotel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Unforgettable--exceeded all expectations!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We booked the Regina Hotel for 4 nights for our 25th Anniversary based on online reviews and the beautiful accommodations. We were NOT disappointed. The staff was professional, thoughtful and cordial. From the moment the doorman greets you, you know that you have arrived somewhere special. The lobby, the restaurant and bar are all gorgeously appointed. We were provided a room with a view of the Louvre, the Eiffel Tower and and the Touilleres Garden. It was amazing. I am a stickler for cleanliness and the room was impeccable. Because they knew it was our anniversary, our room was adorned with rose petals, which was so generous and thoughtful. Plush robes and slippers were hung in the bath, which were fantastic after a long day of travel and touring. We were also provided complimentary amenities each night...champagne, chocolates, fresh fruit. In the bar, we were served the best hot chocolate we've ever had--and we enjoyed the treat at the end of each long day. On our anniversary, we splurged with a room service breakfast and it, too, was fantastic. The concierge was knowledgeable and helpful, guiding us to a fabulous lunch place a short walk away, securing \"skip the line\" tickets and suggesting one bus tour over another, which worked out great! The beautiful architecture of the room and the very comfortable and quality furnishings and linens contributed to a memorable and perfect getaway. We can't thank the staff enough for their hospitality, and will definitely be recommending Regina Hotel for friends and family. We look forward to returning as soon as possible!", "external_links": [], "published": "2017-03-22T02:00:00.000+02:00", "crawled": "2017-03-28T04:28:02.075+03:00", "highlightTitle": ""}