{"organizations": [], "uuid": "886d817c8c4aa68232f2a6d024c2c7bcd37216d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/2b/1b/5d/garden.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d188478-Reviews-Number_Sixteen-London_England.html", "section_title": "Number Sixteen - UPDATED 2017 Hotel Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188478-r464727822-Number_Sixteen-London_England.html", "country": "US", "domain_rank": 189, "title": "Finally ... our London Home-from-Home", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Finally ... our London Home-from-Home - Review of Number Sixteen, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 1, "uuid": "886d817c8c4aa68232f2a6d024c2c7bcd37216d3"}, "author": "FussyUs", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188478-r464727822-Number_Sixteen-London_England.html", "ord_in_thread": 0, "title": "Finally ... our London Home-from-Home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ever since we retired from London [after almost 40 years there] we've been looking for a happy London \"home\" for our visits. Now, after 2 week-long stays in Number Sixteen, we've FINALLY found it. So Thank You, Number Sixteen.\nThe Good?\nEverything:-\nFor us Number Sixteen's position, 2 minutes from South Ken Tube, is perfect.\nFor us, the entire \"feel\" is perfect too – much more like a members' club than a hotel – really nice and very quiet but good fun too. [Even the English guests seem to talk to each other!]\nThere's a funky 'living-room', a fun 'honesty bar' room and a lovely airy conservatory/dining-room [They call it The Orangery … so how about some orange-trees - v pretty things?]\nThen the Food: faultless breakfasts and, for us, a faultless all-day and evening menu. We don't like all that restauranty stuff in the evenings, just something simple and a glass of wine or two or three. So Number Sixteen's menu – some calamari for instance, yummy hake or a fishcake or spaghetti with crab, apple crumble or cheese - is just perfect for us - and steak and burgers if you want them. [We used to stay in Dukes but one of the increasing number of things that finally drove us away was their over-the-top too-posh (for us) annoyingly-expensive 2 or 3 course evening menu which used to force us v.unwillingly out into the night-time St James' street]\nThe Rooms: both the big and the tiny rooms are faultless: really comfy beds and linen, silent air-con with a lovely airy feel. I was by myself on my second stay with everything I needed in the tiny room I asked for and it was that rare thing – an excellent and efficient place to work with a good well-lit table, a v.comfy beautiful-fabric chair, good wifi, good plugs. [Try working in Dukes!] Tiny yes but complete [and pretty & fun] and, with its step-out balcony, the opposite to claustrophobic.\nThe Staff and Service: as 'girlfromisleworth' writes below, \"The icing on the cake, however, is how well the hotel is managed, and how wonderful the staff is. Everything runs smoothly and seemingly effortlessly, as the staff seems to anticipate every want and need. Without being intrusive, they are to a person, extremely pleasant, efficient and welcoming.\" And it's true! ALL of the staff deserve 11-out-of-10 [because they're better-than-perfect], except for Arthur who deserves 12-out-of-10. And of course Mireia …\nAnd what a tribute it all is to Fanny Royol, the General Manager.\nThe Bad?\nAbsolutely nothing at all [unless one objects to the Lamborghini garage round the corner]\nAnd The Ugly?\nWhat-do-you-mean Ugly? The whole place is just great, funky, practical, pretty and fun, with the garden and its summer-house an extraordinary treat for London [even in early March]\nAnd if you want the look at home, Kit Kemp's books on how she does it are there in Reception.\nI think we might be back again.\nRoom Tip: We've tried 208 [big] and 105 [tiny] and BOTH are excellent See more room tips", "external_links": [], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-31T16:31:31.533+03:00", "highlightTitle": ""}