{"organizations": [], "uuid": "4381584b7f543b06479d4ea930f6e19fa092f688", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/8f/d6/56/de-la-tamise-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d595771-Reviews-Hotel_La_Tamise_Esprit_de_France-Paris_Ile_de_France.html", "section_title": "Hotel La Tamise - Esprit de France - UPDATED 2017 Reviews &amp; Price Comparison (Paris) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d595771-r470442862-Hotel_La_Tamise_Esprit_de_France-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Hotel La Tamise is all about convenience of location and excellent service", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Hotel La Tamise is all about convenience of location and excellent service - Review of Hotel La Tamise - Esprit de France, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "4381584b7f543b06479d4ea930f6e19fa092f688"}, "author": "PhinFan777", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d595771-r470442862-Hotel_La_Tamise_Esprit_de_France-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Hotel La Tamise is all about convenience of location and excellent service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This was our first time in Paris and we came to celebrate my wife's 40th birthday. We chose La Tamise because of all the good reviews they received on Tripadvisor, but I was also apprehensive because of the many people who mentioned the small rooms. The rooms are small (you barely have enough space to open your suitcase on the floor) but from what I've heard from friends this is common of most hotels in Paris. Honestly, we unpacked our suitcases and the size of the room really didn't bother us.\nDespite the room size the reason you should consider La Tamise is first the convenience and second the service.\nLa Tamise is located right next to the Louvre and the Tuillerie metro stop. It's also walking distance to the Opera House, Palais Royale, Musee D'orsay, etc It was so nice to be able to walk to any of these sights and then pop back to the hotel to maybe drop off items and head right back out. With the 1 line metro stop right outside you had access to basically anywhere in Paris.\nFinally, it was the service that we really enjoyed at La Tamise. Julien the hotel manager and his team were amazingly helpful and went above and beyond to make our stay enjoyable. Julien booked a great restaurant for my wifes birthday and also helped us book a great restaurant for our last night with views of the Eiffel Tower. We received many other restaurant and shopping suggestions and every time we entered the hotel we were so warmly greeted.\nRoom Tip: We had room #30 and loved it. See more room tips", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-28T01:40:13.649+03:00", "highlightTitle": ""}