{"organizations": [], "uuid": "726d4a4a4ec7de9e521bb463c4cfaccf797992a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/59/84/10/the-towers-at-the-new.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d4702789-Reviews-The_Towers_at_Lotte_New_York_Palace-New_York_City_New_York.html", "section_title": "The Towers at Lotte New York Palace - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d4702789-r469205074-The_Towers_at_Lotte_New_York_Palace-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great experience. Great location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great experience. Great location - Review of The Towers at Lotte New York Palace, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 0, "uuid": "726d4a4a4ec7de9e521bb463c4cfaccf797992a7"}, "author": "Eddy L", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d4702789-r469205074-The_Towers_at_Lotte_New_York_Palace-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great experience. Great location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Took the family for a short vacation to New York City and all I can say is that this property exceeded our expectations.\nTip: If you take a cab, have them drop you off on 50th Street at Madison Avenue since the lobby and drop off is on 50th, and not Madison Ave as the address would imply. There was snow on the day we arrived and the cab driver wouldn't take us around the corner and ended up dropping us off on Madision. Had to lift the kids and luggage over the snow banks because the cab guy wouldn't even find a place where we could see the sidewalk.\nWe stayed in the towers.\nThat aside, props especially to Clara at the front door. She made my kids and wife feel extremely welcomed. Treated the kids as VIPs. And to our surprise, shortly after going upstairs to our room, Clara knocked on our door and told us we got upgraded to a top floor suite, no additional charge. Kids enjoyed her hospitality.\nAlso a shout out to Susan at the reception desk whom made our check in as seamless and smooth as possible.\nGreat view of Saint Patricks Cathedral.\nThe room itself was ample size for the four of us. The shower had great hot water and pressure and the staff was very attentive throughout. They provided a mini fridge upon request at no additional charge. The bed was one of the better ones we have slept in in terms of hotels. Only downside, unless I couldn't find it, no coffee maker in the room.\nWe ate breakfast at Villard of which I would say the food although a bit pricey, was good. The Pomme Palais coffee/bakery downstairs provided my morning coffee fix.\nCouldn't have been happier. The location to subway, central park, Rockerfeller center, Time Square, shopping district was great.\nDefinitely will stay here again.", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-27T03:20:58.673+03:00", "highlightTitle": ""}