{"organizations": [], "uuid": "021f0feb292b54bbb77371fc4791594b92aafeea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/de/97/ad/entrance.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d203086-Reviews-Hotel_Morgana-Rome_Lazio.html", "section_title": "Hotel Morgana - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d203086-r467989990-Hotel_Morgana-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Friendly, good location, value for money", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Friendly, good location, value for money - Review of Hotel Morgana, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-17T02:00:00.000+02:00", "replies_count": 1, "uuid": "021f0feb292b54bbb77371fc4791594b92aafeea"}, "author": "Mooloki", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d203086-r467989990-Hotel_Morgana-Rome_Lazio.html", "ord_in_thread": 0, "title": "Friendly, good location, value for money", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Took a taxi from the airport (as a treat) and it was a fixed price as advertised on the side of the taxi. This gave a good view on the way in of some of the sights...Caracalla baths, Circus Maximus and The Palatine! However the hotel is only 5 mins from the railway station, 1 block away.\nWe were greeted by very friendly and helpful staff. Our room wasn't ready but they sat us down and then presented me with a slice of cake, candle and small bottle of Preseco, as it was my birthday. My partner hadn't said anything to them! We were upgraded to the annex and had an inside facing room. Very clean, comfy and quiet. It was a little warm but fine for us. Free toiletries, free bottle of water each day, a safe in the room that you set the code for and a hairdryer.\nStaff very helpful with any requests and booked a local restaurant for a meal....Cecio. Small but well cooked, tasty and friendly staff.\nOn advice from the hotel we took the metro on our visit to the Vatican. It was €1.50 for each and no worse than London on a busy day. The hotel is ideally located for the usual hop on hop off buses, taxi, trains etc.\nEasy to walk every where and easy to find when returning from a long day!\nVast selection of food at breakfast to suit all tastes. If it isn't there...just ask!\nI would suggest you book tickets for the Colesseum and Vatican before going, ensuring priority entry. If you can, go for the guided tours....we got a lot of extra enjoyment from them.\nAll in all a wonderful 5 day break enhanced by friendly and helpful hotel staff, located in a fairly good location....excellent for colesseum, slight hike for others but we saw more due to the walk. We would definitely stay there again", "external_links": [], "published": "2017-03-17T02:00:00.000+02:00", "crawled": "2017-03-29T14:26:37.249+03:00", "highlightTitle": ""}