{"organizations": [], "uuid": "4b8ecbc3c4b8caf76bf873e6063d4ec543f00f45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/06/a1/92/wellington-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99307-Reviews-or30-Wellington_Hotel-New_York_City_New_York.html", "section_title": "Wellington Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99307-r463762220-Wellington_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Brilliant location!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Brilliant location! - Review of Wellington Hotel, New York City, NY - TripAdvisor", "spam_score": 0.008, "site_type": "discussions", "published": "2017-03-01T02:00:00.000+02:00", "replies_count": 0, "uuid": "4b8ecbc3c4b8caf76bf873e6063d4ec543f00f45"}, "author": "Julie P", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99307-r463762220-Wellington_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Brilliant location!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We (3 adults) stayed 2 nights, room only. We were on the third floor, room number 347(?) The room was clean and so were the beds. Queen size and a king size beds which were extremely comfy. Thoughtfully arranged so that there was a partition between the beds and each had their own bathroom and shower. The sheets and towels would have been changed every day if we had wished. The hairdryers did not work but there was a spare one in the cupboard.\nUnfortunately, if we had been there any longer we would have had to request a change of room due to the noise of the generators/air conditioner units which ours and many other bedrooms overlooked. The view was awful so was the noise. We had been expecting a view over the street but it appeared that many of the rooms right up to the top floor overlooked these generators, which switched on and off continuously day and night. If it wasn't for the fact that we were so tired, we wouldn't have been able to sleep. The room was also dark due to facing rooms on the opposite side.\nWe had no problem with the lifts, they were prompt.\nStaff were courteous and helpful.\nWe would not recommend the Park Café (next door). We arrived late afternoon and 2 of us decided to go there as it was the nearest place to get a snack. We fancied sweet pancakes. We were only offered maple syrup or butter (no sweet sauces except maple syrup) and this cost us $15.75 with a diet coke each! Waitress was not particularly helpful. There are cheaper places to eat. The Bread Factory Cafe 935 8th Avenue was a brilliant place to eat. So much to choose from. Very reasonable and lovely staff. Highly recommended!\nThe opened top bus was very interesting and gave a good insight into how and where New Yorkers shop. The bus stop was not far from the hotel.\nOverall we would stay at this hotel again but would request a front room.\nRoom Tip: Avoid rooms overlooking generators at the back of the hotel. See more room tips", "external_links": [], "published": "2017-03-01T02:00:00.000+02:00", "crawled": "2017-03-30T01:32:04.312+03:00", "highlightTitle": ""}