{"organizations": [], "uuid": "cfbc7471cab320b5aaffcded70312994be17be08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/8f/0e/8d/6-columbus-a-sixty-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93383-Reviews-6_Columbus_A_SIXTY_Hotel-New_York_City_New_York.html", "section_title": "6 Columbus - A SIXTY Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93383-r470811984-6_Columbus_A_SIXTY_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "A very nice stay, but lacking the attention to detail.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "A very nice stay, but lacking the attention to detail. - Review of 6 Columbus - A SIXTY Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "cfbc7471cab320b5aaffcded70312994be17be08"}, "author": "JC1633", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93383-r470811984-6_Columbus_A_SIXTY_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "A very nice stay, but lacking the attention to detail.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I'm pretty sure their 'gimmick' is the 'you've been upgraded' that I got, and heard at least one other guest get. Not that it's a bad thing, it's not. We booked a superior King and got a suite out of the deal, and that means a lot to me. The room seemed fairly clean and is sporting a funky vibe. There's a good amount of space because of the living room, without which the room would be very small. There's no dresser just a wardrobe which held all of our 'hang up' clothes but there really wasn't anywhere to put underwear, socks, etc.\nHaving driven to NYC, one of the first stops was the restroom, and this is where I noticed the first issue (not problem). The toilet handle was hanging off the toilet, so it was unflushable. I'd like to think that housekeeping would have noticed this and called it in, instead of me having to pop the top of the tank and manually flushing so as not to disgust maintenance. NOTE that I spoke to the front desk and this was fixed by the time we returned from our afternoon out.\nWhile showering I noticed that the light at the back of the shower was out and that the showerhead was leaking from where it attached to the pipe from the wall. More little things that someone should find upon inspection. Also, there were a few marks on the lightly painted wall, scuffs really. A magic eraser and 5 minutes work would refresh the room. Do these little things outweigh the overall experience...nope, not at all.\nBTW the restaurant is very very good, enjoy a meal there, and as far as the valet...for those who expect their car to magically appear in 5 minutes...get a grip it's NYC. 55 bucks a night is a good price. Call down for your car 1/2 hour early so it's ready when you need it, and if you are trying to beat the extra day fee, leave enough time. My car was ready before I asked for it, the doorman was always polite and the overall experience here was very friendly. I'd certainly stay again.", "external_links": [], "published": "2017-03-28T03:00:00.000+03:00", "crawled": "2017-03-30T01:00:12.593+03:00", "highlightTitle": ""}