{"organizations": [], "uuid": "47784995d9adb79e34e80f31dc32691c06332e81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/18/ca/9f/st-paul-s-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d6619066-Reviews-St_Paul_s_Hotel-London_England.html", "section_title": "St Paul's Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6619066-r464737755-St_Paul_s_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Awesome hotel - staff very friendly and high quality", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Awesome hotel - staff very friendly and high quality - Review of St Paul's Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 1, "uuid": "47784995d9adb79e34e80f31dc32691c06332e81"}, "author": "sambagarly", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6619066-r464737755-St_Paul_s_Hotel-London_England.html", "ord_in_thread": 0, "title": "Awesome hotel - staff very friendly and high quality", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Just stayed five nights at St. Paul's Hotel. When visiting London, usually about 1x per year, I stay at Strand Hotel, which I really enjoy, especially for location. However, this trip, I stayed at St. Paul's Hotel as it was close to business conference meetings at Kensington Olympia. I had never been to Hammersmith area. I am so, very, very pleased and happy with St. Paul's Hotel for many, many reasons:\n1) Hotel rooms are first class. The beds are so comfortable - thick mattresses, nice sheets, it is hard to get up in the morning. The TV selection is wide and varied. The in-room amenities are excellent. Hot water pot, coffee packets, tea bags, cookies, every day. There is also in room refrigerator.\n2) Staff is excellent - front desk - Antonio, Thomas and Bianca - young yet so talented and customer service oriented. Great way to start and end days with their greetings at front desk.\n3) HISTORY - THANK YOU to the St. Paul's owners for purchasing what was one of the oldest schools in London, and scene for a movie, converting it to a hotel and maintaining the beautiful architecture and design. Hammersmith is a mostly modern buildings, but St. Paul's sticks out beautifully as hotel is gorgeous (look at web photos - its all true).\n4) Location - the #9 bus goes to Kennington, and ends at Trafalgar Sq./Aldrwch area. While the #`10 bus goes to Kennisgton, Oxford Circus, etc. Both bus (and many more) stop right in front of hotel. Also three blocs west is Hammersmith with lots of restaurants and tub station. Three blocks east ward are more restaurants, including Persian, and Indinan. Two blocks south is Baron's Court tube. Both Hammersmith and Baron's Court are on Piccadilly Line that goes to Heathrow. There is small park next to hotel - St. Pauls Park\n5) The hotel bar and restaurant looks great! Despite wanting to I didn't dine there as I was solo and will bring my wife back to stay at the hotel and dine. It look great and was very full always\nTHANK YOU FOR GREAT STAY to STAFF and OWNERS! I will return!\nRoom Tip: Loved my room (#19) with window over looking greenspace and hearing the chirping of the birds in the... See more room tips", "external_links": [], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-31T23:05:22.701+03:00", "highlightTitle": ""}