{"organizations": [], "uuid": "bdd1c20b6550a83cbbe71dee6cbe3dbfbe2fa363", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/6a/1b/1e/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93352-Reviews-or20-DoubleTree_Suites_by_Hilton_Hotel_New_York_City_Times_Square-New_York_City_New_York.html", "section_title": "DoubleTree Suites by Hilton Hotel New York City - Times Square - UPDATED 2017 Reviews &amp; Price Comparison - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93352-r467902843-DoubleTree_Suites_by_Hilton_Hotel_New_York_City_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "A rocky start, but a great finish", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "A rocky start, but a great finish - Review of DoubleTree Suites by Hilton Hotel New York City - Times Square, New York City, NY - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-16T02:00:00.000+02:00", "replies_count": 1, "uuid": "bdd1c20b6550a83cbbe71dee6cbe3dbfbe2fa363"}, "author": "Samantha M", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93352-r467902843-DoubleTree_Suites_by_Hilton_Hotel_New_York_City_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "A rocky start, but a great finish", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We arrived early so our room was not ready. We checked our luggage with the bell staff and went on a walk about. When we returned we checked in and went up to the room. When we arrived at our room, we noticed it was not the room we had paid for. My husband called down to the front desk and was told that our room was not ready because they had to clean the carpets. They said that as soon as it was ready they would move us up to the correct room. No one informed us of this when they assigned us the first room. (I'm pretty sure they would have just left us in this room had we not said anything.) A short time later we were given the correct room.\nThe views in the room were perfect! The Hudson from one set of windows, and the New Years Eve ball from the other. After settling in, we got showered and changed and went down to Gingers for dinner. The food and the service were amazing. We ate solely at the hotel for the duration of our visit.\nThe staff at the hotel, minus the occasional grump, was fantastic. Tomny was our absolute favorite. He was so friendly and helpful. My husband tried to tip him and he wouldn't even except. He was just happy to help.\nThe rooms are spacious and well equipped. I recommend putting up the extra money for the king conference suite. The size and the views are worth every penny.\nThe only drawback to the hotel is that it is not well insulated. The noise and cold air flood in.\nThe hotel also discontinued room service. If we had known this, we would probably have chosen a different hotel. This was after all, one of the factors we used in choosing this location. The website still shows in-room dining, but that is not the case.\nOverall, the rooms are nice, the majority of the staff is amazing, and the food at breakfast and dinner was delicious. The hotel is in the center of Times Square so you are close to the theaters and plenty of excitement.\nRoom Tip: Pay the extra few dollars and reserve the king conference suite. See more room tips", "external_links": [], "published": "2017-03-16T02:00:00.000+02:00", "crawled": "2017-03-29T06:36:45.435+03:00", "highlightTitle": ""}