{"organizations": [], "uuid": "75efe523d7d694489b9fdabe5a1cde35ad255e59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/7e/c9/19/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d2643161-Reviews-The_NoMad_Hotel-New_York_City_New_York.html", "section_title": "The NoMad Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d2643161-r467138001-The_NoMad_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great Restaurant & Bars With Style", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great Restaurant & Bars With Style - Review of The NoMad Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "75efe523d7d694489b9fdabe5a1cde35ad255e59"}, "author": "Wendy A", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d2643161-r467138001-The_NoMad_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great Restaurant & Bars With Style", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I was impressed with the European New York sophisticated decor, and the very friendly staff. The phone service in hotel was not so friendly but the bellmen, servers and desk reception very helpful and hospitable. My room was a little nuts, The Atelier on the second floor with the claw foot tub was literally in the window on the street side over a gritty uninspiring swath of Broadway with offices and low end markets and trinket shops looking in. I liked the room but moved to a salon in the back which had more privacy but was on a vent and windows from creepy buildings with trash in them and odd broken glass and a wall were the view into my room. It also smelled a bit like food from the restaurant. The space itself lovely hardwood floors, nice bed, art good and style like a Parisian hotel. one drawer, closet door with mirror wouldn't stay open so I could dress and look at full length. Room 202. I tried to get on a higher floor but rooms were not available and the staff had patience and let me move and look at my options. I loved walking to EatIly, ABC Carpets and Ace Hotel. all very close Sweet Greens right next door amazing salads, easy location. Overall nice, but the rooms a bit dodgy. Lovely dining and hang out spaces, mixed ages and high level movers and shakers. Great range of bars, cozy library for quiet meetings, happening bar in back. I recommend with a bit of caution as a guest, for sure a place to go for dinner and drinks. Very New York in a good way.\nRoom Tip: Get an upper level room so you are not on the street. Second floor smells a bit like food particular... See more room tips", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-29T03:51:53.039+03:00", "highlightTitle": ""}