{"organizations": [], "uuid": "f395d6b443a665f2453fb081386cb583e1347027", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/6f/15/9b/lidos-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d261738-Reviews-Lidos_Hotel-London_England.html", "section_title": "Lidos Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d261738-r465515662-Lidos_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "A nice hotel with everything you need", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "A nice hotel with everything you need - Review of Lidos Hotel, London, England - TripAdvisor", "spam_score": 0.007, "site_type": "discussions", "published": "2017-03-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "f395d6b443a665f2453fb081386cb583e1347027"}, "author": "creaturina", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d261738-r465515662-Lidos_Hotel-London_England.html", "ord_in_thread": 0, "title": "A nice hotel with everything you need", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Just stayed at this hotel from 3rd March 2017 with my two friends for a 3 night stay. This hotel offers everything you need for a short stay, we stayed in a triple room which is actually featured in the photographs on this website, it consisted on en suite bathroom and 1 x single bed and an extra large double bed. I had to share the double with my friend and we knew this before we booked, however, neither of us really like sharing a bed but this bed was so big that I didn't even know that she was in it, I think that the hotel should consider changing it to two singles but it wouldn't really matter if they didn't. As you entered the room you had to go down about 6 steps but you are warned on the outside of the door of the room before you enter. The room then really opens up and has a little cubby hole for putting your suitcases in, but we chose to live out of ours and had them on the floor but there was still room to move. There is coffee and tea making facilities and a hairdryer but if you have long hair I would take your own as it's not that powerful, as we were three females we also took an extension for all the sockets that we needed for phones, hairdryers and straighteners. There is a TV in the room as well that has plenty of channels but we all said it was a bit small but we didn't go to watch TV. The en suite has a shower in that will fit you in but you may bang an elbow or two on the wall, but the shower was hot and quite powerful the rest of the equipment in the room worked as you would expect!!! The hotel is ideally situated with a bus stop right outside but we didn't use the bus, there is Pimlico tube to the left about 5-6 minutes away and Victoria to the right about 10-12 minutes away, Pimlico and Victoria are a direct route from Euston Tube and the journey takes about 15 minutes. You can walk to Buckingham Palace from the hotel head towards Victoria Station and then it is signed posted and takes 20-30 minutes depends how fast you walk. Breakfast is continental each as much as you like, it has two times cereal, muesli, bread rolls, croissants, fresh orange juice, apple juice, tea and coffee machine, ham, cheese and bread for toast, there is also a fruit salad and yogurts. The dining room is clean and the woman in there works hard to keep it stocked and clean. The only downside was the noisy residents in the room above did a lot of banging on the floor but this was only in the morning and not too much of an issue. All in a good pad to have short stay in, its clean with maid service and friendly staff, I would definitely stay again as would my friends.\nRoom Tip: We stayed in 108, good sized rooms but be aware it did have steps down into it. See more room tips", "external_links": [], "published": "2017-03-08T02:00:00.000+02:00", "crawled": "2017-03-31T23:54:39.664+03:00", "highlightTitle": ""}