{"organizations": [], "uuid": "8295625ade84b6eb9cbd9657b19b93d56e0d2004", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/99/02/39/executive-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93338-Reviews-Hotel_Beacon-New_York_City_New_York.html", "section_title": "Hotel Beacon - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93338-r467367227-Hotel_Beacon-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Nice Break from Midtown", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Nice Break from Midtown - Review of Hotel Beacon, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "8295625ade84b6eb9cbd9657b19b93d56e0d2004"}, "author": "KathyLMGA", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93338-r467367227-Hotel_Beacon-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Nice Break from Midtown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Our family visits New York at least a few times a year and other than one stay in SoHo we always stayed in Midtown. We had thought \"what could be better than being in the middle of everything?\". Well, now we know - the Upper West Side.\nWe chose the Hotel Beacon because it is close to the Museum of Natural History / Hayden Planetarium, Lincoln Center and Columbus Circle. Having a kitchenette in the room and nice grocery stores across the street were also pluses.\nWe stayed in a corner room that had great city views, but almost no city noise. Even when there was a concert next door at the Beacon Theater, we could only hear a little music if our window was open.\nMidtown is a quick subway ride away (and the 72nd street subway station is close to the hotel), so we could enjoy the shows and razzle dazzle of Times Square and come back to a nice quiet neighborhood for the night.\nAs far as the room goes, it was large for NYC and made good use of the space - a small table for eating, a desk for work and a nice side chair for reading the complimentary newspaper. The kitchenette was super - a separate little room with refirgerator, microwave, stove - and fully stocked with dishes, silverware, even a toaster! The bathroom was on the small side and the closet space was pretty limited - but it did have a safe.\nHousekeeping did a great job keeping our room clean and the front desk staff were super helpful recommending places to eat and shop in the area. They even had subway tickets for sale at the front desk!\nWe were fully satisfied with our experience at Hotel Beacon and plan to stay again the next time we visit NYC.\nRoom Tip: Corner room has lots of sun and great views (from higher floors) See more room tips", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-30T01:01:08.446+03:00", "highlightTitle": ""}