{"organizations": [], "uuid": "1fd9ae762da4da3e0bda5498ce84a20d7f34f2c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/7c/36/b1/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197577-Reviews-Hotel_Scribe_Paris_Opera_by_Sofitel-Paris_Ile_de_France.html", "section_title": "Hotel Scribe Paris Opera by Sofitel - UPDATED 2017 Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197577-r461134772-Hotel_Scribe_Paris_Opera_by_Sofitel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Once our favourite Paris hotel, may need some TLC", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Once our favourite Paris hotel, may need some TLC - Review of Hotel Scribe Paris Opera by Sofitel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-28T02:00:00.000+02:00", "replies_count": 0, "uuid": "1fd9ae762da4da3e0bda5498ce84a20d7f34f2c3"}, "author": "Bill S", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197577-r461134772-Hotel_Scribe_Paris_Opera_by_Sofitel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Once our favourite Paris hotel, may need some TLC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We have stayed here 5+ times and the first 2 visits were probably the best. Our recent visits have resulted in a room change each time. Our beds have been uncomfortable or in one case the room was just dark and dingy with lots of wear and tear. At an airport Hilton we'd have just settled in but the Scribe can be quite expensive and you expect better. The staff are very polite as you would expect. I cannot quite put my finger on it but the hotel had slipped a little. The location however remains excellent and rooms on the higher floors are still the better ones from what we can tell. The restaurant is very expensive but the food is excellent. I imagine that the most expensive rooms are probably still excellent, but if you buy through BA Holidays as we often do, perhaps that is where the lesser inventory is distributed. This all said, the hotel is good, it just becomes relative to what you paid for it. Just up the street is the Fragonard perfume museum which does interesting tours. The main department stores are a few minutes walk away so if you like shopping then you won't be disappointed. The Opera is very close by and is worth at least a day time visit even if you don't like Opera itself. Overall this hotel is a 5 Star but with some ok-ish 4 star rooms that you may bump into. My wife thinks I'm being generous !!\nRoom Tip: Don't be afraid to ask for a room change. Surprising room diversity in same class. See more room tips", "external_links": [], "published": "2017-02-28T02:00:00.000+02:00", "crawled": "2017-03-27T22:47:57.986+03:00", "highlightTitle": ""}