{"organizations": [], "uuid": "16552a31b07df3ee626c2d09de89c827ccd5278e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/8a/f0/71/lobby-main.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99766-Reviews-or70-The_Roosevelt_Hotel-New_York_City_New_York.html", "section_title": "The Roosevelt Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r466154632-The_Roosevelt_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Ideally situated in mid town", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Ideally situated in mid town - Review of The Roosevelt Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-10T02:00:00.000+02:00", "replies_count": 1, "uuid": "16552a31b07df3ee626c2d09de89c827ccd5278e"}, "author": "mancs08", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r466154632-The_Roosevelt_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Ideally situated in mid town", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The hotel is very centrally located and within easy walking distance of the many attractions New York has to offer and a few minutes from the subway. On going through the revolving doors and up the stairs you enter a beautiful foyer/reception area that looks like you've stepped back in time. The woman on reception was helpful and changed our room so as to be next to that of our grandsons without having to be asked. The bedrooms were of a decent size with plenty of hanging and drawer space and a safe. The bathrooms were tired and would benefit from updating. The hotel did not provide coffee/tea making facilities in the room nor a mini bar which was surprising as all the hotels we have previously stayed in both home and abroad have provided this facility. The hotel has a rooftop terrace but this is closed during the Winter months. It does have a free gym, a gift shop in the foyer from where you can also buy newspapers, some general medicines, and a hairdressers, a spa and luggage shop just off the foyer. It also has a Clark's shoe shop accessed from the foyer too. Wifi is charged at 15dollars a day which I found to be excessive and think free WiFi should be offered to guests. The concierge will help with booking tickets for shows etc., and was very helpful with directions to all sites. Checkout time is very reasonable at midday and luggage can be stored for you. It can get noisy around 4.00am when street cleaning seems to start but that's just one of those things that is unavoidable. I would recommend that if booking you ask for a room away from the lifts as my daughter was allocated such a room and was frequently disturbed by guests arriving back in the early hours .", "external_links": [], "published": "2017-03-10T02:00:00.000+02:00", "crawled": "2017-03-31T21:28:26.968+03:00", "highlightTitle": ""}