{"organizations": [], "uuid": "7adcce2bfa6e89e6848b7b6dfc5171b7bc87d89e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/a6/5d/17/hotel-amelie.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d240920-Reviews-Hotel_Amelie-Paris_Ile_de_France.html", "section_title": "Hotel Amelie - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d240920-r469273548-Hotel_Amelie-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Simply Wonderful", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Simply Wonderful - Review of Hotel Amelie, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 0, "uuid": "7adcce2bfa6e89e6848b7b6dfc5171b7bc87d89e"}, "author": "Kansas-Girl-Abroad", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d240920-r469273548-Hotel_Amelie-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Simply Wonderful", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What a beautiful little hotel in the 7th Arrondissement... just minutes away from the Eiffel Tower.\nI am a solo traveler so I reserved the 'Single Room'. Being accustomed to larger, North American sized hotel rooms, I wondered if I had made a mistake in booking the smallest room. But it turned out to be the perfect size.\nThere is a twin bed with a little two-shelved nightstand right beside it (and a nifty little lamp right above it that provided the perfect amount of light for sitting on my bed and researching the next days itinerary).\nThere was also a medium sized cabinet at the foot of my bed that allowed me ample amount of space to lay out my clothes. There was also a medium sized safe on the bottom. Above the cabinet were hooks to hang my scarves and coats.\nOn the opposite wall was a computer desk (with a chair) that provided room for my books, various toiletries and all my souvenirs. Below the desk was a mini-refrigerator. Next to the computer desk was a stand where I was able to place my suitcase.\nThe bathroom was small but there was definitely enough room to get ready in the morning. The shower was a nice-sized single stall with great water pressure and plenty of hot water. The hotel provided me with body wash and a hairdryer.\nThe room was very clean and appeared to have a 'jungle' theme (very cute)! The free wifi worked perfectly and the TV was in a perfect location for laying in bed and watching the news.\nMy room was quite comfortable and I loved returning to it after a long day of walking around Paris. My favourite part of the room was the window that I could open each morning and evening... I loved looking out upon the little street and listening to the comings and goings of Parisians!\nThe staff was wonderful... they were all very friendly and helpful (they even reserved a car to take me back to the airport). I even spent several hours one evening just chatting with the gentleman that was managing the desk.\nI wouldn't hesitate to recommend this hotel to anyone... from the friendly staff to the perfect location... from the cleanliness of the room to the ambiance of the little Parisian street the Hotel Amelie was on... this hotel was perfect in every way!", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-30T18:16:48.340+03:00", "highlightTitle": ""}