{"organizations": [], "uuid": "69d40bebd75c499a63d4234c22cfd78aabfc19bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/04/02/7d/7d/iq-hotel-roma.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d1729030-Reviews-or25-IQ_Hotel_Roma-Rome_Lazio.html", "section_title": "iQ Hotel Roma - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d1729030-r464227182-IQ_Hotel_Roma-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Will definitely stay here again", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Will definitely stay here again - Review of iQ Hotel Roma, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "69d40bebd75c499a63d4234c22cfd78aabfc19bc"}, "author": "Sunny008", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d1729030-r464227182-IQ_Hotel_Roma-Rome_Lazio.html", "ord_in_thread": 0, "title": "Will definitely stay here again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What a fabulous hotel for a city break.\nIts within walking distance of all the touristy sites. Local cafes and bars around the area and 5-10 minute walk to Termini station.\nWe stayed at the hotel 12-14 February and decided to walk everywhere as the weather was lovely. We walked to the vatican which was about 45 mins to an hour away. The colosseum and Roman forum are 15 minutes away. Trevi fountain 15-20 mins.\nThe hotel itself is clean, staff are extremely friendly and helpful. At first glances the hotel seemed like student accommodation but they are trying to achieve the communal living atmosphere which works.\nThere is a room on the 4th floor which has vending machines for things like toothbrushes etc should you have forgotten yours. The prices aren't inflated either. There is also a microwave in the same room which can be used to heat food, baby bottles/ food etc\nThe bar/cafe on the 5th floor is well worth a visit after a long day of sightseeing. The bar opens at 5, they have a food menu and a cocktail menu which are also reasonably priced especially for a hotel. There are board games (Scrabble, Dominos, Yatzhee etc) to play should you wish to keep yourself or little ones entertained. The outside part of the bar is lovely. Blankets provided for chilly nights together with outdoor heating.\nThe hotel rooms were exceptionally clean and modern. They use memory foam mattresses and pillows which are very comfortable. Free bottled water in your room everyday, tea and coffee making facilities. Couldn't ask for anything more.\nWould we stay here again? Definitely and we will be recommending to friends and family.\nFor those flying into FCO there is the TAM bus which takes you straight to termini station for €8 a person. It takes around 45 minutes on a weekend day and around 1.5 hours during the week.\nFor €14 you can get the Leonardo express train from the airport to Termini station.\nTaxis seem cheaper from Ciampino airport into Rome than they do from Leonardo De Vinci (FCO) airport. There aren't as many other options from Ciampino with regards to trains and buses as there are from FCO.", "external_links": [], "published": "2017-03-03T02:00:00.000+02:00", "crawled": "2017-03-28T05:47:48.557+03:00", "highlightTitle": ""}