{"organizations": [], "uuid": "e9d0cb28222de05f86c3cf359fdefa5e3b360dfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/2c/33/94/beigh-p138-club-oasis.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d305304-Reviews-or5-Grand_Hyatt_Beijing-Beijing.html", "section_title": "Grand Hyatt Beijing - UPDATED 2017 Hotel Reviews &amp; Price Comparison (China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d305304-r465398262-Grand_Hyatt_Beijing-Beijing.html", "country": "US", "domain_rank": 189, "title": "1st Timers, Stop Planning & Leave Anxiety Home!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "1st Timers, Stop Planning & Leave Anxiety Home! - Review of Grand Hyatt Beijing, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-07T02:00:00.000+02:00", "replies_count": 1, "uuid": "e9d0cb28222de05f86c3cf359fdefa5e3b360dfa"}, "author": "StewardessFl", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d305304-r465398262-Grand_Hyatt_Beijing-Beijing.html", "ord_in_thread": 0, "title": "1st Timers, Stop Planning & Leave Anxiety Home!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AIRPORT TRANSFER (Feb 2016): For $100 we were met at plane by English speaking rep, escorted through immigration & security, whisked through crowds to private elevator that opened and a limo was waiting right there, no people, no traffic.\nHOTEL CHECK-IN: This is THE Prettiest bldg. you see between airport and hotel! We wanted a pix of us out front but it was 6 degrees F outside and few people walking streets. Would you believe the desk clerk called for desk coverage and offered to come out with us and take our pix?! Talk about 5* service! And when you see how far it is to capture the flowers pix I'm referring to... ! We were blown away! Then we exchanged our U.S. $ for theirs and went to room feeling confident, safe, prepared for tomorrow. Rooms tight and sparse décor/adequate but fab marble bathroom w/big separate tub. Hotel supplied lil bottles of water for brushing teeth and drinking, we called for extra. The pool blew away Orlando pools! The lighting matches outside time of day, even cricket sounds and ceiling stars at night! Warm water, we swam and hit the hot tub. There is a shopping mall right under hotel, but not sure how extensive it is. We did visit the chocolate shop left of check in desk several times/high quality. Took some lil magnetic boxes of chocolate to go too! This white chocolate ball with some flavor inside was Fantastic. Banana?\nCONCIERIGE/TOURS/FLIGHT BOOKINGS: The next morning we slept in due to jet lag then headed to booked a private 8hr day tour w/English speaking guide and separate driver for like $300. Must be booked 24hrs in advance. So we got a cab to OLD PEARL MARKET and bought lots of necklaces, earrings, bracelets so cheap. 3rd floor, booth 14, see Rainy. $30 per strand of pearl necklace, $2 earrings, $5 bracelets. GORGEOUS! BEST souvenir gifts possible and take up no luggage space. And you order what you want choosing strands and which pearls for earrings, and you can watch her custom make the necklaces how long you'd like right in front of you/fascinating how she ties up pearls! Also, you can get magnetic clasps that are So strong, attractive and Super easy to put necklace on and off. She had a lot to make for me, so husband and I walked across the street bridge and left to a park, Jingshaw/Harmony I think. There were lots of men playing chess, tourists visiting a temple, park musicians, beautiful red décor in trees for CNY. Back at Old Pearl Market Rainy was still creating, so we shopped/bartered at the MANY other booths. Jewelry one floor, everything imaginable on another. Lots of name brand stuff cheap. We got some hand painted stationary cards for $1 each/SO Pretty, and we a man selling hand painted Christmas ornaments which are interestingly painted on the INSIDE through this Tiny hole, so we got a panda one and he painted the date inside for us/Beautiful! Caught cab back to hotel, it's only like 10mins ride, $12/$17 with tip. DAY TWO we met our guide Alice. We loved that she walked as fast as we wanted/wanted to see as much as possible of FORBIDDEN CITY, which is right down the street . She NEVER stopped talking history, had stories, answered questions, catered to what we wanted to see. We pay a few $ extra to get into the clock and jewelry/mostly art museums. She, as a guide, was able to cut lines and get tix quick and get us in quick. Forbidden City is practically empty on really cold days. We wore ski pants, hiking boots, layered our top and felt fine all day. Arrived at opening, place closed 3:30 so we walked fast and saw everything we wanted/left in time to give us 2 hrs at Great Wall. Then we headed to the GREAT WALL AT MUTIANYU. Drive was 2hrs. On way we stopped at a jade factory. Place was empty/no tours, so we took quick/interesting tour, viewed jewelry and left/no purchases, $$$. At bottom of Wall we ate at Subway/had tables inside and got water bottles for Wall. Our guide stopped on way into property to get us Wall and tram tix for up and down. Get both at bottom of hill as nobody was selling them up top. The tram cars hold 4 people I think, NICE to get up and enjoy walking Wall. We heard people complaining how long just walking up steps to Wall took. What a waste as they had to turn around and head back down/closing! On cold days Wall is EMPTY. I think we saw 10 people total the entire time there! When trees are winter dead you can see the Wall Really far in distance. There was snow on one side of the wall so we got Amazing pix. A bit of ice walking wall, so had to be careful. We heard on days with more ice, due to steepness and dangerous steps you can't walk on it. When guide was done sharing history, husband took a Long walk while I took pix at towers. Crazy steep walking at times! Buns and calves sore next day. We stopped by Concierge and paid for flight tix to Harbin the next morning and set up that first class, no worries, no stress, no hassles airport transfer. The tix were ready for pickup later that night.\nRESTAURANTS: We researched ahead for the best duck in town, turns out it's RIGHT in the hotel! Must be ordered 24 hours in advance, so we set it up for the following night after our day tour and ate at the buffet upstairs which was fun to try all the local dishes. Classy place, duck swiftly carved tableside, the fat you normally don't eat was plated with a bowl of sugar for dipping. It was so thin you could see thru it, melted in mouth, TASTY. Served with beans and veggies and dips and... We did fondue for dessert and it was served So attractively, yum.\n***Email hotel your trip plans before you leave, confirm everything, get contact name and print emails. Then once there you have accountability if Any problems arise with scheduling. ( I travel a lot.)\nRoom Tip: We stayed half way up, center, no problems. Viewed front of hotel, nice. See more room tips See all photos", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-07T02:00:00.000+02:00", "crawled": "2017-03-27T14:45:56.966+03:00", "highlightTitle": ""}