{"organizations": [], "uuid": "8d122f756c103e1f9b5500550258164c05439719", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/ee/40/d5/new-terrace.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d1739663-Reviews-Palm_Gallery_Hotel-Rome_Lazio.html", "section_title": "Palm Gallery Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d1739663-r471203460-Palm_Gallery_Hotel-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "A week in Rome, staying at Palm Gallery Hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "A week in Rome, staying at Palm Gallery Hotel - Review of Palm Gallery Hotel, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "8d122f756c103e1f9b5500550258164c05439719"}, "author": "jojosmileyone", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d1739663-r471203460-Palm_Gallery_Hotel-Rome_Lazio.html", "ord_in_thread": 0, "title": "A week in Rome, staying at Palm Gallery Hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From the moment we arrived (which was late around 9.30pm), Louisa, was very welcoming and gave us each a glass of prosecco to welcome us. She gave us maps of the area and recommended nice places to eat. Once we had finished our drinks and chatted with Louisa, she took us to our room and let us in and made sure we got settled ok. The room was lovely, so fresh and pristine! The bathroom was a good size and the the room had instructions for the free WiFi/mini bar etc. Throughout our week's stay, we met more of the team at Palm Gallery (and you do really get a good sense that they are a well functioning team) and they were all so friendly and helpful! Any information about transport, places of interest, resteraunts etc they had so much time to explain. The breakfasts were great too! It was really nice to stay in a hotel where there's more of a longer time frame to eat..Starts from 8.30-11.30!! Which meant we could have early days and slightly lazier days. The food ranges from cold meats and cheeses, to fruit, cereals, cakes, quassants and they ask you if you want eggs (scrambled, poached, or an omelette). The service was always great too, during breakfasts and if we sat on the terrace outside when we fancied some drinks. All i can say is the hotel is super clean, with lovely staff who simply cannot do enough for you. They will book trips for you, call taxis, anything to help you see what u want to see in Rome! And there's plenty to see! The hotel is about 15/20mins walk from the nearest underground station (policlinico) which then gets you all around Rome! 5/5 stars ! Thanks Palm Gallery for a lovely week in Rome! Xxx Jo and Nicole", "external_links": [], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T03:03:49.994+03:00", "highlightTitle": ""}