{"organizations": [], "uuid": "c965253daa65a975b174935cd50d00e0a4d39c11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/81/ef/33/huttons-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d193150-Reviews-Huttons_Hotel-London_England.html", "section_title": "Huttons Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193150-r467134038-Huttons_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Basic but good", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Basic but good - Review of Huttons Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "c965253daa65a975b174935cd50d00e0a4d39c11"}, "author": "ROBOTC3", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193150-r467134038-Huttons_Hotel-London_England.html", "ord_in_thread": 0, "title": "Basic but good", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This hotel is a quick walk from Victoria and down a street lined with hotels as far as the eye can see. It is a block away from a great little market, about the same away from a Tesco and there are some really fantastic restaurants in the area.\nThe hotel itself is a mishmash. Very tight corridors, only on staircase up and the elevator wasn't working while we were there. Could not utilize the balcony outside our room, nor was it private as every room on the floor had access to it. The room was very tight, one of us would have to stand between the beds so the other could cross to the other side of the room. The beds themselves were quite comfortable however.\nThe cleanliness of the room was very good. Both the bathroom and the bedroom were in great condition on arrival. The bathroom is just a shower room, the shower had hot water on demand and the included toiletries were hand pump style soap dispensers with rather cheap liquid soap in them. This was the one option for both shampoo and body wash.\nThe service at the front desk was quite good. They assisted us with directions, sold us a universal UK adapter for 5 pounds, which is very reasonable. Were always welcoming when we returned to the hotel, and were very quick with both check in and check out. The wifi was quite good, and free.\nOver all, this is a basic hotel with a great location if an early morning train out of Victoria is needed. While nothing during my stay was off putting, nothing was exceptional either. I'd stay here again if the price is right and I needed to have an early departure.", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-31T23:55:52.181+03:00", "highlightTitle": ""}