{"organizations": [], "uuid": "6f217b4edc2330a559d8e2d414185fb21b1a5cd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/7e/97/fd/premier-inn-london-bridge.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d11668464-Reviews-Premier_Inn_London_Bridge_Hotel-London_England.html", "section_title": "Premier Inn London Bridge Hotel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d11668464-r469058291-Premier_Inn_London_Bridge_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Excellent Hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Excellent Hotel - Review of Premier Inn London Bridge Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 0, "uuid": "6f217b4edc2330a559d8e2d414185fb21b1a5cd9"}, "author": "and49", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d11668464-r469058291-Premier_Inn_London_Bridge_Hotel-London_England.html", "ord_in_thread": 0, "title": "Excellent Hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed for 3 nights from a Friday to Monday with friends. We went to the hotel before the official check in time of 2.00pm with the intention of dropping off our bags but the reception staff found rooms for us and we checked in. The hotel is relatively new and everything looked really nice. The bedroom had a large comfortable bed, tea and coffee and hairdryer. The bathroom had a walk in shower that wasn't particularly powerful but did the job. We found that if you didn't have the bathroom light switched on you couldn't get any cold water out of the sink tap, only hot!\nThe hotel is set back from Borough High Street at the back of The Saint Christoper Inn Public House (nice to visit). It is a five minute walk from London Bridge tube station, five minutes from Borough Market and a seven minute walk from the Shard. Although it is in a busy central location we heard no traffic or other noise during the night.\nWe didn't eat in the hotel as there were so many other option close by and we just used the hotel as a base to see London from. On the last morning the hotel securely stored our bags for us once we had checked out until it was time to get the train back home.\nAll the staff we met were friendly and helpful, the hotel was secure in that you needed your room key to enter at night and to make the lift work. We will definitely stay here again when we return to London as it is great value for the price and a great central location for exploring.", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-31T19:39:41.676+03:00", "highlightTitle": ""}