{"organizations": [], "uuid": "2475b0c9d132c6033c8ce1164e153fd9eb1eb191", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/12/a1/d4/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d250418-Reviews-Ibis_Styles_London_Leyton-London_England.html", "section_title": "Ibis Styles London Leyton - UPDATED 2017 Hotel Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d250418-r471255921-Ibis_Styles_London_Leyton-London_England.html", "country": "US", "domain_rank": 189, "title": "Great cute clean hotel for a great price", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great cute clean hotel for a great price - Review of Ibis Styles London Leyton, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "2475b0c9d132c6033c8ce1164e153fd9eb1eb191"}, "author": "ShaunicaLyn", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d250418-r471255921-Ibis_Styles_London_Leyton-London_England.html", "ord_in_thread": 0, "title": "Great cute clean hotel for a great price", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Have stayed at Ibis hotels before but never ibis styles. Arriving I was surprised by its themed decorative style it didn't seem like you were staying at ibis.\nThe first thing I'd like to mention is that ibis styles has two buildings (they are opposite eachother on other side of the road) I was a bit confused with this but it wasn't too bad as they are literally opposite eachother.\nThe rooms are fairly small (smaller than ibis rooms if you have stayed there before) but that didn't bother me. The room and bathroom we was in was VERY clean which I love. As I don't like dirt at all.\nWe had complimentary bottle of waters waiting in the room which was a nice touch and complimentary tea/coffee, kettle and cups which was great for the next morning.\nThe tv was a great fairly large size with apps such as Netflix etc had freeview channels. Had a ac/heater that worked well and the remote was easy to operate. The receptionist actually showed us how to use it which was helpful but even if she didn't I would of figured it out.\nBed is comfortable. My partner and I both slept well. There's even a table that slides under the bed and can be used as a table/ snack table whatever you need it for really.\nWifi works well was very fast and can be used with several devices. As three devices in our room was connected to the wifi all worked well perfectly.\nThere's a full size mirror which is great and a large size mirror in the bathroom which having good size mirrors to me is vital haha.\nThere's a desk and chair (chair is comfy).\nThe only negative I would say is late checkout only because I've stayed at ibis before.( it's not the Leyton ibis styles fault however I think Ibis company should allow this across all of their different ibis chains)\nIf you want late checkout you have to pay £10 an hour up until 2/3pm then after that you have to pay the room price.\nWhich to me is silly as I've stayed at ibis and you pay £20 and can checkout until 5/6pm so ibis need to look into making that available across all chains. But I guess it's because Ibis style is a little more 'fancier' looking than ibis so they like you need to get out lol.\nBut overall this hotel is great, comfy, small but cosy and clean for an affordable price. Will stay again. And loved the bond 007 theme in the room it was a cute touch.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T19:50:39.969+03:00", "highlightTitle": ""}