{"organizations": [], "uuid": "42f1ec28c5ac702b31135696933ed77e091ffd87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/45/4c/f2/saint-james-paris-relais.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d222913-Reviews-Saint_James_Paris_Relais_et_Chateaux-Paris_Ile_de_France.html", "section_title": "Saint James Paris - Relais et Chateaux - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d222913-r471098975-Saint_James_Paris_Relais_et_Chateaux-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Absolutely Fabulous!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Absolutely Fabulous! - Review of Saint James Paris - Relais et Chateaux, Paris, France - TripAdvisor", "spam_score": 0.013, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "42f1ec28c5ac702b31135696933ed77e091ffd87"}, "author": "julesmd1974", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d222913-r471098975-Saint_James_Paris_Relais_et_Chateaux-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Absolutely Fabulous!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My husband I are traveled to Europe for the first time stopping first for a week in London then taking the train to Paris for a week-long stay. We searched many hotel before deciding on the St. James. We booked a Boutique level room but when we arrived to check in, we found that we were upgraded to a Suite (Room 104) and that was a wonderful surprise that made our stay extra special! I almost do not want to post about how wonderful this hotel is because I feel that more people booking here will make it harder for me to get a room in the future!\nFrom the time we pulled up in our cab, we received excellent service! The grounds are impeccable and pristine. The concierge and service jumped to help us with our luggage and had the items brought to our room once we checked in and got settled. The hotel is classy and quaint all at the same time. The concierge recommended a restaurant for us to go to for dinner and he actually called the restaurant for us, got us a table, gave us instructions on how to get there, etc. The restaurant was also fabulous and we had a great first dinner in Paris!\nOur Room/Suite was on the bottom floor and it was plush, clean and quiet. There was a small powder room at the entry, a wet bar with mini-fridge, a lovely living room area with couch, chairs, desk and flat screen TV. The bedroom had a large, King size bed, a HUGE closet with cherry wood and a large, clean, inviting bathroom complete with complimentary Guerlain toiletries. Very posh! I asked them for an iron and board because that's me, I hate wrinkles and we had them brought to our room right away. I also realized I had the wrong electrical adapter and they brought 2 adapters to me room in a matter of minutes. Every night there was turn down service with French chocolates left on the bed along with a breakfast menu. Top notch service! They staff went above and beyond for us while we were there.\nThe day that we were to depart to head to Disneyland Paris for a few days, we requested a private car service to take us there because of all of our luggage. The concierge had it set up for us, took care of the billing and the care arrived promptly. We had a wonderful ride! As well, we had breakfast on site in the restaurant that morning and it was a wonderful selection of eggs, ham, sausage, cheese, yogurts, and of course, breads and pastries. We even got to meet the little cat that lives in the Hotel as he walked through the breakfast area. So cute and sweet!\nThis location is also approximately 2 blocks from the Paris Metro (Porte Dauphine station) which is amazingly convenient as well as a few blocks away from several cafes, restaurants and of course the Arc De Triomphe. Fabulous hotel, fabulous location, fabulous service. I would return without giving it a second thought!!", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T00:57:46.510+03:00", "highlightTitle": ""}