{"organizations": [], "uuid": "728e2aef218797d182084bd96cce5da234a1788c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/01/d8/c1/a1/the-courtyard.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d1202077-Reviews-Kellys_Courtyard-Beijing.html", "section_title": "Kellys Courtyard - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Beijing, China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d1202077-r469816592-Kellys_Courtyard-Beijing.html", "country": "US", "domain_rank": 189, "title": "Home away from home in a big city", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Home away from home in a big city - Review of Kellys Courtyard, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "728e2aef218797d182084bd96cce5da234a1788c"}, "author": "R W", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d1202077-r469816592-Kellys_Courtyard-Beijing.html", "ord_in_thread": 0, "title": "Home away from home in a big city", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My husband and I originally were planning to stay at an airbnb on the other side of the Forbidden City for our time in Beijing. A couple weeks before our flight, our airbnb host had to cancel all her bookings so we decided to forgo the airbnb iand found a guesthouse instead. Kellys was highly rated on Tripadvisor, so we took the chance.\nWe were very, very pleasantly surprised with what we arrived to. Mark was there to greet us and welcome us to our room from day 1 and was a consistent friendly face throughout our entire 3 night stay.\nThis guesthouse is a bit hidden in the hutongs so if you are coming in for the first time to Beijing, and its late/dark, we recommend taking advantage of their taxi service form the airport. Another reviewer posted pictures of how to find the location could be quite helpful during the day, but we were very glad we decided to just take the taxi that first night being tired, it being dark, and us never having previously stepped foot into China before then. The hutongs can be confusing for the first time wandering through them.\nThe guesthouse itself is literally an enclosed courtyard, with all the rooms opening up into it. Its incredibly quiet though at night and it was very cozy - it was chilly when we were in Beijing but the room stayed really well insulated when the heat was on. The wifi worked great. Breakfast in the morning was toast, yogurt, some pastries, fruit, and coffee, but it was a welcome start to the day. We met other travelers at breakfast too that helped give us some tips on communication and ideas of what to do in Beijing.\nThe location of the hotel is very convenient. We either walked or took the subway everywhere. When we left we took the subway to the airport and that too was very easy. There are also a number of restaurants nearby, jammed with locals, where we got various delicious quick foods for breakfast or snacks. There was no mystery why those places were so busy lol!\nThe highlight of Kellys though was the staff, Mark in particular. He was there to welcome us every day we came back, and every morning when we woke up. He asked us how our day was, what our plans were, and offered advice if we needed any to getting around or things to do. He gave us a glimpse into the life of a Beijinger too from the viewpoint of a local versus the many expats we talked to during our trip. One often goes to a guesthouse over a hotel for the personal experience, and Mark really embodied what that experience should be. We stayed in a regular hotel later in our trip in Shanghai and it pales in comparison to the experience we had at Kellys on this exact point.\nOverall, Kellys was the perfect spot for our time in Beijing. Thank you Mark and your staff for such a wonderful stay!", "external_links": [], "published": "2017-03-24T03:00:00.000+03:00", "crawled": "2017-03-30T07:43:04.934+03:00", "highlightTitle": ""}