{"organizations": [], "uuid": "d1ea030c520a23e3401064e43477436629108744", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/d2/db/15/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99774-Reviews-or10-La_Quinta_Inn_Suites_Manhattan-New_York_City_New_York.html", "section_title": "La Quinta Inn &amp; Suites Manhattan - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99774-r464406776-La_Quinta_Inn_Suites_Manhattan-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Solid hotel in midtown Manhattan", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Solid hotel in midtown Manhattan - Review of La Quinta Inn & Suites Manhattan, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "d1ea030c520a23e3401064e43477436629108744"}, "author": "dolewhip5", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99774-r464406776-La_Quinta_Inn_Suites_Manhattan-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Solid hotel in midtown Manhattan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The hotel is in a great location- it sits in Koreatown, only steps away from the Empire State Building, Macy's Herald Square and Penn Station/subway. There's a good variety of different places to eat and shop around in the area, and there are several 24-hour stores within walking distance as well.\nThe hotel itself is relatively clean and well-kept. Rooms comparatively may be a bit on the small side, but for Manhattan these are decent sized rooms. Beds are super comfortable, especially after long days of exploring the city. Water was consistently hot, although it did take a few minutes for it to heat up (might just be a higher floor issue). The elevators are both super slow; probably a non-issue if you are on a lower floor and can navigate stairs easily instead, but higher floors end up waiting a while to go down (especially during breakfast). The complimentary breakfast is an okay option- it's not a traditional hot breakfast, but there are plenty of grab-and-go options if you're on the move.\nI stayed on the 14th (top) floor and my room had a view of the Empire State Building; I didn't face the street so noise from traffic wasn't an issue. And while I personally didn't check out the rooftop bar I could unfortunately hear it really well from my room- the stairwell doors that would help to block out most of the sound were propped open during most of my trip, meaning I had to hear the noise from the bar every night until close at 2 a.m. Luckily the A/C unit in the room produces a lot of white noise to help block out some of the sound.\nOverall, I enjoyed my stay here and would recommend this hotel as a reasonably-priced option in a great location. Review would have been 5 stars if the noise from the bar hadn't affected the quality of my sleep.", "external_links": [], "published": "2017-03-03T02:00:00.000+02:00", "crawled": "2017-03-30T19:57:19.223+03:00", "highlightTitle": ""}