{"organizations": [], "uuid": "0dcb0627cf1cb860cf2e08505e78166cc7b651d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/2f/42/28/world-trade-center-area.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d9761545-Reviews-Courtyard_New_York_Downtown_Manhattan_World_Trade_Center_Area-New_York_City_New_York.html", "section_title": "Courtyard New York Downtown Manhattan / World Trade Center Area - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d9761545-r467837818-Courtyard_New_York_Downtown_Manhattan_World_Trade_Center_Area-New_York_City_New_Y.html", "country": "US", "domain_rank": 189, "title": "Cozy rooms with amazing staff", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Cozy rooms with amazing staff - Review of Courtyard New York Downtown Manhattan / World Trade Center Area, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-16T02:00:00.000+02:00", "replies_count": 1, "uuid": "0dcb0627cf1cb860cf2e08505e78166cc7b651d2"}, "author": "Duston F", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d9761545-r467837818-Courtyard_New_York_Downtown_Manhattan_World_Trade_Center_Area-New_York_City_New_Y.html", "ord_in_thread": 0, "title": "Cozy rooms with amazing staff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Location is PERFECT. That is why my girlfriend and I booked this Hotel. We were steps away from the Subway as well as many tourist attractions that we pre planned on seeing.\nArrival: We arrived 5 hours prior to the check in time to put put away our bags, while checking in they told us a room was already available! Sweet!! The lobby was fairly small but that is to be expected of any new Hotel in NYC. The elevators were activated by your room card so that was a nice added touch, and feeling of security.\nRoom: We arrived to our cozy (Small) room but we weren't too phased. We booked the cheapest room so we didn't have high expectations. It did fit a big comfy KING bed so that is all that matters! The bathroom was also small but was put together very nice. There was free wifi and the TV in the room was massive and had Netflix and such already ready to go for us to enter in our info.\nCleanliness: I wont go into detail, I don't need too. The Hotel is less than 2 years old and everything still looks great.\nStaff: All staff we encountered were very helpful, no issues at all.\nRestaurant: The Hotel has a small Restaurant on one of its floors. The pricing isn't too bad at all and the portion sizes are huge, so I was very Happy! There is a patio area as well, it is nice because you're a few floors up. When you step outside right in front of you is the One World Trade Centre, so that was cool!\nTHE BAD: Only thing funky was trying to park to check in, you have to pull up on the curb and half your car is still in the middle of the road lol.... There was some construction going on across the street so maybe they're building a check in parking area.\nPARKING is EXPENSIVE... BUT also to be expected in NYC. It was $60 USD/24hr.", "external_links": [], "published": "2017-03-16T02:00:00.000+02:00", "crawled": "2017-03-29T05:40:14.633+03:00", "highlightTitle": ""}