{"organizations": [], "uuid": "e61446461261e6cdab4ff69a5b420c9ebfcdfdbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/61/23/c3/central-park.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d10368723-Reviews-Fairfield_Inn_Suites_New_York_Manhattan_Central_Park-New_York_City_New_York.html", "section_title": "Fairfield Inn &amp; Suites New York Manhattan/Central Park - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d10368723-r465202986-Fairfield_Inn_Suites_New_York_Manhattan_Central_Park-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "A Good Choice For A Stay In Manhattan", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "A Good Choice For A Stay In Manhattan - Review of Fairfield Inn & Suites New York Manhattan/Central Park, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-06T02:00:00.000+02:00", "replies_count": 0, "uuid": "e61446461261e6cdab4ff69a5b420c9ebfcdfdbf"}, "author": "Dalefarkas", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d10368723-r465202986-Fairfield_Inn_Suites_New_York_Manhattan_Central_Park-New_York_City_New_York.html", "ord_in_thread": 0, "title": "A Good Choice For A Stay In Manhattan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New York City is not inexpensive. So, finding a good hotel at a reasonable price can be a challenge. The Fairfield Inn offers an excellent balance for for people who want their creature comforts at a price that won't kill the family budget.\nThe nightly rate of a hotel room in the Big Apple is dependent on several factors:\n1) Location - This Fairfield Inn is far from midtown and a long walk from Central Park. It's located between 10th & 11th Avenue, closer to the Hudson River than the park.\n2) Room Size - The rooms, like many Manhattan hotels, are very small...especially compared to suburban or high priced city hotels. I believe the cabin on my last ocean cruise was larger.\nSo, why am I rating this inn with an Excellent 5 on TripAdvisor?\nThe reason is that despite these negatives the Fairfield Inn has offsetting benefits that go beyond location and room size.\n1) Though small, the rooms are perfectly laid out. They are totally efficient. Every switch and outlet is right where it should be. The bathroom is excellent. It's shower is large. The sink and Toto toilet are first rate. Lighting throughout the room is far better than most hotels I've stayed at. They even have the most efficient and innovative blackout curtain I've ever seen on a hotel room window.\n2) An excellent breakfast is included. It is better than at most Marriott properties we've been at. Given Manhattan prices that complimentary breakfast could cost you $30 for two people; more if you have kids.\n3) The staff is super friendly. That's every person from the front desk to the housekeepers. These people actually like their guests.\n4) The room and facility are spotlessly clean. The entire hotel is modern and well kept up.\n5) Marriott's point programs can be applied...and Marriott rewards its best customers. So, we were able to apply points to pay for one of our two nights.\nThe bottom line is that if you can allow for the off-the-beaten-track location and the small room you'll have a nice, efficient hotel room at an affordable price.\nMy one recommendation to Marriott management is that they consider putting an all-in-one workout machine in their fitness room. These used to be in the fitness rooms years ago but have since disappeared in favor of just hand weights and treadmills. Though hand weights are OK, an exercise machine would add a lot to my stay.\nThis Fairfield Inn has my full recommendation.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-06T02:00:00.000+02:00", "crawled": "2017-03-30T19:46:10.447+03:00", "highlightTitle": ""}