{"organizations": [], "uuid": "7948654dd10924e2df88c0d8f9a23cb909825e8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/39/3b/74/rooftop-jacuzzis.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d597703-Reviews-Villa_Spalletti_Trivelli-Rome_Lazio.html", "section_title": "Villa Spalletti Trivelli - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d597703-r463762269-Villa_Spalletti_Trivelli-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Excellent accommodation for a selebration -", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Excellent accommodation for a selebration - Review of Villa Spalletti Trivelli, Rome, Italy - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-01T02:00:00.000+02:00", "replies_count": 0, "uuid": "7948654dd10924e2df88c0d8f9a23cb909825e8a"}, "author": "AllaMoscow", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d597703-r463762269-Villa_Spalletti_Trivelli-Rome_Lazio.html", "ord_in_thread": 0, "title": "Excellent accommodation for a selebration -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We have visited Villa Spalletti a week ago for a 25th wedding anniversary of our friends. Villa Spalletti is a small family hotel with the grandeur of a royal palace - you feel exactly like a royal person the moment you enter and till the end of your stay.\nStaff is extra polite and friendly, with a personal touch you never find in huge 5-star hotels.\nNote they have a Russian-speaking girl at reception and a Russian-speaking waitress at breakfast. The breakfast itself is superb, with a variety of fresh juices, a collection of meat and salami, a variety of excellent cheeses, yoghurts, fresh fruit, warm freshly baked bread etc. you can order from an egg dishes selection, porridges, pancakes,waffles etc.\nThere is also a small but delicious a-la-carte menu for lunch or dinner if you happen to stay in the villa between your tours of discovering Rome.\nMinibar is free, being refreshed each day. There is a free bar at the 1-st floor sitting room from 5 pm, you can relax in a cosy atmosphere of a royal villa. There is also a small garden where you can sit with your drinks, or order your lunch there.\nEach room has its own name, ours was St. Angelo on the 2nd floor. Spacious, sun-drenched room, cosy bed, excellent linen. A nice touch is the huge old-style window with old wooden window blinds. Bathroom is gorgeous with villeroy@boch equipment, and excellent bathroom amenities. The best thing is a huge and thick white floor mat!\nWe also had an anniversary dinner at the Villa arranged by our friends. I liked everything, especially the home-made pasta. However the duck breast was rather dry, pity. Excellent wine choice.\nA very touching point - the young owner, Andrea Spalletti, had greeted us on the evening of the celebration!\nPerfect long weekend in Rome. Will definitely return!!\nSee all photos", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-01T02:00:00.000+02:00", "crawled": "2017-03-27T03:25:54.417+03:00", "highlightTitle": ""}