{"organizations": [], "uuid": "670a84f0a41db6ab33fdd9a4a0bf4f2801cd3f32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/5e/d2/2b/hotel-jeanne-d-arc.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d189228-Reviews-Hotel_Jeanne_d_Arc-Paris_Ile_de_France.html", "section_title": "Hotel Jeanne d'Arc - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d189228-r470350979-Hotel_Jeanne_d_Arc-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Great location and friendly staff", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great location and friendly staff - Review of Hotel Jeanne d'Arc, Paris, France - TripAdvisor", "spam_score": 0.008, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "670a84f0a41db6ab33fdd9a4a0bf4f2801cd3f32"}, "author": "Heather H", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d189228-r470350979-Hotel_Jeanne_d_Arc-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Great location and friendly staff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My daughter and I stayed for a week and thoroughly enjoyed our time. The staff was friendly and helpful. We had trouble with our toilet not working one evening. The staff member was obviously not pleased about having to deal with a broken toilet, but he came up and was able to get it working for us. We did learn to make sure to leave enough time for breakfast, as they serve it to you, so it takes some time for the staff to get the everything out to you. But we found it to be tasty and filling (orange juice, croissant, baguette, butter, honey, jam, several types of cheese, yogurt and a choice of tea or coffee). We stayed in a third floor corner room with two twin beds. When we made the reservations, it was not possible to specifically reserve twin beds - you just had to request such a room, if it was available when you arrived. So we were thrilled that they could accommodate us. We found the beds to be very comfortable and all of the linens in the bedroom and bathroom to be spotless. We were pleasantly surprised about the size of the room, as we had heard about how tiny European hotel rooms can be. Yes, this was much smaller than a typical American hotel room, but it was newly remodeled and had plenty of space for the two of us. We had a shower and had plenty of room for our toiletries on the shelves under the sink. The wifi was fantastic. My daughter was able to watch movies and message with her friends on her electronics while I researched the adventures for the next day and checked my email. As is true of most older buildings, it is not at all sound proof. So we were able to hear what our neighbors were up to on all sides. Generally that wasn't a problem, because most people were considerate, but there were a few late night and early morning wake-ups from neighbors stomping about or talking loudly. But since we were on vacation, we could just fall back to sleep. We faced two streets. So there was light traffic and pedestrian sounds throughout the night, but generally not a problem. Because there are a lot of restaurants and nicer bars in the area, my daughter and I felt very safe walking to the hotel at night from the subway. There were always couples or groups of people about on their way somewhere. We loved Creperie Suzette and Rue de Rossiers. Also the shops surrounding Saint Paul's cathedral were amazing - some great food! It was so easy to get everywhere in Paris from this hotel. We would highly recommend staying here.\nRoom Tip: Rooms with showers have been remodeled. See more room tips", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-28T21:58:14.550+03:00", "highlightTitle": ""}