{"organizations": [], "uuid": "23c44633d1cc30333f7f8055589cfa82c764e921", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/02/31/4d/8c/hotel-de-londres-eiffel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d265476-Reviews-Hotel_de_Londres_Eiffel-Paris_Ile_de_France.html", "section_title": "Hotel de Londres Eiffel - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d265476-r469155559-Hotel_de_Londres_Eiffel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Wonderfully cozy", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Wonderfully cozy - Review of Hotel de Londres Eiffel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 0, "uuid": "23c44633d1cc30333f7f8055589cfa82c764e921"}, "author": "xtinebean", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d265476-r469155559-Hotel_de_Londres_Eiffel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Wonderfully cozy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My husband and I stayed here for one night in early March. The hotel is in fairly close walking distance to the Ecole Militaire Metro station, and the Pont de l’Alma RER station. We used both during our stay. The proximity to the Eiffel Tower makes it perfect for nighttime viewing - you don't have to walk too far to get a perfect view of the sparkling lights! The neighborhood was very quiet and we were able to sleep with the window open. There are a bunch of little shops along the street, we wanted to stop and get some of the delicious looking fruit and pastries but never had the chance.\nThe man that greeted us at the front desk was warm and helpful from check in until check out. We also checked in pretty early, at around 11am, and we were surprised to find that our room was already ready for us to put our things in. We booked a room with a view of the Eiffel Tower (on the 5th floor), and even though you can only see the top, it was magical. The room and bathroom were smaller than what we're used to, but they were just fine for two people. And they use L'Occitane bath products! We had breakfast the morning we were here and it was good and light - croissants, ham, salami, cheese, fruit, yogurt, juice, coffee, tea. If you want something more substantial for breakfast, I would recommend one of the cafes down the street.\nThe best part about this place for us was the fact that after we had checked out, they still let us leave our bags while we went exploring the city! A bunch of tourist locations in Paris do not allow luggage, so this was a huge help.. we had checked out at around 10am and they had our bags ready to go even at 7pm.\nWe had such a short time in Paris (2 days) so when we decide to visit again, I will definitely stay here again. :)", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-27T05:45:40.126+03:00", "highlightTitle": ""}