{"organizations": [], "uuid": "711e7cccf30bc64c9d4a269d8974bd21f971b6d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/fd/a0/d7/w-new-york-times-square.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d235238-Reviews-W_New_York_Times_Square-New_York_City_New_York.html", "section_title": "W New York - Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d235238-r470573043-W_New_York_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Last minute booking, Fantastic!!! - Review", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Last minute booking, Fantastic!!! - Review of W New York - Times Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "711e7cccf30bc64c9d4a269d8974bd21f971b6d8"}, "author": "JOERNELSON", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d235238-r470573043-W_New_York_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Last minute booking, Fantastic!!! - Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Booked this last minute through expedia as our previous booking did not work out. Chose the pre-pay option which made for an easy check in although Expedia reversed my first and last name. From the arrival with the informative valet and doorman, up the elevator to check -in....seamless. Our arrival agent was friendly, personable and also very informative. Everyone observed the 5/10 rule throughout our stay. The room was spacious for Times Square with a partial view of the Square. The room was immaculate and as a former hotel inspector I know waht to look for.\nA quick brunch on Saturday in Blue Fin was amazing.. spicy bloody mary's and the food were on point. Even our bartender, who was very busy, was again personable friendly and very accommodating. The Blue Fin had a nice vibe without feeling touristy and it was not overpriced for the quality, setting and service.\nWhen we checked out he next day the same desk agent could not have been more friendly and accommodating. When he checked our bags for later pick-up the same.... informative, friendly and so genuine. When I encountered one of the staff in the elevator on the way to Blue Fin for a brunch cocktail he was friendly and engaged in conversation.\nThe close of out trip was another great encounter with the valet..\nIT is obvious there is a real service culture in place here at the W Times Square. All of my group felt the same and we are very eager to return. I will most certainly recommend.\nRoom Tip: Just be nice on check in and ask the right questions. See more room tips", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-29T14:15:17.963+03:00", "highlightTitle": ""}