{"organizations": [], "uuid": "4440e50e6861497108f043b82ce4c6bd2e6e2a20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/02/8a/f2/98/premier-inn-london-southwark.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d276502-Reviews-Premier_Inn_London_Southwark_Borough_Market_Hotel-London_England.html", "section_title": "Premier Inn London Southwark (Borough Market) Hotel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d276502-r470618070-Premier_Inn_London_Southwark_Borough_Market_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Wow for Location and Wow for Staff", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Wow for Location and Wow for Staff - Review of Premier Inn London Southwark (Borough Market) Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "4440e50e6861497108f043b82ce4c6bd2e6e2a20"}, "author": "Liamoog", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d276502-r470618070-Premier_Inn_London_Southwark_Borough_Market_Hotel-London_England.html", "ord_in_thread": 0, "title": "Wow for Location and Wow for Staff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Following the satnav carefully as it goes along the small streets of South London got us to the hotel. It has a few parking spaces (4 I think) one of which was marked for wheelchair use. The hotel is L shaped and is attached to The Anchor pub.\nIts location does mean that there are some changes in elevation within the building, but for wheel chair use that was not a problem.\nIts facilities are as you would expect from this price range hotel. In the room, room 4, there were tea making facilities, room temperature control worked very well. A large comfortable double bed.\nThe bathroom was accessible with grab rails around the toilet. It had a bath but it too had a good deal of hand rails making it accessible tor those with reduced mobility.\nThe room and all the building was clean and well presented.\nAs it stands the building would rate a 3-4 star.\nBreakfast was in The Anchor pub. The journey is along a series of corradors. If you are in a wheelchair you may need a had with the between floors lift as the door is heavy. There was hot and cold food and it was topped when needed, even at a busy time.\nAnd now for the first Wow factor - location. It is a very short walk from Borough Market and the Golden Hind. It is an even shorter walk from the river Themes and a short stroll to Tate Modern and the Rose theater.\nAnd the second Wow factor - the staff. From checking in, to departure, the team at the front desk were superb. It makes such a difference to have local people with local knowledge. It make a very real difference when they are friendly, professional and yes, for a hotel in London, very hospitable. So a personal 'Thank You' to Rina, Jomilsa and Julie. They turned a good quality budget price hotel into something special. We are looking forward to finding an excuse to return.", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-31T19:45:42.625+03:00", "highlightTitle": ""}