{"organizations": [], "uuid": "1520f1decfe7841e3239324716af14a9dfb129ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/d1/e5/74/be-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d6555841-Reviews-The_Leon_Hotel-New_York_City_New_York.html", "section_title": "The Leon Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6555841-r470842858-The_Leon_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "A True Gem Within New York -", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "A True Gem Within New York - Review of The Leon Hotel, New York City, NY - TripAdvisor", "spam_score": 0.025, "site_type": "discussions", "published": "2017-03-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "1520f1decfe7841e3239324716af14a9dfb129ae"}, "author": "abellem", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6555841-r470842858-The_Leon_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "A True Gem Within New York -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This was a nice and cozy boutique hotel within Chinatown.\nCleanliness - Everything was super clean, we had no issues whatsoever. The bathroom was spotless. Sheets were crisp and white. No stains on the carpet. I am very picky when it comes to cleanliness and this hotel met all my standards.\nComfort - We had the room with the King Size bed and there was plenty of space. Inside the room there is a small Keurig machine with complimentary tea and coffee. The mattress and pillows were very comfortable. Complimentary toiletries included a conditioning shampoo, a bar of soap and makeup removing cloths, which I really appreciated.\nService - The staff were friendly, accommodating and went above and beyond to take care of our needs. I had run out of toothpaste so I'd asked the front desk staff for directions to a grocery store, she happily gave me directions and also told me that she would send some toothpaste up to my room instead.\nLocation - Chinatown is very vibrant and robust, but it's also dusty and dirty. That was the only small thing I struggled with. Still, I eventually got over it because it's part of the New York experience. The area is very safe at night. It's also steps away from a a couple of Subway stations: Grand Street and Canal Street. There's also a bus at the corner of Allen and Grand Street that will take you to Midtown Manhattan (M15 and M15-Select Bus Service.)\nThe hotel is a few blocks away from Soho, where you'll find cute places to shop in. It's also a few blocks away from Little Italy where you will find overpriced restaurants with mediocre food. I would suggest avoiding eating at Little Italy. There are many other restaurants this area has to offer. There's a Popeye's fast food restaurant right beside The Leon, and you can find great deals for delicious baked goods at any of the Chinese bakeries--there is one in every corner. There are also plenty of grocery stores.\nAlso, around the corner of the hotel is a popular and delicious deli restaurant called Russ and Daughters that serve yummy sandwiches and the best ice cream I've ever tasted (Halva ice cream with sesame and caramel sauce.)\nOverall, this location has a lot to offer, and The Leon Hotel is a true gem in this vibrant part of the city.", "external_links": [], "published": "2017-03-28T03:00:00.000+03:00", "crawled": "2017-03-30T19:31:39.042+03:00", "highlightTitle": ""}