{"organizations": [], "uuid": "0bdd96cab854349d50a37319f9cdb6ae7649c32a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/03/ea/8e/4d/dining.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g293841-d1836961-Reviews-Nexus_Resorts_Hotel-Kampala_Central_Region.html", "section_title": "Nexus Resorts Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Kampala, Uganda) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g293841-d1836961-r468753880-Nexus_Resorts_Hotel-Kampala_Central_Region.html", "country": "US", "domain_rank": 189, "title": "Great stay in Nexus Resorts Hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great stay in Nexus Resorts Hotel - Review of Nexus Resorts Hotel, Kampala, Uganda - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "0bdd96cab854349d50a37319f9cdb6ae7649c32a"}, "author": "phaex", "url": "https://www.tripadvisor.com/ShowUserReviews-g293841-d1836961-r468753880-Nexus_Resorts_Hotel-Kampala_Central_Region.html", "ord_in_thread": 0, "title": "Great stay in Nexus Resorts Hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After a beautiful safari trip we stayed for 6 nights in Nexus Resorts Hotel in March. Great place to be, with prices very affordable. The hotel is located in a part of Kampala called Nansana Town. Travelling from Nexus to the centre of Kampala was easy going with a taxi and travelling with it, about 18 people can find a place in such a vehicle, is an adventure in its own.\nWe organised our stay in Nexus in the Netherlands in January through email contact. Lillian Nankya, front office, responded very kind and accurate and when we arrived our baggage was directly transported to a big room with a queen size bed, I lost my wife every night, a small fridge, huge towels in the bathroom and a beautiful view from out of the window. The staff in the hotel was very kind and helpful from the moment on we arrived, till the moment we left. They helped us for example directly with our laundry. Breakfast was very good with a lot of possibilities to choose. It was possible to order drinks and food at any time, and if wanted they could bring it to your room.\nOne moment I will never forget. Esther, one of the managers in the hotel, helped us one evening very professional by cancel a deal with a not very reliable driver guide and she found for us a new one by phoning several companies. She negotiated that evening for us the best deal. With here help, which was absolutely necessary for us at that time in the evening, we came in contact with a new driver guide, called Cyrus (Gorrilla Safaris Uganda). He was an extraordinary good guide and driver for two days during our stay in Nexus. Thanks Esther for helping us out, thanks Lilian, thanks all the people working there for the great time we had in Nexus.\nPeter and Geertruid", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-27T16:58:47.806+03:00", "highlightTitle": ""}