{"organizations": [], "uuid": "93c86b77cde715998d6df56934056404901a80f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/32/53/3e/hotel-relais-bosquet.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d229602-Reviews-or15-Hotel_Relais_Bosquet_Paris-Paris_Ile_de_France.html", "section_title": "Hotel Relais Bosquet Paris - UPDATED 2017 Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d229602-r453484323-Hotel_Relais_Bosquet_Paris-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Oui! Oui! Un magnificent!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Oui! Oui! Un magnificent! - Review of Hotel Relais Bosquet Paris, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "93c86b77cde715998d6df56934056404901a80f1"}, "author": "luvplayacar", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d229602-r453484323-Hotel_Relais_Bosquet_Paris-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Oui! Oui! Un magnificent!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lovely hotel tucked away from the hustle and bustle, yet within easy walking distance to the many things you want to see. Located on a non-descript side street (if I hadn't seen pictures of the exterior awning, I would have thought my driver didn't know where he was going. (I chose the transfer service through KLM for $38(Euros). So it is neatly tucked away.\nTaxi and bus service readily available nearby. I didn't use the Metro this trip, so I am unaware of those locations.\nBookend by bakeries. Plenty of dining choices one very short block away on Rue Cler. Lots of dining nearby as well towards the Eiffel Tower.\nThe walk to the Eiffel Tower is very easy and flat. Anyone, of any age can walk there from the hotel. Also, you enter from the back by the gardens and the lines are shorter. Note, you enter via a security check point first. I was looking for the ticket stations, then realized they are all inside the gated area. Entering through the back puts you directly at the line (on left) to buy stairs only access or escalator access. I choose the stairs (did I mention the bakeries next to hotel?) the lines were short due to the cold weather. I took my time and rested going up. It was no problem to descent. The summit is closed until end of January for maintenance- but the views from the 2nd level are want you want. Actually, it's the 2nd and a 1/2 platform that doesn't have any fencing in the way, so your photos are unobstructed. To reach 2.5, it is 10 or so steps up to that level from level 2.\nNow back to the hotel - the bathtub was a restful retreat to soak my tired body after climbing the stairs and being stuffed in an airplane seat for 10 hours. Also plenty of hot water to warm up.\nThe electric tea kettle was a welcomed addition to the room. I was so cold, I had 2 cups and a hot bath! Herbal and non herbal available as well as Nescafé instant coffee with condiments.\nMattresses are firm. My king size (2twins made together as a king) came with 4 pillows. Duvet cover only. No need for extra since the radiator works really quickly. I dont live in a area with this type of heating. So move the dial in small increments. It heats up quickly.\nThe management failed to tell me to put my key card in the slot by the front door in order to turn on the lights. I had to go downstairs to ask how to operate them. I chose to use the stairs (this time due to the soufflés I had for lunch at\nLe Soufflé). The stairs are quite narrow (this is a historic type building). I was able to navigate with my carry on, but a full size would have been an issue. There is an elevator, but I really urge you to consider your belongings due to the small scale of rooms and space due to the ages of the buildings in Paris. Also during this time of the year, your clothes are covered with a jacket. No one, but your dining buddy will notice the same 2 outfits.\nFriendly, English speaking staff. Water available in the dining room all day. Cups are on top of dispenser. Restrooms are on ground level near front desk and sitting area. Good to know if you are out and about and need facilities that are easy to access. Or if your mate is a shower/bathroom hog - you have a back up without leaving the building.\nElectric blinds. Electric ac for wall unit.\nJust a note to be considerate of your neighbors when coming in late. This is an older building and noise can carry. It wasn't an issue for me even though the hotel was full. The only thing I heard was someone come in at 2 am but I was awake due to jet lag anyway. My room was located on the front of building and no noise from cars because it is a quiet neighborhood. I will hear the morning commuters but night is very quite. No pedestrian noise from the street as well. There is construction nearby, so I probably won't sleep late due to workers arriving. But I also want an early start. Construction workers leave around 4:30pm.\nOne more word of advice, don't go by the 3 star rating in comparison to US hotels. This excels that rating! All interiors spic and span and quite new looking. Elegant furnishings and hospitable staff located in a quiet neighborhood. Just what I was looking for in Paris! Merci!", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-27T13:03:39.417+03:00", "highlightTitle": ""}