{"organizations": [], "uuid": "68f0810ca8ea66c7959af097f9900dc79e1c60e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/cc/fd/d3/premier-inn-london-st.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d6540670-Reviews-Premier_Inn_London_St_Pancras_Hotel-London_England.html", "section_title": "Premier Inn London St Pancras Hotel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6540670-r471414380-Premier_Inn_London_St_Pancras_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Comfortable hotel, spacious rooms, good food", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Comfortable hotel, spacious rooms, good food - Review of Premier Inn London St Pancras Hotel, London, England - TripAdvisor", "spam_score": 0.052, "site_type": "discussions", "published": "2017-03-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "68f0810ca8ea66c7959af097f9900dc79e1c60e8"}, "author": "James G", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6540670-r471414380-Premier_Inn_London_St_Pancras_Hotel-London_England.html", "ord_in_thread": 0, "title": "Comfortable hotel, spacious rooms, good food", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This is an excellent hotel in a convenient location. The property has been newly renovated and it was done well. Each room as a ceiling based central AC/heating with in-room thermostat. The full sized beds (about double not queen sized) comes with a single mattress on top instead of two twin beds pushed together. And yes - a real tub bath with shower curtains and a sink inside the good sized bathrooms. No more water on the floor as in some other baths with \"Euro-styled\" showers. Furniture is sparse but well thought out. Free WiFi is very fast and I found no need to upgrade to the paid WiFi. Three fast and roomy elevators so if one is broken, there is always another. Friendly and courteous staff although not always knowledgeable about how to answer tourist questions about attractions. Dining room is excellent. Spacious and full dinner service and excellent views. The breakfast is also excellent. Location is directly across from British Library and within walking distance to the British Museum. Nearly across the street is Kings Cross underground station from which one can get anywhere. It is connected to the St. Pancras train station. I took a train directly from Gatwick airport to St. Pancras and just walked across the street to the hotel. The \"star\" rating I have is based on all hotels including the upper tier St. Pancras Regency which is across the street at the train station, looks like a castle, and is part of the Marriott chain. With its mid-tier category for the cost-conscious but not cheap tourist, it should be at the top of the list.", "external_links": [], "published": "2017-03-30T03:00:00.000+03:00", "crawled": "2017-03-31T17:26:53.347+03:00", "highlightTitle": ""}