{"organizations": [], "uuid": "40d424b9fb006096fa6e381b401d81833b871879", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/82/8a/80/hotel-joyce-astotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d1631156-Reviews-Hotel_Joyce_Astotel-Paris_Ile_de_France.html", "section_title": "Hotel Joyce - Astotel - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1631156-r465176271-Hotel_Joyce_Astotel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Was treated better than family!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Was treated better than family! - Review of Hotel Joyce - Astotel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-06T02:00:00.000+02:00", "replies_count": 0, "uuid": "40d424b9fb006096fa6e381b401d81833b871879"}, "author": "Psuedo86", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1631156-r465176271-Hotel_Joyce_Astotel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Was treated better than family!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I was referred to this hotel by a friend who had stayed there previously and although I was debating between hotel Joyce and one of the sister properties ( 123 Sebastopol) I ended up choosing Hotel Joyce because it was more convenient and it would save us some $$$$ and I am soooo glad I did. We took a mother daughter trip to Paris in February ( over valentines week) celebrating a birthday. Up on arrival we were greeted kindly by Douglas who explained everything to us and kept our luggage until our room was ready. Although we had missed the breakfast hour and it was not \"open bar\" time just yet, they were kind enough to bring us coffee and pastries anyway!!!! We loved the open bar snacks they had available each day and even visited some of the sister properties to see what goodies the put out for us to enjoy. We were happy that the open bar lasted until 2am because some of the evenings when we got back to the hotel late and just needed a coffee or tea boost we didn't need to pay for it!!! it was already there for us to enjoy. The staff is very kind and very helpful and they treated us like family. We were very comfortable with the neighborhood and the location of the metro to the hotel and had no problem coming in late ( although if your coming back late I would suggest you take the St.George station and not pigalle as it is close to the Moulin Rouge and I wouldn't really recommend walking around at night in that area!).\nThere are plenty of restaurants and bakeries etc around and even a grocery store so I would say it is very conveniently located to anywhere you wish to go in central Paris. Our room was small ( as are all rooms in Europe) but comfy for two people... love the décor! room 405 faces the street which is perfect because you get the cute Paris feel and it is far enough from the elevator so you are not bothered by guests constantly. I would say the walls are pretty thick so you cant really hear much and it is very clean!!!\nThe night staff Samuel is so informative and so helpful! He made us feel right at home and in fact every night we looked forward to coming back to the hotel and enjoying a cup of tea as we spoke to Samuel. He provided some great suggestions on where to eat , where to go and we even discussed our potential interest in moving to Paris and he provided some great information. None the less it definitely felt like we had stayed there and knew Samuel like family. He took his time, was patient, a wealth of knowledge ( no seriously he knows everything) ,very professional, welcoming and not to mention impeccable English! Felt like it was our 20th time staying there! We miss Samuel!\nThe hotel manager Marie-Lou is also a superstar. She was pleasant, accommodating and gave some great suggestions as well. Like I mentioned I celebrated a birthday on this trip ( which was a day apart from her birthday as well) and she surprised me with a birthday gift box! It was so thoughtful and it made my trip and stay that much more memorable and pleasant! Thank you Marie Lou you are truly one of a kind! Talking about lasting impressions with the staff at this hotel!\nThe cafeteria/ cleaning staff at this hotel are also one of a kind, they are kind and always smiling and willing to help out although I cant remember the ladies by name I can truly say that they were beyond gracious!\nThe hotel also seemed like it had a lot of \" regular\" guests from the small sample size we spoke with which says a lot about a hotel that keeps their guests happy regularly!\n**Warning the elevator at the hotel is very small ( my mom and I, with two full size luggage had some trouble and had to play a bit of tetris to fit in one trip :) )\nHotel Joyce made my birthday trip and the Paris experience that much more memorable for us and I will definitely not only be returning to this hotel but will be recommending it to friends and family!\nRoom Tip: Room 405 had a great street view ( as opposed to courtyard) and it was far way from the elevator doo... See more room tips", "external_links": [], "published": "2017-03-06T02:00:00.000+02:00", "crawled": "2017-03-27T03:58:51.903+03:00", "highlightTitle": ""}