{"organizations": [], "uuid": "ef95d23d724fc9d4c535642780d1d82f74dc4333", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/24/67/83/roof-deck.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93358-Reviews-Pod_51_Hotel-New_York_City_New_York.html", "section_title": "Pod 51 Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93358-r469258303-Pod_51_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Double the Fun, great Room and budget friendly", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Double the Fun, great Room and budget friendly - Review of Pod 51 Hotel, New York City, NY - TripAdvisor", "spam_score": 0.002, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 0, "uuid": "ef95d23d724fc9d4c535642780d1d82f74dc4333"}, "author": "Bonita P", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93358-r469258303-Pod_51_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Double the Fun, great Room and budget friendly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed at Pod 51, it was easy to get to from the Lexington Station. I was in search of an affordable hotel for 4 days/3 nights for a business trip. Thought I would need to cancel because I wasn't having much luck with \"affordable.\" But I came across Pod 51, I checked out the rooms, the price was \"affordable.\" It was easy access to the major train lines to downtown. The hotel staff was very friendly. I arrived a little early and the desk person, offered me another available room so I wouldn't have to wait. It was the same type of room, queen bed w/private bathroom. The room was very clean, the bed was comfortable. The bathroom was small, but big enough for one person. The bathroom was a little cold, so I had to close the door to keep the room warm. The room had everything a guest would need, tv, table/chair, window, side bedtables. The hotel promotes small rooms at an affordable price, but I didn't notice it was smaller than a regular room. I will definitely return and I have already promoted Pod 51 to all my travel friends. There were many restaurants within walking distance; great shopping also within walking distance. In the morning I purchased a quick bite at the small but affordable coffee type shop. There was someone available to help you with directions and information on public transportation. You were in the middle of the city, a great spot. I can't wait to return. The housekeeping lady was very nice, she was always smiling and said good morning, when I saw her. The room was cleaned each day I returned to the room. I can't wait to return. Thank you Pod 51 for a wonderful stay.\nRoom Tip: I choose room w/private bathroom. Sharing a bathroom would not work for me. See more room tips", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-29T06:01:47.183+03:00", "highlightTitle": ""}