{"organizations": [], "uuid": "8a1113b3c512bf7ab0f4226841d81585a7a70001", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/81/de/4b/smooth-hotel-rome-termini.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d232875-Reviews-Smooth_Hotel_Rome_Termini-Rome_Lazio.html", "section_title": "Smooth Hotel Rome Termini - UPDATED 2017 Reviews &amp; Price Comparison (Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d232875-r466780449-Smooth_Hotel_Rome_Termini-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "One night stay in Rome -", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "One night stay in Rome - Review of Smooth Hotel Rome Termini, Rome, Italy - TripAdvisor", "spam_score": 0.005, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "8a1113b3c512bf7ab0f4226841d81585a7a70001"}, "author": "FrenchCommando", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d232875-r466780449-Smooth_Hotel_Rome_Termini-Rome_Lazio.html", "ord_in_thread": 0, "title": "One night stay in Rome -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A business colleague and I had been in southern Italy and decided to overnight in Rome prior to returning to the states. We left Naples early on the express train and arrived in Rome mid morning. The hotel is a quick 5-10 minute walk from the train terminal, as long as you have bags with roller wheels.\nWe arrived at the hotel at 11:00 AM, and the clerk told us we were slightly early for check in. However, they would see if housekeeping had our rooms ready. They did not, but they immediately went to clean them. Within a few minutes the housekeeping manager fetched us from the breakfast lounge (included with room BTW and very good selection) and escorted us to our respective rooms. She, as was all the staff, a peach. 20 minutes after walking in, we had our rooms. 30 minutes later, we had walked back to the train station, rented scooters and off we went.\nThe hotel is in an older building, but the interior is newly renovated, and from the appearance you would never know you were in a building that has probably been standing for 100 plus years. The rooms are modern, with a refrigerator and coffee service, and very beautiful. Beds are comfortable. The décor in the rooms is modern, neat and clean as well. No complaints at all about the bath, or room, save the lack of a chair. However, my colleagues room had a couch, so I suppose that is the luck of the draw. Sizable and roomy too, for European standards, the rooms left me wanting nothing.\nFor the price, I would stay there again and rate it high on the list of desirable, economical hotels I've stayed at while traveling Europe. Close to the terminal, taxi's and many restaurants. We found a Greek place within 5 minutes that was phenomenal.\nIf you're a hotel snob, this may not be your hotel, but you wouldn't have much to complain about. If you're a Holiday Inn person, this is going to be more than you bargained for, and very nice.\nCiao\nRoom Tip: If you want a sitting area in the room, ask for it. See more room tips", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-29T23:40:32.070+03:00", "highlightTitle": ""}