{"organizations": [], "uuid": "bc437e99b3bd88fb0eaae4a65236f2c4ed8793f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/48/bd/69/edge-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d8732904-Reviews-Edge_Hotel-New_York_City_New_York.html", "section_title": "Edge Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d8732904-r463206321-Edge_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Cozy and modern; loved it", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Cozy and modern; loved it - Review of Edge Hotel, New York City, NY - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-02-27T02:00:00.000+02:00", "replies_count": 1, "uuid": "bc437e99b3bd88fb0eaae4a65236f2c4ed8793f2"}, "author": "arecibena", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d8732904-r463206321-Edge_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Cozy and modern; loved it", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I found this hotel thru United Palace after buying some concert tickets. I read previous reviews and they seemed pretty fair so I went ahead and booked it for an overnight. It was a great surprise, it is not your typical hotel that you are used to, it's very small but service, location and amenities are what I enjoyed the most. Upon arrival, our room wasn't ready but we were offered a call and to sit by their lounge located on the lower level C. We sat there for some time and then we headed back to finish the check in process which it went very smooth. Our room was on the 6th floor (first floor where rooms are located). We were upgraded to a standard double with 2 double beds (these are tucked in corners so they definitely are very quiet, I didn't hear one ambulance siren. If you don't care to be on different beds for your stay this a great room category) room was on the small side (it is a boutique hotel) but very cozy and modern, it had everything we needed. Simple but nicely decorated, we didn't care for the view (i mean this hotel is located in the middle of a neighborhood, can't expect to have city views but you can see some far away) but we didn't go for the views either. It's is a newly renovated hotel so everything is new. We were very pleased with our room, the hotel in general and we are definitely coming back since everything is near and walking distance. This hotel reminded us a lot our hotel stay in Barcelona, Spain. It had that same European feel and it had everything we needed. We found an excellent outside parking, used Uber to move to and from the hotel to further places and we felt safe throughout our stay. Check out was also very smooth and we just can't wait to return. Kudos to the Edge Hotel team, you guys are the best asset of the property. You could tell that these guys have a lot of pride on what they do, cause it really shows.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-02-27T02:00:00.000+02:00", "crawled": "2017-03-29T05:21:27.532+03:00", "highlightTitle": ""}