{"organizations": [], "uuid": "f4668280bf749fc833c2d93d41d2f6726e4dc17c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/81/35/08/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d3907033-Reviews-Premier_Inn_London_Waterloo_Westminster_Bridge_Hotel-London_England.html", "section_title": "Premier Inn London Waterloo (Westminster Bridge) Hotel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d3907033-r470350435-Premier_Inn_London_Waterloo_Westminster_Bridge_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Musty room - soon rectified", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Musty room - soon rectified - Review of Premier Inn London Waterloo (Westminster Bridge) Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "f4668280bf749fc833c2d93d41d2f6726e4dc17c"}, "author": "Eileen D", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d3907033-r470350435-Premier_Inn_London_Waterloo_Westminster_Bridge_Hotel-London_England.html", "ord_in_thread": 0, "title": "Musty room - soon rectified", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Attending a black tie event in London the evening of Friday, 24 March, my husband and I booked this Premier Inn some time prior to the event. Ahead of the day, I checked us in online and upon arrival, we used the automated screen to collect our room passes. We were allocated Room 2, on the ground floor. Unfortunately, the 'ground floor' location wasn't quite on the same level as the reception and we had a small flight of steps to manage with our baggage.\nNonetheless, we entered the room to find a small, dungeon-like space with a very small window that was not able to be opened for ventilation ... and a strong stench of mustiness. My husband was less than complimentary about the 'aroma' and likened it to a smell of bad drains.\nReturning to the reception, I alerted the staff and they called 'housekeeping', who came with me back to the room and agreed with us about the unpleasant aroma. The advice was that we would need to move to another room, so that was what we requested from reception. The young man who was manning the desk admitted that the online automated system, that produces room passes for those who had checked in online, operated a somewhat 'random' room allocation process but also that he was aware of the problem in Room 2.\nMy concern is that, if this is a known issue, it should be dealt with rather than allowing unsuspecting guests to find themselves walking into a foul smelling room.\nThe staff were very helpful and, overall, our stay was pleasant but it wouldn't take too much effort to rectify the apparent problem in Room 2 ... or would it?\nRoom Tip: Don't use Room 2 ... not sure that Room 1, directly next door, would be any different! See more room tips", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-31T19:58:39.950+03:00", "highlightTitle": ""}