{"organizations": [], "uuid": "afa359efd84ea964ade066b07f08239afbd9e350", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/02/84/f2/0c/avalon-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99387-Reviews-or10-Avalon_Hotel-New_York_City_New_York.html", "section_title": "Avalon Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99387-r463914490-Avalon_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Exceeded our expectations", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Exceeded our expectations - Review of Avalon Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-01T02:00:00.000+02:00", "replies_count": 1, "uuid": "afa359efd84ea964ade066b07f08239afbd9e350"}, "author": "travelbug61", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99387-r463914490-Avalon_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Exceeded our expectations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My sister and I shared one of the Avalon's spacious junior suites for a weekend. I had booked a low ($129/night) non-refundable rate I found through a discount website, and the hotel's location was a big selling point: within easy walking distance of Penn Station, and on the edge of bustling Koreatown, full of foodie delights. It's also close enough to walk to Chelsea, where we were visiting family.\nFor the low price, we were expecting a serviceable hotel, but the Avalon was much more than that. All the employees we encountered were warm, friendly, efficient, and helpful. Wilson deserves a special mention; from checking our luggage to giving directions to hailing cabs, he couldn't have been kinder or more helpful.\nOur suite, located on the top (12th) floor, was lovely and seemed to have been recently renovated. There was so much space for the two of us and all our assorted belongings; never have I stayed in a Manhattan hotel room with nearly as much space! Among other things, the room was equipped with separate minibar and mini-fridge, as well as two flat-screen TVs, two full-sized beds, and a sofabed! It faced away from the street, so was blissfully quiet and peaceful at all times of day and night. Everything was well-maintained and sparkling clean. The bathroom was a real treat, too, with double vanities and separate bathtub and shower stall, and much more space than we needed to spread out all our toiletries. All was spic and span, and both water pressure and temperature couldn't have been better.\nThe only thing that would have made the room more perfect would have been tea/coffee-making facilities. That said, the lobby facilities for coffee, tea, and filtered water were very pleasant and always well-supplied. And there were several lovely spots to enjoy coffee, tea, and pastries just steps from the hotel, including Cafe M and Cafe Ginseng, on the same block, and Blank Slate, a couple of blocks away.\nSome reviewers have mentioned their unhappiness at being charged the $20/day facilities fee. Personally, I think the hotel should just add that fee to the room rate, in the interest of transparent pricing. Tacking on hidden fees is never a boon to customer relations. That said, adding on an extra $20 to the room rate still made for very good value in our case. In effect, we were paying only $149/night for an extremely spacious, comfortable, well-appointed room, as well as excellent service, and we consider that a bargain. We'd happily return to the Avalon on future NYC visits, especially if we can find similarly good deals.", "external_links": [], "published": "2017-03-01T02:00:00.000+02:00", "crawled": "2017-03-29T15:58:25.660+03:00", "highlightTitle": ""}