{"organizations": [], "uuid": "b2e053098188141cf20e404684b729fa4712a801", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/23/78/44/rome-times-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d3964772-Reviews-Rome_Times_Hotel-Rome_Lazio.html", "section_title": "Rome Times Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d3964772-r469999324-Rome_Times_Hotel-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Highly recommended hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Highly recommended hotel - Review of Rome Times Hotel, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "b2e053098188141cf20e404684b729fa4712a801"}, "author": "Steve R", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d3964772-r469999324-Rome_Times_Hotel-Rome_Lazio.html", "ord_in_thread": 0, "title": "Highly recommended hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This hotel is right in the centre of Rome making sights in any direction easily accessible on foot. The hotel itself was extremely clean and well decorated. Staff on reception were very friendly and helpful. On check-in we were told we had been upgraded to executive suite from the classic, which was a welcome surprise. We were a little surprised that our room was actually in a different building area to the reception (there is a block of rooms three or four doors up the street) and were certainly glad it wasn't raining!\nThe room itself, again, was clean and well decorated in a contemporary style. The bed (super king size) was very comfortable. The room was even installed with a bidet, which you don't often come across. Mini bar was stocked with water, juice and a selection of snacks, which is provided completely free of charge for the first stocking. Only complaint about the room was that the air con controller didn't appear to change the temperature so the room was a little warm. Not a sufficient complaint to take to staff though.\nBreakfast was fantastic with a great selection of fruits, vegetables, cold meats, cheeses, cereals, yoghurts as well as cooked bacon, sausage and eggs.\nBar staff and waiters were extremely attentive and the service they provided was faultless, providing recommendations to local eateries (as opposed to the local tourist traps). The menu for the evening was very limited with only one or two dishes available, so eating in the hotel is probably not something one would do every night. However, the mixed hors d'oeuvres that were provided with drinks were great and were different each evening.\nOverall I would highly recommend a stay in this hotel and if I was to visit Rome again, I would definitely stay here.", "external_links": [], "published": "2017-03-25T03:00:00.000+03:00", "crawled": "2017-03-28T02:34:53.283+03:00", "highlightTitle": ""}