{"organizations": [], "uuid": "c64636545547c99cd7bb83447dec8cb8ad664eba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/2e/8d/c5/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g48080-d5523553-Reviews-The_Paper_Factory_Hotel-Long_Island_City_Queens_New_York.html", "section_title": "The Paper Factory Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Long Island City, New York) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g48080-d5523553-r467720382-The_Paper_Factory_Hotel-Long_Island_City_Queens_New_York.html", "country": "US", "domain_rank": 189, "title": "Pretty good hotel. Needs some small fixes", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Pretty good hotel. Needs some small fixes - Review of The Paper Factory Hotel, Long Island City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 1, "uuid": "c64636545547c99cd7bb83447dec8cb8ad664eba"}, "author": "alislaughterbeck", "url": "https://www.tripadvisor.com/ShowUserReviews-g48080-d5523553-r467720382-The_Paper_Factory_Hotel-Long_Island_City_Queens_New_York.html", "ord_in_thread": 0, "title": "Pretty good hotel. Needs some small fixes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed here for a total of seven days. The hotel is beautiful and has a very nice decor, the restaurant is good but expect to spend money on that good food. Front desk staff is very kind and helpful when you need information / help.\nI stayed in a Queen room. Very nice and comfortable easy temperature control and the view was spectacular. Only some minor downsides to my stay, first and foremost I didn't need to set an alarm because it was a given that everyday at 10:30 am I was awoken by housekeeping opening and slamming drawers in the rooms next to mine & it wasn't just one or two it was every drawer in the room. Which if you're a morning person no biggie for you.\nSecondly the shower felt great! Water was awesome. However due to the poor design of the shower if you didn't turn the water on then position the curtain correctly the shower would literally spray out onto the floor creating a mess. (Even then had to stand a moment to make sure the curtain was wet enough not to blow past the threshold and create a puddle) When housekeeping came to clean it up(it had leaked into the hall and I hadn't noticed) he tells me not to turn the shower on all the way. Which was ridiculous considering it's a single turn shower from cold to hot. SORRY not taking cold showers because you can't figure it out.\nThirdly was the cable which if you aren't much of a tv watcher no biggie. However the channels are pretty much limited to sports or news. You get a few bigger ones like ABC/Fox/NBC/&CBS. But for paying $140 a night I expected more variety or movies. (I know you're thinking why would you need this in NYC - when you get snowed in for a blizzard it's a thing. ) I went around this by going to Best Buy and getting a Roku.\nI would definitely be willing to stay here again. I will add that housekeeping needs to spot clean, by this I mean you find stuff splattered on walls, doors etc.", "external_links": [], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-30T23:26:57.217+03:00", "highlightTitle": ""}