{"organizations": [], "uuid": "1a4943d33e23d0db466d7b412a9877567867f613", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/f8/47/dd/golden-tulip-little-palace.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d228719-Reviews-Little_Palace_Hotel-Paris_Ile_de_France.html", "section_title": "Little Palace Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d228719-r470679672-Little_Palace_Hotel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Perfect", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Perfect - Review of Little Palace Hotel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "1a4943d33e23d0db466d7b412a9877567867f613"}, "author": "FrancescaBakes", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d228719-r470679672-Little_Palace_Hotel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Perfect", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed here with my boyfriend for 4 nights this week in late March for a holiday in Paris. The hotel is in a good location; it is under a 15 minute walk away from the huge train station and shopping mall Chatelet de Halles, which is a 40 minute train journey to Disneyland. There is also a metro station under 1 minute away opposite the entrance, in front of a lovely little restaurant. The hotel is also 25 minute walk, 10 minute drive, away from the Roissybus stop (and a 40 minute drive away from CDG airport). The Louvre is around 25 minutes walk away, and the Eiffel Tower around 1 hour away. Upon arrival, the staff were really welcoming and friendly. Throughout our stay, the receptionists and bar/breakfast staff were really warm, helpful and friendly, which improved our experience. The house keeping staff were also really good, keeping our room spotless throughout our stay. As for the room, we had a standard double room, which was spacious and a really lovely, modern design. We had a bathroom with a shower, toilet, 3 large mirrors and a smaller magnified mirror by the sink; a TV with over 30 channels; a balcony with a lovely view of the park on the third floor; a large and VERY comfortable double bed (which was great as I usually struggle to sleep well when on holiday) and a mini bar, large mirror, desk and wardrobe. They serve breakfast in the morning until 10:30pm for €15, which we used once on our last day before we left for the airport just because the price was quite high, however we really enjoyed the food and found that there was a large range of things to choose from. The staff at reception will give you a map upon arrival and offer advice and guidance if you need it. The bar is around €4-€6 depending on the drink you get, which is around the same/cheaper than those in the city. The only negative thing I have to say is that the walls are fairly thin, so if you have loud neighbours talking loudly/shouting you will hear them. We loved our stay in this hotel; it was a beautiful, modern design and the staff were brilliant. It really tied together our experience in Paris! I would return here in the future and definitely recommend staying here.", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-28T12:47:09.612+03:00", "highlightTitle": ""}