{"organizations": [], "uuid": "6bffbd775b20343310624852278b8fb4022cdd80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/a1/27/cd/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93390-Reviews-or10-Hotel_Belleclaire-New_York_City_New_York.html", "section_title": "Hotel Belleclaire - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93390-r468571748-Hotel_Belleclaire-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Would stay again", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Would stay again - Review of Hotel Belleclaire, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "6bffbd775b20343310624852278b8fb4022cdd80"}, "author": "soff01", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93390-r468571748-Hotel_Belleclaire-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Would stay again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I've stayed in other hotels in this neighbourhood and this was by far the more comfortable and friendly. I would definitely stay again. The staff were friendly and helpful, the lobby is inviting, and I had an enjoyable visit.\nMy real only issue was the heating. The room did not have air conditioning and the windows are high and need opening by staff. But with the window open you get fumes and noise. With it shut is unbearably hot. I had to get someone to come adjust the heater two nights. They showed me the off but the thermostat didn't work and the off setting made it go as hot as it could. It was very uncomfortable so I didn't sleep well a number of nights. In the end I had the window partially opened rather than the heat. I did let the front desk know of these issues.\nSome other guests were not considerate, arriving back in the middle night so drunk they were yelling int he corridor and banging walls. But this was not the fault of the hotel. I thought I might have gotten an upgrade for the amount of nights I stayed and would be interested seeing the they room types. The room is small but perfectly adequate however not enough storage room and no drawers to put clothes in (hanging room in cupboard but no room for suitcase). Complementary tea and hot chocolate in the afternoon and evenings - would have been good to be told at check in, and would be good to add coffee.\nOverall, comfortable, well priced, well located, and I'd recommend it over many other hotels but maybe not in the summer given no air conditioning.", "external_links": [], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-29T07:16:02.627+03:00", "highlightTitle": ""}