{"organizations": [], "uuid": "a3d604c1992d375cdba957c9c53d39099e333690", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/ea/bc/10/hotel-oceania.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d292894-Reviews-Hotel_Oceania-Rome_Lazio.html", "section_title": "Hotel Oceania - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d292894-r470989402-Hotel_Oceania-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Great Hotel & Location!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great Hotel & Location! - Review of Hotel Oceania, Rome, Italy - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "a3d604c1992d375cdba957c9c53d39099e333690"}, "author": "Wuggi91", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d292894-r470989402-Hotel_Oceania-Rome_Lazio.html", "ord_in_thread": 0, "title": "Great Hotel & Location!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "his was my second trip staying at hotel oceania. The lovely staff really helped and made our stay extra comfortable and great! Keira was very helpful while we checked in and throughout our entire stay here! She suggested a restaurant Ristorante da Giovanni that we greatly enjoyed, and also recommend. We were given glasses for our champagne when they saw us bring bottles back to the hotel. On our last day, we were traveling by train to Florence and were booking thru an app. You had to print the ticket out, which in the end didn't work on our end with our credit card, but they were nicely willing to print them for us, if it had while we continued to eat our breakfast. The service was really great overall!!\nThe building is a church on the bottom floor, another hotel is above Oceania. They do have an old elevator that will fit you and your luggage tightly. The keys to your room are real keys, and they request you leave these with them every time you leave, and pick them back up upon returning. We really don't mind this as we don't have to keep up with it while we're out and about!\nWe had a problem at the beginning of our stay with the safe and fridge not working. We arrived around 10pm and they were fixed during the next day while we were out sightseeing, ready to go by the time we got back to the hotel. The safe is small, not quite big enough for a regular sized tablet, but big enough for money and passports and other small important things of that size.\nThe only thing we don't love about the hotel are their towels, to say they're thin is an understatement, so just request extra. As we also did for the pillows. This towels are really the only thing I wish they'd change and improve on, my husband really disliked them!\nWe came back early evening each day and opened the window so the room would cool to our liking for the night. We slept with the window open, there is some road noise but it really didn't bother us. You can shut the shudders and keep the window open, this probably helps a little with noise and definitely with the light. There is air conditioning, but it didn't quite keep it as cool as we'd have liked, so the window was a perfect solution for us!\nBreakfast consists of an assortment of fresh pastries, fresh fruit, breads/loafs and jams, cereal, and coffee or tea made to order. Juice and water are also served. One morning we left extra early, I believe breakfast starts at 745, and we were leaving at 7. They nicely brought us our requested breakfast to our room that we were able to request the night before. We had fresh croissants and juice delivered on the dot at 630. This was great and totally unexpected!\nWe took a shared shuttle van from FCO to the hotel. This was really easy and about €20 each. The drivers are standing there when you come out with your luggage looking for people to take into the city, we felt totally safe this was the second time I got into the city this way. The shuttle holds 8 people, plus the driver and luggage. It was super easy we were literally dropped off at the hotel door, if not you can take the train from the airport to Roma Termini which is 30+ minutes, but it does stop running around 11:30 PM and might not be the safest place if you're traveling alone. The Rome hotel city charge is €4 per person, per day, to be paid in cash upon departure.\nOverall, it's a great hotel. It's safe and very clean, very low noise. We would definitely come again. You're a nice 10-15 minute walk to the colosseum and Trevvi and there are restaurants and grocery stores even closer.\nRoom Tip: The rooms in the area near the breakfast room and reception area seem to be larger See more room tips See all photos", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-28T03:00:00.000+03:00", "crawled": "2017-03-29T21:10:10.355+03:00", "highlightTitle": ""}