{"organizations": [], "uuid": "a5a5967d46af8b95e742fe466736bdea4ec270d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/82/38/58/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d233528-Reviews-or10-Novotel_Paris_Centre_Tour_Eiffel-Paris_Ile_de_France.html", "section_title": "Novotel Paris Centre Tour Eiffel - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233528-r465266651-Novotel_Paris_Centre_Tour_Eiffel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Great hotel, great value, perfect for a mini-break", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great hotel, great value, perfect for a mini-break - Review of Novotel Paris Centre Tour Eiffel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-07T02:00:00.000+02:00", "replies_count": 0, "uuid": "a5a5967d46af8b95e742fe466736bdea4ec270d8"}, "author": "Lilo_Lil1000", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233528-r465266651-Novotel_Paris_Centre_Tour_Eiffel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Great hotel, great value, perfect for a mini-break", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There seem to be a lot of mixed reviews for this hotel but for a room at that price, in the centre of Paris, I suspect those leaving bad reviews are being ridiculously picky! We paid £145 each for Eurostar and 2 nights here and I still can't quite believe what we got for that price. I can't recommend this hotel highly enough for a mini-break in Paris.\nNo, this hotel isn't bang on top of the main tourist attractions, but it's 10/15mins stroll from the Eiffel Tower and a very short walk to a number of Metro stops, taking you anywhere you'd like to go in no time at all. (Would recommend getting a book of 10 tickets when you arrive). If you get a Batobuss pass, the river stop is less than 5mins from the front door - jump on for a trip down to the Eiffel Tower, Musee d\"Orsay, Notre Dame or keep going round Notre Dame to key stops on the other side of the river including the Louvre etc. and you'll be killing two birds with one stone, getting a sightseeing tour thrown in! Just be aware that the service is quite spaced apart, so don't do this if you're in a hurry - grab a croissant and coffee for the (potential) wait.\nThe staff at the hotel couldn't have been more helpful (plus they didn't bat an eyelid when we lost our key at 1am!) and the room was ridiculously spacious considering this is Paris. If I wanted to pick holes I could say the grouting in the bathroom was a bit grubby, but that's honestly the only bad thing I can think of and that's hardly a big deal. Overall the room was clean, warm and spacious, the bed was super-comfy and it had everything you'd expect in terms of mini-safe, fridge, tea / coffee-making facilities. We also had an exceptional view, looking straight out on the river (Room 2002).\nThe location isn't the most buzzing when it comes to going out / eating / drinking, but it's Paris! You should be out and about and exploring not looking to live on top of the hotel. Just don't make the same mistake we did and visit the restaurant on the corner a couple of blocks down from the hotel away from the Eiffel Tower (the Eclectic I think) - even for Paris standards these guys were snotty and overpriced! We thought it would be a nice stop for breakfast but €8 for a boiled egg is a bit much and the attitude of the staff was appalling. We didn't stop there long..\nA couple of recommendations - we had brunch and cake at the Le Loir dans la Theiere in La Maris: not too cheap but absolutely amazing and the cake is famous. Be prepared to queue (for a short time) and also to get cosy with your fellow diners! Also Terra Corsa for a meat & cheese board with wine, a short walk from Pigalle (Rue des Martyrs) - absolutely delicious and really friendly service (the owner has a sense of humour!). We also wanted to avoid the tourist trap restaurants around Champs Elysses (your choices here are McDonalds or rip-off brasseries) - we Googled restaurants and found L'Etoile on Trip Advisor, which deserves to be highly recommended as a place to go near the Arc de Triomphe: we paid c.£100 for a decent bottle of red wine, starters, mains (including steak and veal) and sides plus dessert for two. The staff here again were wonderful - friendly, attentive, relaxed and made the evening so much more enjoyable.", "external_links": [], "published": "2017-03-07T02:00:00.000+02:00", "crawled": "2017-03-27T12:08:18.354+03:00", "highlightTitle": ""}