{"organizations": [], "uuid": "7bd8e1b6563f70280ebc62e526dda0fe28afb995", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/8f/0e/8d/6-columbus-a-sixty-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93383-Reviews-6_Columbus_A_SIXTY_Hotel-New_York_City_New_York.html", "section_title": "6 Columbus - A SIXTY Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93383-r469133846-6_Columbus_A_SIXTY_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Can i move in?", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Can i move in? - Review of 6 Columbus - A SIXTY Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 1, "uuid": "7bd8e1b6563f70280ebc62e526dda0fe28afb995"}, "author": "csingh128", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93383-r469133846-6_Columbus_A_SIXTY_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Can i move in?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ive been to 6 columbus twice so far. Back in January 2017 my husband surprised me with Broadway tickets and a night away from the kids by booking a room at this hotel. We had a king deluxe room and it had a private deck. The tub in the bathroom was amazing and the bed was comfy. Last week when wanting to celebrate my 10 year anniversary i decided to call the hotel directly and see what they could offer me. I spoke to a very pleasant guy named Steven, he was very professional and funny. I explained that i wanted to surprise my husband this time and that we were celebrating 10 years of marriage. Steven assured me that he would do his best to make sure it would be one we would never forget. Upon checking in, a nice young lady who's name i cant recall, greeted me and advised me that we were upgraded to the Sixty loft. This is by far the best room they have, its a 2 floor suite and was more like an apartment than a hotel room. It had 2 bathrooms one with a shower stall and toilet and one vanity sink. The upstairs bathroom had a steam shower and double vanity, it was perfect. They have robes and slippers for each guest, a hairdryer, and lots of towels; not much to complain about. If i had to list a negative it would be that the furniture had nicks all over it and that there was no iron or ironing board, also it had recently snowed and no one removed it from the balconies so out of the three balconies i could only utilize one that i was able to force open by pushing the snow away myself, a little bit of an annoyance but nothing worth packing up and leaving over. We ordered room service for breakfast by filling out a card that we left on the door handle and they delivered it at exactly the time we stated on the card. The food was good, basic breakfast; eggs, bacon, potato and toast. It came in a cute bento box and the coffee was good. All in all we definitely enjoyed our stay and will never forget our 10th anniversary. Thank you to Steven for listening and making it happen, to the girl who checked us in for beign so sweet and to Brandon for checking us out with ease and smiles; he was very funny and personable. I would definitely recommend this hotel for the location and proximity to EVERYTHING that NY has to offer and also for its great accommodations and price.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-30T01:00:47.489+03:00", "highlightTitle": ""}