{"organizations": [], "uuid": "ab414e3a4e3f9a0f3f23c02bb033bd63359deff7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/82/39/01/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197424-Reviews-Novotel_Paris_Les_Halles-Paris_Ile_de_France.html", "section_title": "Novotel Paris Les Halles - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197424-r463595396-Novotel_Paris_Les_Halles-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Magnifique", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Magnifique - Review of Novotel Paris Les Halles, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-28T02:00:00.000+02:00", "replies_count": 0, "uuid": "ab414e3a4e3f9a0f3f23c02bb033bd63359deff7"}, "author": "Tenakoe", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197424-r463595396-Novotel_Paris_Les_Halles-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Magnifique", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Great location for first-time visitor to Paris. I took advantage of a 40%-off sale and booked a junior suite on the top floor overlooking La Canopée, which was fantastic. I stayed for a week. Spacious room with views to Sacre Coeur, separate shower and bath and a toilet separate from the bathroom, which is my preference. Another reason why I chose a suite was that it had opening windows.\nThe current construction works around the hotel were not a problem. Good dining and shopping nearby and self-service laundries too if needed. Short walk to Le Marais. Great fruit shop a street away, as is a mini-supermarket.\nAt breakfast one day, after returning to my table from getting another coffee, I found that my table had been cleared - staff had obviously thought I had left. As I say back down, one of the wait staff said to another (in French) \"Oh, he hadn't finished\". It would have been good if they had quickly got another place mat and cutlery for me instead of not acknowledging what had happened. Maybe they thought I spoke no English. One of the supervisors saw my empty table and quickly got me a new place setting. I have stayed at other Novotels where they have a card on the table that has a different colour on each side. It asks guests to turn the card over when finished eating so that staff know when a table is no longer needed. In a busy restaurant I think it works well.\nSpecial thanks to Marjorie of Guest Relations for calling a couple of days before my arrival to check if there was anything in particular I needed in my room and whether she could arrange transport from the airport for me. She also said she would arrange an early check-in for me, as I arrived in the early morning. Marjorie was at the front desk upon arrival, so I was able to thank her in person.\nGratitude also to friendly Benjamin the bagagiste, for his dining hints and help with luggage upon arrival and departure. Top notch service with a smile.\nSpecial mention of Myung Ok at the front desk for her help upon checkout.\nI would stay there again.", "external_links": [], "published": "2017-02-28T02:00:00.000+02:00", "crawled": "2017-03-27T04:43:30.956+03:00", "highlightTitle": ""}