{"organizations": [], "uuid": "67b8207100d5afd0feaa06a64c8a0080c51b51b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/7e/77/a3/reception.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d1875252-Reviews-Art_Hotel_Batignolles-Paris_Ile_de_France.html", "section_title": "Art Hotel Batignolles - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1875252-r468018743-Art_Hotel_Batignolles-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "3 DAYS IN PARIS", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "3 DAYS IN PARIS - Review of Art Hotel Batignolles, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-17T02:00:00.000+02:00", "replies_count": 1, "uuid": "67b8207100d5afd0feaa06a64c8a0080c51b51b9"}, "author": "stephengray588", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1875252-r468018743-Art_Hotel_Batignolles-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "3 DAYS IN PARIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Flew into Charles de Gaulle airport with no plan to get to Paris however the RER B line leaving from terminal 2 and 3 are excellent. About £8 for a single it takes you from the airport to the Gare du Nord in central Paris. Well worth it.\nStayed at the Art Hotel which was about a 40 minute walk from the centre however I enjoyed that as you get to see Paris streets and life. Plenty of bars and restaurants on every street corner. There are also buses and the metro nearby. The hotel was about 15 minute walk from Montmartre.\nBought the \"Paris Pass\" costing £135 per person before going. Depending in how much you do it is reasonable value for money. The two day one gives you a day on the BIG BUS which takes you around all the main sights and has English commentary with free headphones. It also gives you a two day metro ticket which is very useful. Also the ticket gives a free boat ride on the Seine river (however the commentary is very cheesy) so my advice is sit upstairs on the top to get the best views. Lastly the ticket fives free entry to museums and other attractions. Although sometimes the ticket just gives a discount read the documentation carefully. During my trip, using the pass, I went to;\nArc de Triumph\nNotre Dame\nSacre Coure\nLa Louvre\nParis aquarium\nSo along with the boat trip, bus and Metro it is value for money.\nIt does not give free access to the Eiffel tower which costs 7 Euros and a further 5 Euros to go right to the top.\nEating out is actually pretty cheap. I had a three courts meal and a bottle of wine for about £25.00 in Montmartre.\nLoads of restaurants have happy hours between about 1700-2100hrs which means you can get a beer or wine for about £4.50.\nThe hotel I stayed in was clean and nice. Staff were very helpful and you can breakfast there for about 10 Euros however I wanted breakfast in the cafés as the coffee was excellent. Coffee and a breakfast would be about 10 Euros.\nYou do not get any hassle from restaurateurs or vendors when walking down the street.\nThe only time you are approached is by Eastern Europeans or other person asking you to complete surveys or buy trinkets. Do not do it. It is a scam. Outside the Louvre the police arrived and they all ran away. It is more likely that they are pick pockets working in teams and trying to get your attention. The usual amount of personal safety is required on the Metro and walking around. There are plenty of police and at no point did I feel unsafe.\nParis is very much a \"take it at your own pace\" kind of city. If you want to go to all the museums and activities then the \"Paris pass\" is a must however if coffee in the lovely and many parks is more your thing then there are plenty of places to do that too.", "external_links": [], "published": "2017-03-17T02:00:00.000+02:00", "crawled": "2017-03-28T10:08:10.039+03:00", "highlightTitle": ""}