{"organizations": [], "uuid": "839356913c599996dc64e8f8bc923cf0ca49b2bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/fb/27/72/arlo-nomad-king-skyview.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d10541730-Reviews-or20-Arlo_NoMad-New_York_City_New_York.html", "section_title": "Arlo NoMad - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d10541730-r465399798-Arlo_NoMad-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "The MicroHotel room is here to stay! Modern, efficient, service, design conscious and location.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "The MicroHotel room is here to stay! Modern, efficient, service, design conscious and location. - Review of Arlo NoMad, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-07T02:00:00.000+02:00", "replies_count": 0, "uuid": "839356913c599996dc64e8f8bc923cf0ca49b2bd"}, "author": "SuitcaseLawyer", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d10541730-r465399798-Arlo_NoMad-New_York_City_New_York.html", "ord_in_thread": 0, "title": "The MicroHotel room is here to stay! Modern, efficient, service, design conscious and location.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed in the Arlo Nomad for three nights in February 2017. I stayed in a Queen bed room with a city view. I have stayed in many hotels of all kinds in many places worldwide especially in NYC. What you get in Arlo is a room with everything you may need without excess space. The room may have less floor space but they have a good height. First you enter through a modern reception that is opposite a trendy \"Bodega\" concept that is open 24 hours. It'll sell you everything from a cup of coffee, a soda, to a slice of Massoni Pizza. The reception furniture is a modern mid century revival and it leads you either to a restaurant: Massoni, or to the elevator hallway, it also has a staircase that leads you to two \"studios\" one is a large area with sofas and lounge chairs with a large meeting room table and a library, the other just the large meeting room table and a library, there is also a bar on this floor and an open court that is carefully and tastefully designed.\nThe room itself is a combination full bath and bed area. The bath and toilet area is encased with privacy glass on one side and the sink, a utility stool and a seat stool desk combination on the other side. The shower/bath area is separated from the bed area by a good size hanging closet, that has a safe, and small fridge, and above a large cabinet you can close with a door. The bed virtually covers almost all the space, but it does have a small seating couch on one side, a good size nightstand, a nicely finished headboard. The bed is good, not the best, but it is good. The bedding is euro white, better quality. The TV is a newer model, nice size, and you get most of your desired channels. WiFi is included and it has great reception. You can move the TV as you want with its full motion bracket, and this allows you to connect any HDMI if you want to use your laptop or iPad.\nThings I liked was the service, how nicely appointed the rooms are. The reception and the studios were great and I didn't feel crowded. For an NY visit where you want to be out of the room most of the time. This is a nice place to be.\nNow, for family travel, you have to consider a larger room and the mechanics of the bathroom sounds and privacy glass. If that isn't an issue for you. This is a great place. Though do note that many modern hotels are going this route, even larger ones like the Riu Times Square.\nSome reviews here complain about heat and noise. I adjusted the temperature as I wanted and had no issues. As to noise, the only noise that bothered me were the clocks installed in the headboard. I think a better redesign using a led display should fix this. It's a nice design to have them, but the ticking is loud. As instructed I pulled them out and removed the batteries and no issues. This is a great hotel and I am hoping many more like these spring up elsewhere. I will stay here again if the prices are commensurate enough.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-07T02:00:00.000+02:00", "crawled": "2017-03-31T17:59:11.827+03:00", "highlightTitle": ""}