{"organizations": [], "uuid": "1311d5918b3c9f43a3532b99cd07f5d2cd66d3ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/04/02/7d/7d/iq-hotel-roma.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d1729030-Reviews-or15-IQ_Hotel_Roma-Rome_Lazio.html", "section_title": "iQ Hotel Roma - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d1729030-r466796991-IQ_Hotel_Roma-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Great location, Great Hotel!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great location, Great Hotel! - Review of iQ Hotel Roma, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "1311d5918b3c9f43a3532b99cd07f5d2cd66d3ce"}, "author": "Kelly F", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d1729030-r466796991-IQ_Hotel_Roma-Rome_Lazio.html", "ord_in_thread": 0, "title": "Great location, Great Hotel!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My boyfriend and I really enjoyed our stay at this lovely hotel. It is in a great location, only 10-15 minutes’ walk from the Trevi Fountain and Spanish Steps, and 15 minutes in a different direction to the Colosseum. The main train station, Rome Termini, was also only about 12 minutes’ walk away, very handy if coming into the city via train as we did (the Leonardo Express takes 30 mins from Fiumicino airport). The Vatican is further afield, taking about 55 minutes, but very doable in good weather with comfortable footwear! We ate locally a few times, and everything as delicious.\nThe hotel itself looks very new and neat, possibly recently refurbished, with a bright and airy reception and a secure door: only hotel room keys can open the front door, you have to ring the bell to get in without one. A nice safety feature, though the location was quiet and seemed safe enough, opposite an opera house. A very peaceful location, but only a minute’s walk from a main road with shops and food places.\nAll staff were pleasant and friendly, and spoke excellent English, which we appreciated. The room was great, a good size with a comfortable bed and spacious bathroom. We had a shower cubicle, which was great for us, however if you require a bath I suggest you contact the hotel to ensure this. Bathroom facilities also included towelling slippers, toiletries, vanity set and shower cap.\nThe TV was large (though we barely used it), and we also had a safe, tea and coffee facilities and a fridge in our room. The fridge was stocked with both still and sparkling water, which we could help ourselves to free of charge, which I thought was a very nice touch. Wi-fi was complimentary.\nThere was an ice machine and vending machines available to use, as well as an on-site shop, gym, sauna and living area. In the reception area you could find comfortable seating, toilets and a free, very detailed city map if you need one. The hotel staff are also happy to help you if needed.\nWe did not eat at the hotel as we wanted to experience local eateries, but breakfast was 9 euro.\nI booked directly with the hotel and had no issues or problems. I would definitely recommend this hotel to others, and would happily choose this hotel again for future visits to Rome.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-28T05:46:17.036+03:00", "highlightTitle": ""}