{"organizations": [], "uuid": "099f7b5eb45de1bb531a181efd68a45b45a1b733", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/b3/f3/65/the-chatwal-exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1641016-Reviews-The_Chatwal_A_Luxury_Collection_Hotel_New_York-New_York_City_New_York.html", "section_title": "The Chatwal, A Luxury Collection Hotel, New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1641016-r464585217-The_Chatwal_A_Luxury_Collection_Hotel_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "A perfect getaway spot for romance in the city!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "A perfect getaway spot for romance in the city! - Review of The Chatwal, A Luxury Collection Hotel, New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "099f7b5eb45de1bb531a181efd68a45b45a1b733"}, "author": "Kathleen D", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1641016-r464585217-The_Chatwal_A_Luxury_Collection_Hotel_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "A perfect getaway spot for romance in the city!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you are looking for a luxury hotel with all of the amenities that bring class and romance to a couple's getaway in NYC, and yet doesn't break the bank as much as other options you're looking at, stop your search and book a Deluxe King room at the Chatwal.\nFrom the moment we walked in to the moment we left, the friendly smiles and top notch service was 100% on point.\nMy husband and I live close to the city and used to spend a lot of time there, so we were picky when choosing a midtown spot to stay that would be walking distance from the theatre and other places we wanted to go for our two nights away, and we didn't want to be in the middle of the Times Square craziness. We were taking a break from being parents for a bit, and just wanted to enjoy being spoiled together. We wanted something perfect!\nThe Chatwal did NOT disappoint us! The room was high end, clean (housekeeping did a phenomenal job), and big for the city! The bathroom was AMAZING and a jacuzzi tub just wonderful. Bed super comfy and even the robes were cozy.\nThe only negatives to consider (that still weren't deal breakers for us) were that the walls are obviously very thin in terms of noise from guests next door, and there wasn't much natural light in our room on the 5th floor. However the blackout curtains let us sleep later than we have since our baby was born!\nThe gentlemen handling our car and our bags were just the most friendly guys, and Brandon the chief butler is in love with what he does and it shows!\nWe dined and drank wine in the Lambs Club bar late night and it was phenomenal. Definitely recommend for a classy and low key atmosphere.\nRoom service for breakfast was delicious and prompt! But everything is expensive, so keep that in mind.\nAnytime we asked for something such as a bucket of ice for champagne or help with working our jacuzzi tub drain (silly oversight on our part), it was delivered and handled within 5 minutes with a smile!\nWe have fallen in love with the city all over again and we definitely will be back to The Chatwal soon.", "external_links": [], "published": "2017-03-04T02:00:00.000+02:00", "crawled": "2017-03-30T18:24:10.881+03:00", "highlightTitle": ""}