{"organizations": [], "uuid": "db0b364c2da6f698d0aa12bab431c266163b8fb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/7c/2d/e5/boudoir-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d233582-Reviews-or10-Hotel_De_Buci_by_MH-Paris_Ile_de_France.html", "section_title": "Hotel De Buci by MH - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233582-r464386821-Hotel_De_Buci_by_MH-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Great location, a lovely room, but sleepless nights.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great location, a lovely room, but sleepless nights. - Review of Hotel De Buci by MH, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "db0b364c2da6f698d0aa12bab431c266163b8fb8"}, "author": "ChiCanadian1969", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233582-r464386821-Hotel_De_Buci_by_MH-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Great location, a lovely room, but sleepless nights.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This was our third time in Paris, and the Hotel de Buci was definitely the best Parisian hotel we’ve stayed in so far. That said, there were a few issues that prevent me from giving it a perfect score.\nAbout us: My partner and I have stayed at three-star hotels when we were younger. Now, we mostly stay in four-star hotels and occasionally stay in five-star hotels/resorts.\nRoom: we stayed in a boudoir room, which is their most basic or standard room. It was small, but that is going to be the case no matter where you go in Paris. You are not going to get large hotel room unless you book a suite or stay at a very expensive five-star hotel.\nWhat made us not mind the tiny space was how the room was decorated. The one common mistake our past hotels made is that they tried to copy a minimalist style that really only works in large North American hotel rooms. In a small room, a minimalist style simply looks…spare. Our room at the Hotel de Buci, on the other hand, was decorated in this lush wallpaper and fabric. Even the door to the bathroom was covered in a fabric print. The wallpaper, fabric, lamps, and picture lights made the room feel like a jewel box. You will definitely be in each other’s way, but we didn’t mind. We were able to place our two suitcases in the corner and unpack everything.\nWhen I first entered the bathroom, I thought it might be too small. I had had a really bad experience at our last Parisian hotel. I’m a large guy, and the shower stall was so small that my sides kept smacking against the walls. It looked as if I might have the same issue here, but I didn’t. The shower stall turned out to be quite spacious. The shower had great water pressure, and I loved the rain showerhead. However, there is not a lot of counter space, so you will most likely have to return everything to your toiletry bag after you’re done in order to give your partner room to shave and brush his teeth. I didn’t mind this.\nI should add that the room safe is not laptop compatible despite what their website states. We simply locked our laptops in our luggage, which meant that, for better or worse, we never used our laptops. Moreover, instead of a simple code for the safe, you will need a credit card to lock and unlock it.\nLocation: the location is just marvelous. Because we find the Paris metro easy to navigate, we never cared where we landed in Paris as long as it was in one of the 20 arrondissements. Staying at the Hotel de Buci has definitely changed our minds, however. We really loved being able to walk almost everywhere from the hotel. We didn’t even have to use the metro until our third day there. From now on, we will definitely try to stay in the Saint Germain area. We also noticed that the language barrier was much less of an issue in the Saint Germain area. Every shop person spoke English. (This was not the case when we stayed in Montparnasse, for example.)\nWhat is close by? The Louvre, for example, is just 10 -12 minutes away. You just exit the hotel; turn left; make another left onto Rue de Seine; walk to the Seine; cross the bridge (Pont de Arts) and you’re there. You’re also close to Notre Dame, the Tuileries, and the Musee D’Orsay. Moreover, all our waking tours of the Left Bank and the Latin Quarter had meeting points within walking distance.\nShopping: the famous pharmacy, City Pharma, where beauty professionals go to stock up on French brands, is a five- to seven-minute walk. You just exit the hotel; turn right; walk to Saint Germain Blvd, which has loads of shops; crosse the street and turn onto Rue de Four; and keep walking until you get to the second pharmacy on that block (24 Rue du Four). What I call “pastry row,” the street with all the best pastry and chocolate shops, is only a 15-minute walk. You simple exit the hotel, turn right and walk to Saint Germain Blvd; cross the street; go right; walk to Rue du Bac (this will take about ten minutes); go past Rue de Varenne, and you’ll find Jacques Genin (the famous chocolate shop), Patisserie de Reves (try their six-set of mignons), and Angelina (awesome macarons). If you keep going down Rue du Bac, you’ll find the famous food store, Grand Epicerie (go past Rue de Babylon toward Rue de Sevres). My new favorite shop, The Arty Dandy, is also close by (exit the hotel; go left; turn left onto Rue de Seine; make another left onto Rue Jacob; and make a left onto Rue Furstenberg; and you’re there.)\nMetro: the hotel is also close to two metro stops. Mabillon is the closest one (just exit the hotel; turn right; walk to Saint Germain; cross the street; and there it is). Odeon is a little farther (cross Saint Germain, and go left); you’ll also find a Starbucks there if you want a North American style coffee.\nService: service was inconsistent for a four-star hotel.\nWe received excellent service at check-in and checkout with Sanjay. He was very polished, friendly, and professional. However, after we checked-in, we didn’t see him again until we checked out. This meant we had to deal with the rest of the concierges, and the difference between Sanjay and the other concierges was quite evident—almost stark. I understand that Sanjay’s is the head concierge and that his polished, knowledgeable manner is the product of many years of experience. However, I felt that the younger concierges would have benefitted from more training. One concierge couldn’t even tell us where we could get breakfast nearby. (Turns out the café on the corner a few doors down from the hotel served an omelet breakfast.)\nThere was one very good concierge: a young black woman who was definitely more resourceful than the others. Paris was unseasonably warm, so we had to open the window to cool down the room at night. Unfortunately, our room faced an incredibly noisy street. After two sleepless nights, I finally went to see her. She offered to switch our room the next day to one that faces the courtyard instead of the noisy street. We declined since we didn’t want to spend our last day packing and moving. I realize that this was my fault: I should have talked to her sooner. However, she did manage to get a hold of a fan for us, which really did make our last night more comfortable. The white noise of the fan also partially masked the street noise. She definitely provided four-star service, and I was grateful for her help. Unfortunately, four-star service ended when her shift ended around 6PM.\nThen a receptionist, a Middle Eastern or North African man took over. I realize that this man was probably hired as a receptionist and not as an official concierge, but he needs more training if he is going to maintain the standards of a four-star hotel.\nApparently, he is the only person on staff at night. Therefore, when he takes a break, he has to lock the front doors to the hotel. We are a couple of middle-aged guys on diuretics, so we were not happy when we had to ring three times and wait for ten to fifteen minutes to get into the hotel. It was incredibly uncomfortable. I don’t blame the young man; everyone needs a bathroom break. However, guests shouldn’t be locked out or locked in around nine or ten at night. I realize that this is not a five-star hotel with a large staff, but there needs to be at least two people on staff until midnight so this does not happen.\nWe had another issue with this receptionist on our last night in Paris. As we do when we travel, we have a bottle of champagne to mark the end of our vacation. Unfortunately, he didn’t know that guests could call room service for ice; he didn’t even know the ice machine was broken until he went to check. After that, he had no other ideas. I had to tell him to call the sister hotel, Artus, down the street to see if they had ice. He called and then gave us a bucket and told us to get the ice ourselves. When we came back empty handed because their ice machine was also broken, I was the one who had to tell him to call the restaurant next door for ice. Success. However, it shouldn’t have taken thirty minutes to get ice. Moreover I, as the guest, shouldn’t know how to do his job better than he did. We were not asking him to obtain opera tickets or to get us a reservation at a super trendy restaurant. We just wanted ice, and this proved too much for him.\nIt might be helpful to have a trained concierge on duty until 9 or 10PM.\nOverall, I would definitely consider returning to Hotel de Buci for its great location and its lovely rooms. If I return, I will know to ask for a room facing the courtyard. I will also remember to talk to a concierge before 6PM if I have any concerns or issues.\nRoom Tip: Choose a room facing the courtyard. See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-03T02:00:00.000+02:00", "crawled": "2017-03-27T15:52:25.027+03:00", "highlightTitle": ""}