{"organizations": [], "uuid": "7fd7e82fca5a64145b64b15314652c1767ee171f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/5d/6f/05/melia-paris-la-defense.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g196563-d1456465-Reviews-or10-Melia_Paris_La_Defense-Courbevoie_La_Defense_Hauts_de_Seine_Ile_de_France.html", "section_title": "Melia Paris La Defense - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Courbevoie, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g196563-d1456465-r463724198-Melia_Paris_La_Defense-Courbevoie_La_Defense_Hauts_de_Seine_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Weekend Trip for a couple", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Weekend Trip for a couple - Review of Melia Paris La Defense, Courbevoie, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-01T02:00:00.000+02:00", "replies_count": 1, "uuid": "7fd7e82fca5a64145b64b15314652c1767ee171f"}, "author": "JAMISS", "url": "https://www.tripadvisor.com/ShowUserReviews-g196563-d1456465-r463724198-Melia_Paris_La_Defense-Courbevoie_La_Defense_Hauts_de_Seine_Ile_de_France.html", "ord_in_thread": 0, "title": "Weekend Trip for a couple", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We spent 3 days at the Hotel Melia arriving Friday February 24th and leaving on Sunday 26th 2017.\nAlthough the normal check in time is 14:00 we arrived before 11am but were given a great welcome, and could check in immediately.\nI had booked the stay during their January sale, and had booked a room with the Level package. This gave us a separate check in desk where we were well looked after.\nOur room was excellent, on the 6th floor and it gave us a panoramic room of Paris through 6 windows running the length of one wall - almost floor to ceiling. We had vies across to the Arc de Triomphe and Eiffel Tower. The room was absolutely spotless, with plenty of space, a walk in shower and useful extras like a coffee machine, plasma TV, robes, toiletries and a safe. The mini-bar was well stocked.\nThe rooms are well looked after, and cleaned regularly by very friendly and helpful staff.\nThe breakfast/dining room was busy, but offered quality food, and there were 4 fast lifts and a restaurant offering meals advertised with 'Real Food'.\nThe use of the Level lounge meant that we had access to breakfast (hot or cold), many juices, beers and wines, plus various snacks which varied at different times during the day. I would recommend either booking the Level Lounge or upgrading when you arrive. All the staff in the hotel were very friendly and helpful, with a special mention to Grecia & Andrea.\nThere is a bar on the top floor of the hotel offering the same view as our room with all drinks you would expect including cocktails, although at 12 Euros, for a large beer, I found it quite expensive, around double that of nearby bars.\nThe hotel is is a superb location, with a Metro station 50 meters away at the front which can take you to all the Paris central attractions within 30 minutes or so.\nThere are also shops, restaurants and bars within a 5 minutes walk over the Pont de Neuilly bridge.\nIf you are looking for an excellent hotel in a convenient location in Paris, then I would definitely recommend the Hotel Melia, at La Defense, especially if you book at the frequently reduced rates.\nRoom Tip: Rooms with panoramic city views are available. See more room tips", "external_links": [], "published": "2017-03-01T02:00:00.000+02:00", "crawled": "2017-03-30T23:52:47.805+03:00", "highlightTitle": ""}