{"organizations": [], "uuid": "5d56734a8c7dc9d01bfaa871156561ad264db98d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/d7/73/ab/appart-city-confort-paris.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d1395633-Reviews-Appart_City_Confort_Paris_Grande_Bibliotheque-Paris_Ile_de_France.html", "section_title": "Appart'City Confort Paris Grande Bibliotheque - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1395633-r470609286-Appart_City_Confort_Paris_Grande_Bibliotheque-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Affordable place that will meet most basic needs", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Affordable place that will meet most basic needs - Review of Appart'City Confort Paris Grande Bibliotheque, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 1, "uuid": "5d56734a8c7dc9d01bfaa871156561ad264db98d"}, "author": "Andrew S", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1395633-r470609286-Appart_City_Confort_Paris_Grande_Bibliotheque-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Affordable place that will meet most basic needs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed here for 5 days while I attended an academic conference and a couple days of sightseeing. The room is small (I think it was the one-bedroom suite) but a pretty good deal for the price. Included a desk, safe, and kitchenette with sink, min-fridge, and hotplate, which I made use of, as I wanted to cut down on food costs as much as possible. The room was cleaned each day and towels were replaced. They do not have a typical American coffeemaker. Instead, they give you a French single-serve variety that I think only made pre-packaged \"pods\" like a Kurig machine (though I didn't check into it enough to be sure). They also give you a pot/kettle for heating water. The closets are small - got one in the bedroom for hanging clothes, one near the door with shelves and the safe. Very tight but worked for me. Plenty of outlets and lights - though of course, make sure you have the France adapter if traveling from outside France.\nI only have two small complaints about the room: the door seemed to stick a lot - I often had to slide my card several times, and push hard with my shoulder, to open it. The shower is also a bit treacherous - raised off the ground, with only a pane of glass on half the length of the tub, without anything else to hold on to, so stepping out is a bit tricky. Maybe this is the style in France, I don't know, but it doesn't seem all that safe.\nThe staff were all very courteous. Most spoke good English, though some were more fluent than others. But I got plenty of patient, helpful advice about where to go to eat, get groceries, shop, etc. They even called a taxi for me to the airport when I left, since my phone didn't work. I had a lot of snags in my travels, but they helped to alleviate some of the stress.\nI did not take advantage of the breakfast, which you have to pay for, but they offer two options, small for 5 euros and buffet for 15 euros. I'm used to \"continental breakfasts\" here in the U.S. which are typically included (free), but it's nice that they at least offer the option. There's also a vending machine in the lobby with soda and snack food, which you must use euros for (no American cash or credit cards). Would have been nice if the machine took credit cards, as I never bothered to exchange money (you won't need cash for most things except giving tips).\nLocation-wise, it's close to the train station (Bibliotheque Francois Mitterand) where you can get the Metro and RER, and there are bus stops all along Avenue de France. Plenty of nearby restaurants and shops, including banks and grocery stories. The big sights aren't within walking distance, unless you don't mind walking an hour or more, so you'll need to rely on taxi (expensive) or train/bus (very affordable), sometimes requiring a transfer from one line to another, but taking no more than 10-15 minutes, 20 at the outside, for places such as Notre Dame, the Louvre, and the Catacombs. Not much to see within the area itself, other than the Bibliotheque Nationale (which I avoided on the advice of other Parisians), but that means it's less congested, though there were still plenty of people out and about.\nIn short, this was a decent deal with friendly staff, and a location that is a bit quieter and out of the way, though not too far from most things, so a good choice if you don't need something fancy.\nRoom Tip: If you have mobility issues, you may want to inquire about bathroom accessibility. See more room tips", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-29T19:58:00.404+03:00", "highlightTitle": ""}