{"organizations": [], "uuid": "20d4e5e0c5598f50c3f6ed4937c8d65774f6ae75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/b2/bd/b7/hyatt-place-entrance.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d2554351-Reviews-Hyatt_Place_New_York_Midtown_South-New_York_City_New_York.html", "section_title": "Hyatt Place New York Midtown South - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d2554351-r467362473-Hyatt_Place_New_York_Midtown_South-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great Hotel, Superior Staff Members", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Great Hotel, Superior Staff Members - Review of Hyatt Place New York Midtown South, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 1, "uuid": "20d4e5e0c5598f50c3f6ed4937c8d65774f6ae75"}, "author": "Leigherton H", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d2554351-r467362473-Hyatt_Place_New_York_Midtown_South-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great Hotel, Superior Staff Members", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I was a guest of the Hyatt Place NY/Midtown hotel for three nights and my experience was first class from beginning to end.\nI was sent an email from Mr. Weiss a few days prior to my arrival outlining some of the hotel's amenities and locale items. I have only had this type of pre-welcome care a few times. Once in London, Beverly Hills and San Francisco. I think it sets the tone for a great stay!\nThe evening prior, I called just to confirm my arrival time and spoke with Jonathan, who was super kind and helpful!\nUpon arrival, Sandor checked me in. He was the ultimate professional, so great and really made me feel very welcomed after my long day of travel.\nHe gave me an amazing room! No. 1101. It was so clean, (thank you Housekeeping!) very quiet and a view of the top of the Empire State Building. I was blown away! The room was equipped beautifully but the thing I liked was that the shower doors slid sideways so you could start the water without being splashed.\nEvery morning there was a great complimentary breakfast! I met a wonderful lady, Jemima, who was very kind and welcoming. Mario and Maritza were super helpful and worked hard to set the food up and any help I needed!\nThe hotel is in a great location. Close to Herald Square and lots of areas to explore. In my comings and goings, I met other front desk staff who were friendly and kind and also met David, who is super and amazing!\nWhen I had to leave to get to the airport, Andrea at the Front Desk checked me out. She was wonderful and asked how may stay was. I told her it was amazing!\nSo to the Management if the Hyatt Place New York/Midway Hotel, I say Thank you!\nYour staff: Mr. Weiss, Jonathan, Sandor, Housekeeping, Jemima, Mario, Maritza, David and Andrea are First Class!\nI hope to return soon to your hotel!\nThank you again! Lisa H. Florida", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-29T06:42:34.060+03:00", "highlightTitle": ""}