{"organizations": [], "uuid": "5e13278e128371fc9ecfc1e391b9452451836137", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/c0/64/6f/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d199157-Reviews-Novotel_London_Tower_Bridge-London_England.html", "section_title": "Novotel London Tower Bridge - UPDATED 2017 Hotel Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d199157-r468839349-Novotel_London_Tower_Bridge-London_England.html", "country": "US", "domain_rank": 189, "title": "Beautiful modern hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Beautiful modern hotel - Review of Novotel London Tower Bridge, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 1, "uuid": "5e13278e128371fc9ecfc1e391b9452451836137"}, "author": "Beckethski", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d199157-r468839349-Novotel_London_Tower_Bridge-London_England.html", "ord_in_thread": 0, "title": "Beautiful modern hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed the weekend before Christmas - and the hotel was beautifully lit up with Christmas lights when we arrived. A two minute walk away from the Tower Bridge underground station, it was the perfect base for exploring London. On arrival we were greeted by a lady with a tablet who informed us that she was upgrading our room. The lifts are VERY small. We saw a person in a motorised wheelchair struggle to fit into the lift, and eventually manage to get in whilst banging the entire lift interior as they did.\nOur room was beautiful. There was a snowy fox scene painted on the wall above our bed which was the perfect touch to a Christmas break. The bathroom 'area' was very peculiar. The shower was built behind a see through mirror. There was also a see through mirror facing the bed in front of the shower. You can't see through it unless you look really closely, but I'd feel really uncomfortable about this if I were travelling with anyone other than my partner. The shower cubicle itself was enormous and there were two showers in there. The products provided were gorgeous and included soap, body lotion, shampoo, shower gel, and even conditioner!\nThe light up mirror, which I can only assume is for doing makeup, was located in a very odd position behind the sink, which was stuck out of the wall, lengthways to the mirror, so it was actually inaccessible. This was extremely irritating when trying to apply makeup, as the only other options were the shaving mirror, which I was too small to look in, or the see through mirror, where my face vanished if I got too close and was replace by the unhappy face of my partner trying to take a shower in private. I am grateful that the toilet had its own room.\nDuring our stay there were works being undertaken in the hotel. I have zero problem with this, work has to be done sometime. However, the TV volume would not go any higher than a barely audible volume, which hard enough to hear at any time, was impossible to hear whenever drilling was also taking place.\nThere was a fridge in the room, which was great as we were able to stock up on juice and snacks. We didn't try the bar or restaurant, but it looked nice, and there was great music playing most of the time.\nAfter we checked out the hotel was kind enough to store our luggage until we were ready to leave - which meant we could spend a few more hours exploring before heading home. Picking it up was a breeze - we were in and out within minutes.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-31T20:52:35.310+03:00", "highlightTitle": ""}