{"organizations": [], "uuid": "30ab4b18d454bcf7fcf89aa3fd82c384eb7c33bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/89/3a/cd/even-hotel-times-square.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d7778097-Reviews-or10-EVEN_Hotel_Times_Square_South-New_York_City_New_York.html", "section_title": "EVEN Hotel Times Square South - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d7778097-r467894365-EVEN_Hotel_Times_Square_South-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great clean find, helpful and welcoming staff!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Great clean find, helpful and welcoming staff! - Review of EVEN Hotel Times Square South, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-16T02:00:00.000+02:00", "replies_count": 1, "uuid": "30ab4b18d454bcf7fcf89aa3fd82c384eb7c33bb"}, "author": "LilianaC913", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d7778097-r467894365-EVEN_Hotel_Times_Square_South-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great clean find, helpful and welcoming staff!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I am so glad that I found this hotel...it was reasonably priced...it was extremely clean and orderly. The location was great - close to the action, but not in the heart of it. There are 4 subway entrances less than 100 feet away (if you're comfortable using the subway, which I personally wasn't, but I digress...). I will say that the immediate surroundings are not exactly \"beautiful\"...there are several buildings that appear to be completely empty or under construction, and there is a free clinic nearby, so there was usually a cast of characters around the weekday mornings, but no one ever bothered us. Everyone kept to themselves and we never felt unsafe - which is key. 3 buildings to the west there is a NYPD building - so there's also that. More importantly, halfway down the block towards 7th Ave, there are the most amazing bagels that I ever had in my life. I'm dreaming of them now as I type (Best Bagel and Coffee - go there! It will look busy, but it will move quickly!) Do it! The hotel is also just a few blocks from the Empire State Building and less than 1 block from Madison Square Garden (so a great location if you're in the area for a concert/event). The facilities in this hotel look amazing - we did not use them because we had such a full schedule - but they honestly were impressive. The bed was comfy (not quite a king, but bigger than a queen), the shower was lovely and the pressure was great. We used the coffee maker every morning. We loved the different lights you could switch too in the room too - it was fun to play around with the ambience. Oh - and most importantly - the windows were completely soundproof!!! You will sleep GREAT! :)\nOverall, we were extremely satisfied with our stay and would absolutely stay here again on our next trip to NYC.", "external_links": [], "published": "2017-03-16T02:00:00.000+02:00", "crawled": "2017-03-27T14:39:25.112+03:00", "highlightTitle": ""}