{"organizations": [], "uuid": "8b82dd0a56e1a2b3a6c41c3d511fbe2b7629d507", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/22/88/f6/library-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d224221-Reviews-Library_Hotel_by_Library_Hotel_Collection-New_York_City_New_York.html", "section_title": "Library Hotel by Library Hotel Collection - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d224221-r470802192-Library_Hotel_by_Library_Hotel_Collection-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "My favorite NYC boutique hotel! Perfect for Book Lovers in a Convenient Midtown Location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "My favorite NYC boutique hotel! Perfect for Book Lovers in a Convenient Midtown Location - Review of Library Hotel by Library Hotel Collection, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "8b82dd0a56e1a2b3a6c41c3d511fbe2b7629d507"}, "author": "jknyc2017", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d224221-r470802192-Library_Hotel_by_Library_Hotel_Collection-New_York_City_New_York.html", "ord_in_thread": 0, "title": "My favorite NYC boutique hotel! Perfect for Book Lovers in a Convenient Midtown Location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I recently stayed at the Library Hotel for the fourth time –– It's my favorite boutique NYC hotel! It's located in a fabulous midtown east location (near Times Square, Grand Central Station, Fifth Avenue, main New York Library Branch, Bryant Park, public transportation and more). I have stayed here for business, pleasure, and with family, and always had a wonderful experience during my stay. This unique boutique hotel has books in every room (each room has a 'theme' such as Zoology or Logic) and in the common spaces. Don't miss the complimentary wine & cheese happy hour from 5-8pm on the 2nd floor! There's also a quaint, beautiful roof top bar for an after-dinner drink. There are countless restaurants, coffee shops, and cafes within a few blocks' distance. Enjoy a long(er) stroll south and visit Madison Square Park/Flatiron Building, or head north to Central Park. Public transportation and taxi cabs/Uber are all convenient. On most of my trips here, I haven't seen families traveling with young children at the Library Hotel, but on my most recent solo stay, I had my 1 year old daughter with me, and the staff was quite accommodating in ensuring I had a high chair during the cheese hour, children's books available, and they even upgraded my room to a larger one that offered a roomier floor plan for the baby stroller (the standard rooms, like many NYC boutique hotels, can be quite small). This boutique NYC hotel experience is perfect for those who love books/reading and want a convenient location in midtown at a reasonably-priced hotel.", "external_links": [], "published": "2017-03-28T03:00:00.000+03:00", "crawled": "2017-03-31T19:24:36.386+03:00", "highlightTitle": ""}