{"organizations": [], "uuid": "ae9b9acd926fb235b63e0b3dae0efe4bb8d5e1c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/76/26/51/broadway-maiden-lane.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d7182804-Reviews-Residence_Inn_New_York_Downtown_Manhattan_World_Trade_Center_Area-New_York_City_New_Yor.html", "section_title": "Residence Inn New York Downtown Manhattan/World Trade Center Area - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d7182804-r465407764-Residence_Inn_New_York_Downtown_Manhattan_World_Trade_Center_Area-New_York_City_N.html", "country": "US", "domain_rank": 189, "title": "Best customer service in New York -", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Best customer service in New York - Review of Residence Inn New York Downtown Manhattan/World Trade Center Area, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-07T02:00:00.000+02:00", "replies_count": 0, "uuid": "ae9b9acd926fb235b63e0b3dae0efe4bb8d5e1c8"}, "author": "Alex R", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d7182804-r465407764-Residence_Inn_New_York_Downtown_Manhattan_World_Trade_Center_Area-New_York_City_N.html", "ord_in_thread": 0, "title": "Best customer service in New York -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I first want to stay that I love the hotel from the moment you walk in your greeted by a person downstairs to let you know we have to go to the elevator. When you walk up to the lobby the first person I met was Sasha the at the end of the trip I change your name to and MVP. She gave great customer service and helped us with everything that we needed first of all we came to the hotel early before check-in time so we walked up to the counter and asked her if we can get a room she said that the time we didn't have any rooms available because they were getting clean. But she took down her number and told her she will call us as soon as we had a room available I also told her if we can get a room on the 19th floor the highest room in the hotel. Well she made it happen she calls promptly and told us our room is ready gave us our luggage and were able to start our trip. She also give us some tips on how to get around the city. What I like the most about the hotel is that you have the main to central subway stations right next to hotel one on the right and one on the left Fulton Street is one of the main stations to get around the city. Her manager was very helpful as well we had an issue with the room and ball Sasha and the merger wer so determined to help fix the problem. Breakfast is not a full continental breakfast but it's free so you can't complain it has eggs as waffles sausage and orange juice. By the end of the trip we went to check out and we saw Sasha again she said she will miss us what will we be back as soon as you can save some money to come back her small gestures made our trip amazing thank you to all the stuff. But a big thank you to Sasha or as I know her my MVP", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-07T02:00:00.000+02:00", "crawled": "2017-03-29T05:17:53.746+03:00", "highlightTitle": ""}