{"organizations": [], "uuid": "723b7e8194545d108e3be8aa52309755cbf2b338", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/99/02/39/executive-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93338-Reviews-or10-Hotel_Beacon-New_York_City_New_York.html", "section_title": "Hotel Beacon - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93338-r464991047-Hotel_Beacon-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Stayed 10 nights over Christmas", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Stayed 10 nights over Christmas - Review of Hotel Beacon, New York City, NY - TripAdvisor", "spam_score": 0.002, "site_type": "discussions", "published": "2017-03-06T02:00:00.000+02:00", "replies_count": 0, "uuid": "723b7e8194545d108e3be8aa52309755cbf2b338"}, "author": "58Kes", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93338-r464991047-Hotel_Beacon-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Stayed 10 nights over Christmas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We travelled from Australia as husband and wife with our 19 year old daughter. We booked ten months in advance a two double corner suite and requested the top floor if possible. We were located on the 21st floor with an amazing view and there was so much space it was wonderful. The location of the hotel was excellent, and there was plenty of storage. The bathroom was compact but adequate. We made great use of the kitchenette for our breakfasts and ate out every night except for Christmas night when we stayed in. We shopped at Fairway across the road, and the subway 72 was so close, and also an express stop so that was extremely handy. My issues were with the bed comfort and the noise. The bed type was too soft and and not supportive enough for me, and the linen on the bed was not big enough so that the sheets slid around and so did the very ordinary, stained mattress protector underneath. I complained about the soft mattress, and the mere suggestion of bed boards was not enough, so they found me a new mattress after sleepless nights. This was an improvement of what I had originally had. I found that Wesley at the desk was not understanding of my soft mattress complaints, however Eduardo was genuinely wanting us to be comfortable in every aspect. My daughter slept on the sofa bed. As she did not want to draw attention to herself, she made do by sleeping across it horizontally as it was so terrible. The air unit in our bedroom was terribly noisy with a blasting sound, and it clicked on and of with a loud bang. To overcome this, we had to flick the off switch in the fuse box by the doorway before we went to sleep although it was freezing cold at night. Outside of our bedroom window above the Beacon Theatre, there was an air unit that we could hear turning off and on, however we could not see where the air unit was. We tried for a room change but the rooms we were shown weren't as big or nice, so we stayed put and learned to live with the deficiencies. Overall, it was value for money, however I would not look forward to returning because of the bed comfort and the noise issues. For some travellers, these two issues may not be an issue. Every other aspect of our stay at Hotel Beacon was very good.\nRoom Tip: All windows are double glazed, higher room with view See more room tips", "external_links": [], "published": "2017-03-06T02:00:00.000+02:00", "crawled": "2017-03-30T01:03:20.820+03:00", "highlightTitle": ""}