{"organizations": [], "uuid": "26bfa245fc0da50f7312969cbfb92f6c7be214fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/17/f1/dd/four-points-by-sheraton.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1464151-Reviews-or10-Four_Points_by_Sheraton_Midtown_Times_Square-New_York_City_New_York.html", "section_title": "Four Points by Sheraton Midtown - Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1464151-r464858303-Four_Points_by_Sheraton_Midtown_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "AMAZING SERVICE(seriously, the best)", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "AMAZING SERVICE(seriously, the best) - Review of Four Points by Sheraton Midtown - Times Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 1, "uuid": "26bfa245fc0da50f7312969cbfb92f6c7be214fd"}, "author": "emilygumpper", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1464151-r464858303-Four_Points_by_Sheraton_Midtown_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "AMAZING SERVICE(seriously, the best)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I cannot rave enough about the costumer service that this place offers. Let me start from the beginning:\nI booked my room through Groupon way in advance before my trip. They were offering an affordable price for a trip to New York. The trip was a surprise for my boyfriend we are celebrating our 4 year anniversary.\nTwo nights before my trip I called Groupon for a wrong charge on a previously bought Groupon. The night before my trip my Groupon for my hotel was LOST. I had no email no Groupon no confirmation nothing but the fact that I could see the charge on my card. Something from my previously call made my Groupon disappear.\nGroupon did nothing for me. They wouldn't help in the least they wouldn't refund me and they couldn't find my groupon(that's a whole other story).\nSo I called the hotel and they helped me find my reservation that Groupon put under my middle name ???\nWhen I called the hotel for help was actually so frustrated because I was supposed to be on a bus to NYC and had no idea where I would stay. I was actually in tears when I called the hotel.\nWhen I called sheraton KEVIN R at the front desk calmed me down and completely helped me. He was not frustrated and was extremely patient while I was SO worked up over the whole situation. He should look into a career in therapy if the hospitality does not workout for him.\nWhen I showed up to the hotel KEVIN R was the one who greeted me at the front desk. He just kept saying how important it was for him to make sure the customers come into the hotel happy and leave happy. And let me tell you me and my boyfriend left more than happy!\nThe room was clean and had a great view. The bed was extremely comfortable. The size of the room(we stayed in a king size bed room) was exactly what we needed for our weekend away.\nWhen we got there we had an issue with our door which we called the front desk and they sent the engineer to come and resolved the issue immediately, the door just needed adjustment.\nEvery time we entered or left the hotel someone either greeted us or waived goodbye. Kevin from the front desk made a point to know my name and personally would ask how things were every time we passed which was comforting considering the issues we had with Groupon.\nThe location of the hotel was perfect. It was a 8 minute walk total to Times Square and there's a lot of great places to eat which anyone working at the hotel will recommend (always ask where to get good New York pizza so that you don't get stuck in a tourist trap going to a chain restaurant!)\nThe hotel offers free coverage to the bar next door. When I heard there was a popular bar I was concerned about the cliental, but there was both families and couples staying there.\nI regret to say I did not get to try the food that they serve in their restaurant but that's because we preplanned our trip and reservations.\nMy mother travels often and I have already told her this is where she should stay next time she goes to New York.\nTwo last things I would like to mention.\nOne, the homey feeling this hotel had was awesome and unexpected because of the reputation of the big city. Every morning they had something sweet in the lobby for example they had a basket of apples with a sign that read \"welcome to the big apple! We don't mean to take a bite out of your stay, but something fresh is coming your way!\" They were refereeing to the construction that they were under (which I didn't even know about because it did not effect my stay one bit!)\nTwo, when leaving today, they offer to hold your luggage which you can come pick up later. I know this is usually standard but I really did not expect that kind of amazing service in such a big city!\nI literally made a trip advisor account because of the awesome service. I am telling you to stay here you will not be sorry.", "external_links": [], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-29T14:01:46.292+03:00", "highlightTitle": ""}