{"organizations": [], "uuid": "4cb5be5cf9986b7dfa535bd75288c3902ff2d91b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/03/ef/fc/19/the-nadler-soho.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d4062677-Reviews-or20-The_Nadler_Soho-London_England.html", "section_title": "The Nadler Soho - UPDATED 2017 Hotel Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d4062677-r466595096-The_Nadler_Soho-London_England.html", "country": "US", "domain_rank": 189, "title": "Nadler, Soho, London", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Nadler, Soho, London - Review of The Nadler Soho, London, England - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-12T02:00:00.000+02:00", "replies_count": 1, "uuid": "4cb5be5cf9986b7dfa535bd75288c3902ff2d91b"}, "author": "Jackie J", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d4062677-r466595096-The_Nadler_Soho-London_England.html", "ord_in_thread": 0, "title": "Nadler, Soho, London", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed for 1 night with a party of 5. Had two rooms comprising of a double superior and a family triple. Rooms were on separate floors.\nSuper clean and very modern. The Nadler is situated in the middle of Soho and a short walk (5-10 mins) walk from the central line Tottenham Court Road tube station.\nThe hotel is central to all the Soho nightlife, theatres, restaurants, bars and a Tesco Express only around the corner. Do not think that this makes the hotel noisy to the contrary, the hotel was very quiet and private. Hotel staff were accommodating when making queries.\nFor the room itself was adequately sized, very clean, homely and tastefully decorated. Within the superior room there was a concealed kitchenette area behind a cupboard door. Behind there was a mini sink, Brita water filter tap, Krups/Nespresso coffee machine, Nespresso capsules, microwave, kettle and fridge. Only drawback is that the kitchenette takes up wardrobe space however, for a couple of nights a single wardrobe will be enough.\nGHD hairdryer supplied in the room with an option of hair straighteners available via Reception.\nThe bathroom consisted of a large shower area more in keeping with a wet room where as the triple family room had the bath. Toiletries supplied.\nBeds were comfortable and had lovely throws and crisp white linen. The rooms came with wall installed flat screen tv's and free wifi. The rooms were warm and came with air conditioning.\nThe hotel offers a continental style breakfast when ordered through room service. This service is limited and is subject to additional cost. Given the choice available outside the hotel and options to prepare your own food in the room, breakfast was not an issue for me.\nPrice for the rooms combined came to around £500. Price is average for London.\nOn the whole, a lovely hotel in a great location near to theatres and nightlife.", "external_links": [], "published": "2017-03-12T02:00:00.000+02:00", "crawled": "2017-03-31T07:58:36.699+03:00", "highlightTitle": ""}