{"organizations": [], "uuid": "b7d11d0478a159ce5283f7d8f3b1fed0a4bce93a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/fc/39/9f/chambre-privilege-avec.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d229621-Reviews-or30-Splendid_Etoile_Hotel-Paris_Ile_de_France.html", "section_title": "Splendid Etoile Hotel - UPDATED 2016 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d229621-r426417027-Splendid_Etoile_Hotel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "A truly fantastic Hotel in Wonderful Paris", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "A truly fantastic Hotel in Wonderful Paris - Review of Splendid Etoile Hotel, Paris, France - TripAdvisor", "spam_score": 0.237, "site_type": "discussions", "published": "2017-03-22T02:00:00.000+02:00", "replies_count": 0, "uuid": "b7d11d0478a159ce5283f7d8f3b1fed0a4bce93a"}, "author": "HappyTravellers222", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d229621-r426417027-Splendid_Etoile_Hotel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "A truly fantastic Hotel in Wonderful Paris", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We have stayed at the Splendid Etoile Hotel in wonderful Paris on numerous occasions and we never ever tire of it. We stay in a lovely suite with our two little dogs who are welcomed at the hotel and we and they truly love it.\nThe rooms and bathrooms are truly wonderful, well maintained and very clean. The mini bar fridge is useful to say the least, as is the large digital safe. Wardrobes have automatic inside lighting, which is great for easily finding your clothes. The beds and pillows are so very comfortable and assure a good night's sleep. The room lighting is great, allowing for change of mood. Our adult daughters sofa bed was very good indeed. There is ample storage space within the suite. The air con is wonderful throughout the whole suite - thank goodness.\nFrom our window, we had a lovely balcony and could see directly over the Arc De Triomphe, Champs Élysées and the Eiffel Tower - how fantastic is that?! Boy, what a wonderful view and at night when all lit up it is so magical - unbelievable. Interestingly enough, even though there is all this going on outside, you hardly hear any of it in your room - the glazing is tremendous!\nBreakfasts are truly great, the best without a doubt. The variety of food is wonderful and all so fresh and it is just what you need to set you up for a day sightseeing in wonderful Paris.\nService at the Splendid Etoile is truly excellent. To give you an example - we were missing one cup from our room, one phone call to the Head Concierge Farooq and it brought instantly three people with cups, coffee and anything else we needed. You see that's how guests are valued at this hotel - the customer really does come first.\nWe have never felt or been treat like a number in this wonderful hotel (unlike some hotels who never take the time to chat, have a laugh and put the world to rights). The Splendid Etoile is totally customer focused. I believe that everything emanates from the top and the hotel Director who I met on our recent visit is a really professional pleasant guy - the family who own these hotels are clearly decent people otherwise negativity would pass down to the team within the hotel and it certainly does not do so in any way. This team is totally POSITIVE and focused on ensuring that guests are looked after very well indeed.\nPublic parking and the Metro are literally seconds away from the hotel, which is totally great. As a side issue, don't let anyone put you off driving in Paris - it's great!!\nWe have stayed at 11 hotels during our latest lengthy vacation, 4 star and very good, but NOTHING compares to the Splendid Etoile in Paris. This hotel is just wonderful and we always receive such a wonderful welcome from the team, it's so great to receive this type of genuine warmth from our friends at the Etoile, and that's how it is: friends.\nWe started off our six week vacation here, first for three days, and we then ended it here with a four day stay. As I have said the hotel is wonderful (decor, furnishings etc.) but the one thing that sets this hotel apart from anywhere else we stay is its people.\nThis wonderful team at the Splendid Etoile are so very special, they are up for having fun which we love, and yet they are so very professional - it's like coming to our second home staying here, they are old friends and we always get a really tremendous welcome and are so wonderfully looked after.\nUnusually I am going to mention a few people to give you an idea of the fantastic people at the Etoile:\nFarooq, the Head Concierge, is truly wonderful and a friend, he has done his job for a long time and is fantastic at it, he knows everyone and if you want something just ask Farooq as he will know the answer. He once again booked our little dogs into a nearby vets for their check over prior to returning to the UK - how good is that!! I really like this man, he is a man of his word and I truly value his friendship, he's a great family man as I am - he is simply the best in the business by far!\nYasser on the desk is really excellent, with a great sense of humour. He is really good at his job - I have watched him with guests and he understands people so very well and reads a situation clearly. He's a really good guy, if all hotels had a Yasser they would be so very much better and so much friendlier - quite simply he is a real attribute to the Etoile.\nPaulo the concierge is simply great, he is a really decent guy and I like him. You get the feeling with Paulo that he will sort out any issues - because he will. His massive experience in Parisian hotels really shows through and he has been at the Etoile for many years, he is a really good man.\nIt would be so easy to go on naming people, but the above is simply to give you an idea just how good this team is.\nAt the end of the day all hotels are just buildings, some nice some not so nice, it's the people that really count and the Splendid Etoile really does have the best hotel team I have ever known - and I almost lived in hotels throughout my entire career.\nAt the end of our wonderful stay the usual checkout was fast, professional and really friendly. My wife, daughter and myself simply love this hotel and its people - we will NEVER stay anywhere else when we are in Paris.\nIf you are visiting this wonderful City, then do yourself a massive favour and stay at the Splendid Etoile - you will totally love it.\nWe stayed in suite 508 and it was truly wonderful.\nTo the entire team at the Splendid - thank you so very much once again for our wonderful stay. We will see you again soon!\nRoom Tip: Go for a room overlooking the Arc De Triomphe See more room tips", "external_links": [], "published": "2017-03-22T02:00:00.000+02:00", "crawled": "2017-03-27T06:58:44.803+03:00", "highlightTitle": ""}