{"organizations": [], "uuid": "0e329b999258b84c6475c10477de7d4e8b8a6d5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/64/9c/f2/guestroom.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d6201200-Reviews-The_Lex_NYC-New_York_City_New_York.html", "section_title": "The Lex NYC - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6201200-r467189243-The_Lex_NYC-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Almost perfect modern boutique hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Almost perfect modern boutique hotel - Review of The Lex NYC, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 1, "uuid": "0e329b999258b84c6475c10477de7d4e8b8a6d5e"}, "author": "InfiniteStarla", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6201200-r467189243-The_Lex_NYC-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Almost perfect modern boutique hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I've just got home from spending a week at the Lex. Overall it is a brilliantly located, stylish, clean and modern hotel that I would definitely recommend. Staff are welcoming, pleasant and extremely courteous - I found Rumel and Maurice to be particular nice as they always offered me my favourite black tea on arriving back at the hotel after a chilly day out and about! Having complimentary tea and coffee to be brought to your room is a nice touch. The breakfast was better than I expected - although there isn't huge variety (hot drinks, juice, croissants, mini sweet pastries, two types of muffin, apples, oranges and bananas) what is there is delicious, good quality and plentiful. It set me up for the day and I enjoyed watching the world go by from the comfort of the lobby each morning whilst planning my day. I had a cosy room, and it surpassed my expectations in terms of size, cleanliness and design. Lovely toiletries, spotless, great bath and shower, large extremely comfy bed and a bathroom light that makes sound effects! :-).\nThe reason I have given 4 and not 5 is because firstly the air conditioning is VERY loud and woke me up multiple times most nights, and secondly because on arriving at the Lex I was given room 302, which I had the misfortune to spend one night in. It has an adjoining door (locked, not that it made any difference!) with the next room and I could hear every single word the loud couple said. I asked straight away if I could be moved, and the staff were very understanding but said they were fully booked that night. However I could be moved the next day. So I packed up everything (I had just unpacked!), had a sleepless night listening to the couple make a lot of noise and the next day my bags were moved to a quiet haven known as room 701. Much better! So although this was handled well, as I was a solo traveller staying for a week, it annoyed me that they thought they could put me in an extremely noisy room and get away with it. So beware room 302 - I'm not sure how many other (if any) of the rooms have this issue but don't expect the noise will get better - it won't!\nAll in all though after this bad start my room and stay were faultless, and I would definitely stay again.\nRoom Tip: Avoid room 302 like the plague! See more room tips", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-29T14:08:44.270+03:00", "highlightTitle": ""}