{"organizations": [], "uuid": "1ffbdf252668d36ecb97f60b598d803fed6cf398", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/80/48/ca/hotel-exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d281071-Reviews-or10-Mandarin_Oriental_New_York-New_York_City_New_York.html", "section_title": "Mandarin Oriental, New York - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d281071-r463767372-Mandarin_Oriental_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Spectacular in every way", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Spectacular in every way - Review of Mandarin Oriental, New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-01T02:00:00.000+02:00", "replies_count": 1, "uuid": "1ffbdf252668d36ecb97f60b598d803fed6cf398"}, "author": "J H", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d281071-r463767372-Mandarin_Oriental_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Spectacular in every way", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My wife and I recently stayed at the Mandarin Oriental in NYC as part of our \"mini-moon\" after our wedding.\nEverything about this hotel is spectacular. Checking in was quick and friendly, and the gentleman at the front desk personally brought us to our room. The room overlooked Central Park and Columbus Circle...and since we were on the 53rd floor, we had an amazing view of the city. The decor was elegant, but comfortable and \"home-like,\" with a very comfortable bed and a large flat-screen TV. The bathroom had a shower (with \"normal\" and \"rainfall\" showerheads) and a large tub. There was plenty of closet and drawer space (far more than we needed).\nThe lounge off to the side of the lobby has wonderful views of the city, as well as delicious food, great drinks, and friendly and attentive staff. If you get a couch next to the windows you won't want to leave.\nWe ate breakfast in the restaurant (also on that main lobby floor) and the food was absolutely fantastic. And, of course, the view can't be beat.\nWe spent one morning at the spa...and we could have easily spent the whole day. The staff was friendly, the massages were rejuvenating, the facilities are amazing, and we even saw a celebrity! (Smiles were exchanged, but we were respectful of their privacy.)\nIn terms of location...it's tough to beat the Mandarin: it's right on Columbus Circle, across the street from Central Park, within easy walking distance of Broadway shows (we walked to see a show one night), and if the weather is bad you can spend a few hours walking and shopping in the mall on the first couple of floors of the building. (There are also some fantastic restaurants there.)\nEvery staff member we encountered - from the gentlemen at the front entrance, to the staff in the lounge and restaurant, to the cleaning staff - was exceedingly polite, very friendly and always helpful.\nI've stayed in a lot of nice hotels in NYC, around the country, and around the world, and this was easily one of the best places I've ever stayed. In fact, we are hoping to make this an annual \"anniversary\" trip.\nLet's be honest: Is the Mandarin Oriental expensive? Absolutely.\nIs it worth that expense? Without a doubt.\nIt is - as my review title states - spectacular in every way.\nRoom Tip: Ask for a room with a view of the park See more room tips", "external_links": [], "published": "2017-03-01T02:00:00.000+02:00", "crawled": "2017-03-29T04:05:31.418+03:00", "highlightTitle": ""}