{"organizations": [], "uuid": "881d0efc8016160e89571cae0d10394866e8d7db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/2b/1b/5d/garden.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d188478-Reviews-Number_Sixteen-London_England.html", "section_title": "Number Sixteen - UPDATED 2017 Hotel Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188478-r463807528-Number_Sixteen-London_England.html", "country": "US", "domain_rank": 189, "title": "Like staying in a luxurious private home in South Kensington", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Like staying in a luxurious private home in South Kensington - Review of Number Sixteen, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-01T02:00:00.000+02:00", "replies_count": 1, "uuid": "881d0efc8016160e89571cae0d10394866e8d7db"}, "author": "ninip262", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188478-r463807528-Number_Sixteen-London_England.html", "ord_in_thread": 0, "title": "Like staying in a luxurious private home in South Kensington", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Number Sixteen is so charming and restful that my husband and I, exhausted from jet lag, didn't even bother going out two of the 5 nights we were there, and just had dinner in the casual and very pretty dining room. Then crawled back into our very cosy bed.\nThe hotel is made up of several townhouses put together (one of which is number 16!) It is a Firmdale hotel, so the decorations have that quirky and elegant feeling that all Firmdales have (we've stayed in the Knightsbridge many times, and no two rooms are ever decorated the same way in either hotel.) The hotel was full when we were there but it has a very quiet feeling, with no bustling lobby. There is a lovely sitting room, where you can read the paper or have a drink, or take something from the honor bar, and downstairs a skylit dining room where we had the BEST breakfasts. Lots of choices at the buffet, or you can order a specific breakfast. It seemed to be a very international clientele - different accents and languages at every table. There was one family with young children, but it's not an ideal place for families with kids, because they can't run about much.\nWe were there in January so we didn't use the garden outside the dining room, but it was beautiful even in the winter, and would be a lovely place to sit and have breakfast or tea in warmer weather. This is a residential neighborhood, so it is quiet and the hotel is surrounded by private houses. But very conveniently located two blocks from the South Kensington Tube station.\nThe staff are superb - friendly, accommodating, eager to help.\nNow that we've found this hotel, I will always stay here when I'm in London. I felt as if I lived in London while I was there, in the best of circumstances.\nRoom Tip: A view over the garden is lovely in the winter! In one bedroom the steps were too steep for us, but... See more room tips", "external_links": [], "published": "2017-03-01T02:00:00.000+02:00", "crawled": "2017-03-31T16:31:22.299+03:00", "highlightTitle": ""}