{"organizations": [], "uuid": "6ac8a1233a0a4e1cb5a72a19115a611772dc6505", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/34/1b/bc/hotel-gustave.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d289315-Reviews-Hotel_Gustave-Paris_Ile_de_France.html", "section_title": "Hotel Gustave - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d289315-r457431509-Hotel_Gustave-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Stay at Hotel Gustave during my weekend away in Paris", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Stay at Hotel Gustave during my weekend away in Paris - Review of Hotel Gustave, Paris, France - TripAdvisor", "spam_score": 0.002, "site_type": "discussions", "published": "2017-03-06T02:00:00.000+02:00", "replies_count": 0, "uuid": "6ac8a1233a0a4e1cb5a72a19115a611772dc6505"}, "author": "FirstClass L", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d289315-r457431509-Hotel_Gustave-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Stay at Hotel Gustave during my weekend away in Paris", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A few weeks ago, I went to Paris with one of my best friends, Natasha for a girl’s weekend away to celebrate her birthday. As she hasn’t been to Paris for a while we decided to book Hotel Gustave that is overlooking the Eiffel Tower.\nLocation:\nHotel Gustave is perfectly located on a quiet street just around a corner from the Dupleix metro station. It is served by public transport and located and a short 15 minutes’ walk from the Eiffel Tower. The whole of Paris is within quick and easy reach if you are staying here.\nAtmosphere:\nAs soon as we entered Hotel Gustave, we were welcomed by a friendly receptionist. He was extremely helpful and assisted us with designing of our ‘sightseeing itinerary’. The reception had a beautiful, modern décor and as soon as we entered we could fully immerse ourselves in our luxurious surroundings. In front of reception, there was a large relaxation area, a bar and terrace.\nRooms and Facilities:\nHotel Gustave has a 24-hours reception. During the afternoons, hotel’s in-house bar opens for a ‘honestly bar’ with a vast selection of alcoholic beverages if you fancy a drink or a bit of socialising in the evening. Other services include:\n- a dry-cleaning service\n- a laundry service,\n- room service.\nThis beautiful boutique hotel has only 32 rooms and 6 of these rooms offer spectacular views of the Eiffel Tower. Our room had a modern and chic design. As Hotel Gustave is located closely to the Eiffel Tower the room décor displayed a wonderful picture of that monument that starts above the beds and ends at the ceiling.\nThe room was of a reasonable size and featured a typical Parisian French window offering an exceptional view of the legendary Iron Lady.\nOur king-size bed was extremely comfortable and equipped with an LED flat-screen television, free Wi-Fi, direct telephone line, mini-bar, safe and a bathroom with a shower or bath.\nThe bathroom had a modern, white décor. It was spacious, clean and bright.\nOverall:\nIf you like staying at boutique hotels then you should consider hotel Gustave. It would be perfect for your weekend breaks, business trips or holidays in Paris. It is in the heart of the city, has lovely, modern rooms and all facilities you need while away from home.\nRoom Tip: Ask for a room view Eiffel Tower view See more room tips See all photos", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-06T02:00:00.000+02:00", "crawled": "2017-03-27T07:58:27.654+03:00", "highlightTitle": ""}