{"organizations": [], "uuid": "b7c999c6c3a9587baad14a2213cf44a09b5864f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/70/aa/ff/night-view-exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d289306-Reviews-DoubleTree_by_Hilton_Hotel_London_ExCel-London_England.html", "section_title": "DoubleTree by Hilton Hotel London ExCel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d289306-r471344502-DoubleTree_by_Hilton_Hotel_London_ExCel-London_England.html", "country": "US", "domain_rank": 189, "title": "Convenient for London City Airport", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Convenient for London City Airport - Review of DoubleTree by Hilton Hotel London ExCel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "b7c999c6c3a9587baad14a2213cf44a09b5864f1"}, "author": "paul6111", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d289306-r471344502-DoubleTree_by_Hilton_Hotel_London_ExCel-London_England.html", "ord_in_thread": 0, "title": "Convenient for London City Airport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We arrived at Prince Regent DLR station about 9pm. We could see the hotel from the elevated platform and rang the hotel to find best way on foot. You leave station by right hand exit and walk down a flight of stairs by Excel centre which lead to a car park. You walk through the car park, cross a road, through Double Tree car park and you arrive at reception. The walk only takes a few minutes but the stairs would be difficult for anyone with mobility issues or heavy luggage.\nCheck-in was pleasant and efficient. Our room on Hhonors floor was clean and comfortable, although the bed (a standard double) seemed smaller than in most Hiltons. The bathroom was well equipped with a shower. There was a large tv with good choice of channels, the wifi worked well and as usual there were tea and coffee making facilities.\nThe only downside was the very loud air conditioning which we eventually managed to switch off (set dial to 12 o'clock and press left button then wait for 15 minutes). Had we needed the a/c on a hot night then the noise would have made sleep difficult.\nAs we had a fairly early flight we were one of the first into breakfast at 6 30am. The buffet offered a reasonable choice of hot or cold food and service was pleasant.\nAlthough the hotel claims one can walk to the airport in 15 minutes or so we chose to take a minicab booked through reception at a cost of £10.\nApart from the issue with the a/c our stay was very good, quite up to the usual high standard we have come to expect from Double Tree.", "external_links": [], "published": "2017-03-30T03:00:00.000+03:00", "crawled": "2017-03-31T21:37:16.967+03:00", "highlightTitle": ""}