{"organizations": [], "uuid": "ba4518439dd801f830e0d44db8a5710722cabb15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/8c/6f/ea/deluxe-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d112062-Reviews-or20-The_Time_New_York-New_York_City_New_York.html", "section_title": "The Time New York - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d112062-r460552650-The_Time_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "The Difference A Room Can Make", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "The Difference A Room Can Make - Review of The Time New York, New York City, NY - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-06T02:00:00.000+02:00", "replies_count": 1, "uuid": "ba4518439dd801f830e0d44db8a5710722cabb15"}, "author": "Matt P", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d112062-r460552650-The_Time_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "The Difference A Room Can Make", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For the price, I wasn't sure what to expect here. The photos on The Time New York's website and Instagram account ultimately won me over. I'm so glad they did. The experience started out rocky but ended up to be exceptional. A surprise win in Times Square.\nI was in NY for fun but extended my trip to take care of some work. I had booked two nights in a Superior Suite and was really excited. When I arrived, I was a bit early. The front desk was happy to accommodate the early arrival and quickly showed me to a room on the 5th floor. Great start.\nAs soon as I walked in, though, my stomach sank. The room was a cheap copy of the one on the website. The sleeping area cramped. The bed, sold as a king, was definitely a queen - if not a full. The separate seating area was tiny. Both windows in the room faced cement walls, making the room dim throughout. The carpet was dirty, and the whole placed smelled like mildew. The bathroom and shower had railings, and to top everything off, there was no deadbolt on the front door! There was a spot where it had been, but it was no longer there. There was even a hole that went entirely through the door where the screws had previously been. We're steps from Times Square and there isn't any security between the front door and the rooms. You don't even need to use your key in the elevator. I started questioning what I had gotten myself into.\nBut, I was in New York, the best city in the world and it was a gorgeous day. I told myself to get over it. You win some, you lose some. And the price was such that I knew I was taking a bit of a gamble when I booked it. I went out that afternoon, met up with friends for dinner, had a beautiful time. When I got back to my room, it was such a buzzkill. I really started questioning if I was in the same place I had seen in the photos. I called down to reception to see if there had been a mistake and if they might be able to find me a different room. The gentleman I spoke with that night was really rude. He said, of course they didn't have anything else available. They were totally booked. Fair enough. I should have brought it up as soon as I checked into my room, but there was no need to be rude. He also said that all of the rooms had King beds - that it wasn't possible mine was anything smaller. I was 100% sure the bed was not a king. Whatever.\nThe next morning, after a few work calls, I went down to reception. I figured I didn't have anything to lose by asking again about another room. Luckily, it was not the guy from the night before. This new receptionist was incredibly kind and apologized for any confusion. She found me a room on the 8th floor and had my things moved. When I walked into this second room, the difference was night and day. This room was exactly what I had imagined only better. There was generous space, the views great and lighting 10x better. The layout and design elements were completely on point. THIS was the room I had drooled over scrolling through the website.\nBesides being in love with my new room, the receptionist on night two helped me out with access to the nearby Equinox gym. They offer complimentary passes for guests at The Time New York, which is a great perk since the hotel doesn't have a gym. Oh, and, the Maison Marghella toiletries in the rooms are probably my favorite of all time. Their \"Brooklyn\" scent, designed for the hotel, is amazing. It encapsulates New York in my opinion. I still use the lotion from that stay sparingly, trying to make it last as long as possible.\nAt checkout, I shared my whole experience with the manager who happened to be at the front desk. I focussed on the positive. Told him how grateful I was for the switch in rooms. He was very gracious, apologized for the mistake and said next time I'm booking a stay to be sure to reach out to him directly if I had any questions. By the time I left The Time New York, I was on cloud nine. The first room a distant, fading memory. The second room, one I will recall fondly again and again.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-06T02:00:00.000+02:00", "crawled": "2017-03-30T18:13:11.192+03:00", "highlightTitle": ""}