{"organizations": [], "uuid": "ae73738ad8c5cb06279e8468605d54e8edf1a20a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/39/42/f1/facade-rue-saint-lazare.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d207718-Reviews-or20-Hilton_Paris_Opera-Paris_Ile_de_France.html", "section_title": "Hilton Paris Opera - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207718-r466293148-Hilton_Paris_Opera-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Great Location, Staff and Stay", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Great Location, Staff and Stay - Review of Hilton Paris Opera, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-11T02:00:00.000+02:00", "replies_count": 1, "uuid": "ae73738ad8c5cb06279e8468605d54e8edf1a20a"}, "author": "CAKatie", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207718-r466293148-Hilton_Paris_Opera-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Great Location, Staff and Stay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed here on Hilton points, and couldn't have been happier with the accommodations, the staff, the amenities. My rudimentary French at check-in was greeted respectfully and I was asked if I would like to continue in French or English. They kindly let me continue as long as I could in French, being gracious as I stumbled through vocabulary and tenses. This sounds small, but it is a great representation of the kindness, helpfulness and respect we received from the staff during our entire stay.\nWe were on the 4th floor (I believe 423), facing the street. It was very quiet! We had a wonderfully comfortable king bed. Bathroom was big enough, although, like many hotels, the light for it was on the outside. We had to move a few things around for counter space for our toiletry bags. There are no regular plugs in the bathroom, so hair drying needed to be done in the main room.\nBreakfast was included, and it was a huge selection of just about every kind of breakfast food you might want, from pastries to cheeses, meats to eggs. The coffee drinks are self-dispensed from a machine, which was okay. Brewed coffee was in carafes. A good selection of fresh juices, as well as yogurt, muesli, and toppings. We left every day with a nice breakfast in our bellies for our explorations of the city.\nThe hotel is located next to the Saint-Lazare station and metro stop. The metro stop is newer, and you can take escalators all the way up or down to the various trains. The transfer to/from the airport is one change from the Gare du Nord. Those escalators are very helpful! You may also take the stairs.\nWe would absolutely return to this hotel, and thank the staff for their kindness.\nRoom Tip: Front rooms, facing the street, are bright and quiet without city noise See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-11T02:00:00.000+02:00", "crawled": "2017-03-30T22:01:12.767+03:00", "highlightTitle": ""}