{"organizations": [], "uuid": "57e3de96f3f135f54ce724b08939163636aac4d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/c1/2b/e7/regina-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d207792-Reviews-Regina_Hotel-Paris_Ile_de_France.html", "section_title": "Regina Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207792-r469949827-Regina_Hotel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "AMAZING 5 STAR HOTEL!!!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "AMAZING 5 STAR HOTEL!!! - Review of Regina Hotel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "57e3de96f3f135f54ce724b08939163636aac4d7"}, "author": "saflore702", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207792-r469949827-Regina_Hotel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "AMAZING 5 STAR HOTEL!!!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My wife and I stayed one week at Regina Hotel for our one year wedding anniversary and this hotel exceeded our expectations. I had searched for weeks trying to find the right hotel for our first trip to Paris and after looking at location and rating I decided to go with Regina Hotel.\nLOCATION LOCATION: First off the location couldn't have been more perfect. It's located in central Paris and so close to a lot of main attractions. It's literally across the street from the Louvre Museum, Museum d'Orsay, Seine River, and Tuileries Garden. It was also very convenient that the metro was right up the street which is easy to use and will take you to any attraction you want to go to. (I used an app called \"next stop Paris\" and it would tell me exactly what metro subway to take. Another helpful app was \"Paris Metro\"). Champs Elysee, Notre-Dame, and Eiffel Tower are also not that far away. We decided to walk and explore the city from the Hotel to the Eiffel Tower and it took us about 35 mins. (15 mins if you take the Metro). What I also loved about the location was that there are cafes, shops, restaurants, and bakeries in the same neighborhood as the hotel. The neighborhood is clean and safe.\nTHE ROOM: I stayed in a Prestige Room and it was BEAUTIFUL and so spacious and I had the most amazing view from the balcony. View of the Eiffel Tower, Tuileries Garden, and the Big Ferris Wheel which is exactly the view I wanted. The bed was big, there was lots of storage space, a mini bar, safe, and even a hot water kettle so you can make coffee or tea in the morning. The bathroom was elegant and big. Looks like it was recently remodeled. It was a very Modern Persian hotel room with the amenities of a luxury hotel.\nTHE SERVICE: The service is definitely 5 star. Everyone at the front desk and concierge is extremely helpful and friendly. They also speak really good English which made our check-in very easy for us. We dealt a lot with an agent named \"Oliver\" who was awesome and always seemed to be in a good mood and never failed to greet us or ask if we needed anything. The Hotel has a restaurant and bar right inside. You can also order room service.\nOn a side tip: look into getting the Paris Pass at the tourist office during your stay for an all inclusive attraction and transportation experience.\nI will definitely be returning to Hotel Regina when We come back to Paris.\nThank you Hotel Regina for making our First trip to Paris and our one year wedding anniversary an amazing Experience!", "external_links": [], "published": "2017-03-24T03:00:00.000+03:00", "crawled": "2017-03-28T04:28:09.728+03:00", "highlightTitle": ""}