{"organizations": [], "uuid": "c8da3f77060c20aab5464e52af2264d0a640a7c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/82/39/01/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197424-Reviews-Novotel_Paris_Les_Halles-Paris_Ile_de_France.html", "section_title": "Novotel Paris Les Halles - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197424-r467537977-Novotel_Paris_Les_Halles-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "kind of Groovy", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "kind of Groovy - Review of Novotel Paris Les Halles, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "c8da3f77060c20aab5464e52af2264d0a640a7c5"}, "author": "Graham954", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197424-r467537977-Novotel_Paris_Les_Halles-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "kind of Groovy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We enjoyed our stay at The Novotel Les Halles. First thing, it it attached to the under renovations Les Halles train station and mall. the mall does not have much to offer from an American shopping perspective, and the food options leave much to be desired. However the blocks surrounding have a myriad of pubs, bars, cafes, resturants and street food options. Since there is construction and congestion there is no way to drive up to the entrance of the hotel at this time. So any way you arrive you are going to have to hoof it. the hotel was warm and welcoming. The staff alls spoke english and were very accommodating for first time visitors. The breakfast included with our room was very satisfactory and a great way to start a day of sight seeing. The hotel is currently renovating. We were not disturbed by any noise at all, but things are not quite finished. Including painting, some plumbing, and if you are bothered by construction paint and new carpet fumes beware. We were in one o fit larger rooms on the 6th floor.\nMy biggest disappointment was the price of a phone call. Due to air traffic controllers strike I had to contact AirFrance to try and rebook canceled flights. I made a total of 2 local calls (cell phone service was not strong so used the hotel room phone) for a total of 80 minutes and was charged 96Euro. Attempted to discuss with the staff to reduce the charge to no avail, so beware! Mini bar and Bar prices were very reasonable (just no prices posted in room). Enjoy!", "external_links": [], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-27T04:42:59.692+03:00", "highlightTitle": ""}