{"organizations": [], "uuid": "7fcf80980e38d243cd4e237615b05f9fa8858612", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/daodao/photo-s/04/26/bb/33/courtyard-room-double.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d793789-Reviews-Hotel_Kapok_Beijing-Beijing.html", "section_title": "Hotel Kapok Beijing - UPDATED 2017 Reviews &amp; Price Comparison (China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d793789-r468468247-Hotel_Kapok_Beijing-Beijing.html", "country": "US", "domain_rank": 189, "title": "2nd time staying at Hotel Kapok, Beijing", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "2nd time staying at Hotel Kapok, Beijing - Review of Hotel Kapok Beijing, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "7fcf80980e38d243cd4e237615b05f9fa8858612"}, "author": "tiongbahruboy", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d793789-r468468247-Hotel_Kapok_Beijing-Beijing.html", "ord_in_thread": 0, "title": "2nd time staying at Hotel Kapok, Beijing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed in hotel kapok, Beijing from 15 to 19 March 2017. This was my second time staying in this hotel. The first was back in 2010 when I first visited Beijing.\nOverall, excellent hotel. The location is superb. Only 5 minutes walk to Forbidden City and Wangfujing shopping street. Can tell that the hotel has aged. The room that was given to me had furniture looking old, a broken down fridge and also moss and stains at the bathroom walls and flooring.\nHowever, their service staff is top notched which provided very good service throughout our stay especially their staff, Mr Samuel Wang. He spoke very good English, was very friendly and understanding and took great pains explaining to us the things to do in Beijing and the places to visit.\nBecause we were travelling with a young child, and we arrived at the hotel about 8.30am...he understood our needs and actually arranged for housekeeping to speed up their cleaning and we got our rooms after our breakfast at about 11ish am, just so we can have a rest and freshen up before starting our day.\nI would suggest you book a tour from the hotel to visit places like Mutianyu Great Wall and Ming Tombs. We arrange a private car with a driver assigned to us for only Rmb850 (approx. S$170) for 5 of us. Private tour like this does not bring you to so-call time wasting \"out to rob you\" duty free shopping for jade etc which China is famous for.\nBtw, Hotel Kapok will need to update their website. There is NO sauna as listed in their website. Was looking forward to sauna to unwind after a long day of shopping and sightseeing but there wasn't any. Just a little disappointed.\nRoom Tip: Get a room facing the street. See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-27T00:03:38.692+03:00", "highlightTitle": ""}