{"organizations": [], "uuid": "f0234378e10b88ed2c456054f68fc7c91fcf7166", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/31/e4/3d/chambre-superieure.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d5582327-Reviews-Hotel_Vic_Eiffel-Paris_Ile_de_France.html", "section_title": "Hotel Vic Eiffel - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d5582327-r463516105-Hotel_Vic_Eiffel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Lovely hotel not far from the Eiffel Tower", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Lovely hotel not far from the Eiffel Tower - Review of Hotel Vic Eiffel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-28T02:00:00.000+02:00", "replies_count": 1, "uuid": "f0234378e10b88ed2c456054f68fc7c91fcf7166"}, "author": "mike04021949", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d5582327-r463516105-Hotel_Vic_Eiffel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Lovely hotel not far from the Eiffel Tower", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I arrived on Saturday at about 11.45. The hotel were very kind and prepared a room for me within 15 minutes even though I was extremely early for the usual check-in time of 15.00. The hotel is adjacent to Sevres-Lecourbe Metro station. Buy a carnet of 10 tickets for €14 to ghet round the city.\nI was in room 31 and it's very quiet. It has a very comfortable double bed, good room lighting and individual bedside lights. There's a safe and a fridge which includes a small,complementary bottle of water. For refreshment, a Nespresso machine is provided for coffees and infusion-type teas. A couple of sachets of milk, and some sugar, are also available.\nThe bathroom is smallish but perfectly comfortable, and spotlessly clean, although the piece of china which replaces the washbasin plug is cracked. There isn't a bath but there is an excellent shower with shampoo and shower lotion from the L'Occitane range. There are also a couple of similar items to the right of the washbasin, above the toilet, also by L'Occitane.\nThe hotel doesn't have a bar but you can buy hit drinks from a staff member at the drinks machine used for breakfast. A coffee costs €2.00.\nAs for breakfast, you can get the full, cooked breakfast. I believe it's €14.00 and I believe it's available every day. On weekdays (Mon-Fri) they also offer a Continental breakfast for €8.00, which is prepared by the waiter/waitress on duty. On Sunday morning, I chose to go for breakfast at the Café Basile, about 100m away. On Monday morning, I had the Continental breakfast in the hotel and it was perfect for me.\nRoom Tip: Room 31 faces in so is very quiet but the area never seems noisy, however. See more room tips", "external_links": [], "published": "2017-02-28T02:00:00.000+02:00", "crawled": "2017-03-29T11:17:57.185+03:00", "highlightTitle": ""}