{"organizations": [], "uuid": "a981374935aba24765001da391606565f4a93d96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/82/d4/f7/homewood-suites-by-hilton.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d5040757-Reviews-Homewood_Suites_by_Hilton_New_York_Midtown_Manhattan_Times_Square_South_NY-New_York_Cit.html", "section_title": "Homewood Suites by Hilton New York/Midtown Manhattan Times Square-South, NY - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d5040757-r464912083-Homewood_Suites_by_Hilton_New_York_Midtown_Manhattan_Times_Square_South_NY-New_Yo.html", "country": "US", "domain_rank": 189, "title": "Good location...", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Good location... - Review of Homewood Suites by Hilton New York/Midtown Manhattan Times Square-South, NY, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 1, "uuid": "a981374935aba24765001da391606565f4a93d96"}, "author": "Bloomchen", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d5040757-r464912083-Homewood_Suites_by_Hilton_New_York_Midtown_Manhattan_Times_Square_South_NY-New_Yo.html", "ord_in_thread": 0, "title": "Good location...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We lucked out and had wonderful weather for NYC in February during our three-night stay (better than our visit two years ago when it was sub-zero!). I booked the hotel before we knew which theatre shows we would attend, and it was fate that one theatre was several blocks south and the other several blocks north of the hotel, with it in the middle. (There are a good number of Off-Broadway theatres in this area.) While the subway line isn't all that close compared to other hotels in NYC, we did use it, as well as walking a lot, including over to MOMA and up Broadway and the distances were tolerable. The staff were nice and the room was clean and a good size for NYC. Having a kitchenette with refrigerator was great. However, as other guests have mentioned, though, the #1 problem with this hotel is the elevators. In the morning it was difficult to get an elevator because they serve not only guests, but a staff member told me they don't have a freight/staff elevator so it's both guests and staff jockeying for elevators. This is especially difficult because if staff are on the elevators, they tend to stop at many more intermediate floors than they would if it were simply guests going to the lobby. Also, they turned the far right elevator off at night so there were only two working. We went up to the roof deck which must be nice in summer, but even on a warm-ish for February day, it wasn't much of a view. We were on the 17th floor and were not bothered by light or sound so we slept well (which can be hard to do in the city). There isn't much on the short block the hotel is on (food or otherwise), but there is a cheap pizza place on the corner and a really good burger place just a block or so away. The best thing about the hotel is it is near Times Square, but not actually in it, so it's not that crowded or blindingly bright. Breakfast was a bit of craziness as it was crowded and hard to find a table each morning. The parking garage the hotel partners with is a bit down the street and was being renovated when we checked out, so retrieving my car was a bit of a challenge. There was also very limited parking in front of the hotel for loading/unloading, so be aware of that as well. Overall we'd stay here again, but be aware of the elevator issues - apparently it's an ongoing concern from reading other comments.\nRoom Tip: If you are on a higher floor, it's going to take a while to get an elevator. See more room tips", "external_links": [], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-29T04:20:17.377+03:00", "highlightTitle": ""}