{"organizations": [], "uuid": "9d2f16a8372d9c86a9c93e4a6067dc6c4da74998", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/d1/e5/74/be-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d6555841-Reviews-The_Leon_Hotel-New_York_City_New_York.html", "section_title": "The Leon Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6555841-r466978911-The_Leon_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great hotel, reasonably priced", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Great hotel, reasonably priced - Review of The Leon Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 1, "uuid": "9d2f16a8372d9c86a9c93e4a6067dc6c4da74998"}, "author": "AnnettePSC", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6555841-r466978911-The_Leon_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great hotel, reasonably priced", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We needed a place to stay one night for a short family trip to NYC. After searching on TripAdvisor and reading reviews, we decided to book the Leon Hotel. It was a good decision!\nWe usually stay in the Times Square area of the city but, this time, we had tickets to BlueMan Group at the Astor Place theater (less than a mile away from Leon) and wanted to do things in this section of NYC.\nThe Leon was perfect for us. We checked in and were upgraded to a Family Suite since the rooms with two double beds (which we had booked) had sold out. It was a pleasant surprise! The Family Suite is so roomy and comfortable! It consists of two bedrooms with a partition between them for privacy: one with one double bed, a nightstand with clock, a desk with Kurig, a chaise lounge, a wardrobe with mirror, and its own bathroom; the second with two double beds, a nightstand with clock, desk with Kurig, large flat screen TV, mini-fridge, another wardrobe with full-length mirror, and bathroom.\nOur suite was on the 5th floor and the main, big window faced the entrance of the Manhattan bridge. You would think it'd be noisy from traffic but not at all! In fact, the rooms were very quiet.\nThis hotel is small, newly remodeled, clean, the beds are comfortable, and having all the comforts for today's needs. The staff is super nice and helpful. They have a couple of vending machines and ice dispenser on the floor beneath the lobby.\nThe Leon worked fine for us because we like to visit and do things in the city and only go to the hotel to sleep. Chinatown and Little Italy are right there so plenty of good places to eat.\nThis hotel is a great value! I would highly recommend it to anyone visiting NYC, especially on a budget.\nRoom Tip: We stayed in room 508(Family Suite) and loved it! See more room tips", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-30T19:32:00.473+03:00", "highlightTitle": ""}