{"organizations": [], "uuid": "99dfab24371afd55301e1c07792c2c4f5e0207ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/b4/8b/e8/le-pigalle.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197608-Reviews-Le_Pigalle-Paris_Ile_de_France.html", "section_title": "Le Pigalle - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197608-r463823551-Le_Pigalle-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "24 Happy Guests!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "24 Happy Guests! - Review of Le Pigalle, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-01T02:00:00.000+02:00", "replies_count": 0, "uuid": "99dfab24371afd55301e1c07792c2c4f5e0207ce"}, "author": "Craig1978", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197608-r463823551-Le_Pigalle-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "24 Happy Guests!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My boyfriend (now husband) and I were recently joined by 22 friends for our wedding in Paris. There are many challenges associated with planning a wedding in a city 5,000 + miles away, not the least of which was finding a hotel that would satisfy the tastes of 24 different people...\nFortunately, after emailing back and forth with over a dozen different hotels (many of whom immediately increased their rates upon hearing our request), I found Le Pigalle. From the very beginning it was clear that we were dealing with a different kind of hotel and a different kind of staff. Lucille and Pauline were efficient in offering us a package of rooms that met our needs and budget. More importantly they went above an beyond by offering suggestions for wedding venues, restaurants, barber shops etc...\nAdditionally they helped us organize a pre-wedding cocktail hour for our guests - I was busy preparing for the ceremony but heard nothing but compliments from our guests.\nThe hotel itself lives up the the positive reviews. The rooms are comfortable (everything that has been written about the beds is true) and well decorated. The ground floor was a welcoming and comfortable environment. With 24 people in our group, it served as great meeting place for us to hang out between outings and the staff never made us feel rushed or unwelcome even on the days when we spent hours just hanging out talking. Special note of thanks to Joshua and Camille who were always friendly and somehow managed to memorize everyone's breakfast preferences after our first order.\nI think the best way to sum up Le Pigalle, is to note that out of the 24 us, not one person had a complaint and instead many told us that the experience at the hotel was one of the highlights of the trip.\nOne last example of Le Pigalle's service: After most of our guests had departed to return home, my husband and I moved on to spend our last couple of nights in Paris at the Ritz. As we were being walked to our room the receptionist informed us that someone from Le Pigalle has called ahead to let them know we had just been married. As a result of that call, the Ritz upgraded us to a deluxe suite and had a bottle of champagne and a cake waiting for us in the room.\nBottom line - with there service that extends before, during, and after your stay, Le Pigalle is an excellent choice for anyone spending time in Paris.\nSome notes: These are not complaints, just things to keep in mind when choosing Le Pigalle.\nThe rooms are a bit small (by American standards), I would suggest considering a 21 or 22. If you don't mind smaller rooms the 15 or 17 are perfectly adequate.\nThe neighborhood can be a bit noisy - this was not a problem for us (in fact it was helpful as we were in a celebratory mood and quite loud ourselves). This should not keep you from chasing Le Pigalle, but it noise is an issue for you ask for a higher room or something towards the back. Our group included a 14 month old baby who had no problem sleeping despite all the fun happening out on the streets.\nThe Le Pigalle has some really nice showers in most rooms (I am not sure what it is, but like the beds everyone raves about them), however some of the rooms on the 6th floor are exceptions. It took me a couple of hours to realize that our original room only had a bathtub. With two of us needing to get ready for our wedding, a bathtub would not be sufficient. After I asked Pauline if it was possible to switch rooms before our wedding on Saturday - she gave us our choice to two other rooms and relocated us immediately. We chose room 52 which had a large shower and a nice balcony. The room shared a small entry way with room 51 (a smaller P15 room) so we decide to also take that room and combined both into a larger suite which gave us even more space to entertain our guests and an extra shower. Two of our friends were in room 61 which was another nice room that also lacked a proper shower. However, unlike our original room, it at least had a shower curtain so it was possible to stand and use the hand held faucet to take a semi-shower. This did not really work for our friends as they are both over 6 feet tall. Rather than moves rooms they opted to use to shower in room 51 which our group effectionately named \"the bonus room.\" The takeaway here is that if you prefer a larger shower, be sure to let staff know when you make your reservation and try to avoid the 6th floor.\nBest rooms? I saw most, but to all, of the rooms that my friends stayed in. While all were great - i would say that the 5th floor rooms were the best, specially rooms 52 and 55 which were larger and both had balconies. 51 also has a balcony, but is a smaller P15 room.\nThats it, now get to Le Pigalle. You all not regret it!\nRoom Tip: 5th Floor rooms have balconies. See more room tips", "external_links": [], "published": "2017-03-01T02:00:00.000+02:00", "crawled": "2017-03-30T17:25:16.155+03:00", "highlightTitle": ""}