{"organizations": [], "uuid": "9d9050f1a1579f678256e7d5ac9cde5e300131fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/96/d7/da/opulent-decor-with-original.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d3256870-Reviews-Hotel_Eclat_Beijing-Beijing.html", "section_title": "Hotel Eclat Beijing - UPDATED 2017 Reviews &amp; Price Comparison (China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d3256870-r470351278-Hotel_Eclat_Beijing-Beijing.html", "country": "US", "domain_rank": 189, "title": "Chinese New Year - Review", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Chinese New Year - Review of Hotel Eclat Beijing, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "9d9050f1a1579f678256e7d5ac9cde5e300131fd"}, "author": "Walter B", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d3256870-r470351278-Hotel_Eclat_Beijing-Beijing.html", "ord_in_thread": 0, "title": "Chinese New Year - Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I really loved the Eclat. At first, I was a little reticent to stay in this location. The hotel is not situated in a food/shopping area. The hotel was a little more expensive than I usually opt for while in China. I am so glad I followed through and stayed at The Eclat.\nThe Eclat is located in a shopping mall with many restaurants and a really nice gym. ! I did not realize that until I arrived. The lobby is small but the staff was great. I was greeted upon arrival. Since it was Chinese New Year, the hotel was empty. I never saw another guest during my stay.\nThe room was lovely. The bedding was lux and the amenities were great. Molton Brown bath products, a huge bathtub and a rainfall shower. The toilet was a Toto that does everything for you..well almost everything. There was a French single serve coffee machine, free bottled water and fruit and cookies delivered every night. The electronics were extensive with a very large nice TV-- I never mastered the instructions, a little complicated but I go the TV to work so I was good. The WiFi was fine.\nThe shopping mall had many unique shops and amazing art installations everywhere. The restaurants were extensive, coffee places everywhere including an illy coffee shop with desserts you must try. The hot cocoa was pure chocolate!\nThe mall also had a gym on the 3rd floor. Take the metal spiral stairway up at the entrance to the mall or as you exit The Eclat lobby directly into the mall. The gym was adequate and very nice inside. Of course there was an amazing art installation in the gym! Remember to get a gym pass at the Eclat front desk--you get access to the gym for no charge when a guest at The Eclat.\nThe food at The Eclat, the art on every floor and the kindness of the staff make a stay here lovely. When you venture out, the metro is a healthy walk but definitely doable. Exit the hotel to the mall entrance and then turn left and walk about 1/4-1/2 mile and the metro will be on your left across the street.\nIf you want a unique boutique hotel and location is not high on your list, stay here. It was wonderful.\nRoom Tip: Higher room is better for view and noise level. The windows are obstructed with a building design el... See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-27T15:49:37.243+03:00", "highlightTitle": ""}