{"organizations": [], "uuid": "54f3973433167e7721aa55ee49e9fb419e9011df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/a7/c7/d2/citizenm-new-york-times.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d6385164-Reviews-CitizenM_New_York_Times_Square-New_York_City_New_York.html", "section_title": "citizenM New York Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6385164-r470626318-CitizenM_New_York_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Fun stay, with some quirks.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Fun stay, with some quirks. - Review of citizenM New York Times Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "54f3973433167e7721aa55ee49e9fb419e9011df"}, "author": "hhotaling", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6385164-r470626318-CitizenM_New_York_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Fun stay, with some quirks.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed here one night for business/pleasure. Checked in early, no problem - room was ready. Enjoyed the ability to choose from high floor/low floor, north facing/south facing. I think it's funny that they promote the self check-in though - basically I was directed the entire time, so I'm not sure it was THAT much different than having someone do it for you. Had lunch in the hotel - based on the menu and the beautiful bar area, it was very surprising and disappointing to find that the majority of the items on the menu were actually pre-made and in a refrigerator case. At these prices, I expect to be able to order fresh food. Rooms were fun, lots of little eccentric touches that made the experience feel unique and special. Room was adequate for a single person - would be pretty tight for two, even if you like each other a LOT. Breakfast for $19 is an overpriced JOKE -- and a less honest person than me could easily NOT pay the $19 and still get breakfast, because I actually had to track someone down to check-in and give my name. Otherwise, I could have just gotten the food and gone up to my room, no one the wiser. Also, very inconvenient set up for the plates/silverware, and had to ask for cream for my coffee, as there was none sitting out - and the girl poured it directly from a carton, resulting in VERY milky coffee. Not the worst thing in the world, of course, but still felt weirdly avoidable considering the work the hotel brand has put into silly little phrases covering everything from the napkins to the ear swab packaging - feels like a thermos of half&half is pretty easy to plan for on their part. Overall, it was a fun experience, and they've clearly put a lot of effort into the branding and atmosphere of the hotel. The rooftop bar is beautiful - especially in the warmer months. Most of the bells and whistles didn't really add to my stay (like, an ipad to control the temperature and color scheme of your room), since, when you're staying in NYC, one hopes that you're out and about, and not sitting in your hotel room playing with the color hue of the lighting in your shower.", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-28T14:23:25.089+03:00", "highlightTitle": ""}