{"organizations": [], "uuid": "8d268da79609de5d4caa2a8315503ea4d1cf0c4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/15/19/1a/one-un-new-york.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d209382-Reviews-ONE_UN_New_York-New_York_City_New_York.html", "section_title": "ONE UN New York - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d209382-r469062711-ONE_UN_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great location and wonderful view", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great location and wonderful view - Review of ONE UN New York, New York City, NY - TripAdvisor", "spam_score": 0.002, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 0, "uuid": "8d268da79609de5d4caa2a8315503ea4d1cf0c4e"}, "author": "JGVA", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d209382-r469062711-ONE_UN_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great location and wonderful view", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Since I was attending the UN on business this hotel couldn’t have been more convenient as it is quite literally right across the street. I enjoyed my stay and will more than likely return to the hotel in the future. What stood out most to me was the courtesy and professionalism of the staff. People seemed genuinely interested in making sure guests needs and questions were taken care of and, for the most part, with a genuine smile.\nMy room (a corner room on the 37th floor of the “West Tower”) was clean and comfortable and appeared to have recently been renovated. The large bathroom was well equipped and mostly functional. The amenities were of high quality. In the hallway there were a couple of closets and a small refrigerator. Although there was a warning sign on the fridge noting that it was meant for mini-bar use and placement of personal items in the fridge would incur a $50 charge, it was apparent that there hadn’t been an automated mini-bar system in use for some time so I took the risk and placed my own items in the fridge – and there was no charge when I checked out.\nThe work desk was large and functional. I brought my own internet cable so I can’t speak to the quality of the wireless connection. The hard-wired internet speed was great throughout my stay.\nThe bed was comfortable but, for some reason, the sheets didn’t fit and stopped a couple of inches short of the end of the mattress. It was a minor annoyance but it did bug me so I essentially remade the bed each day to adjust the sheet depth… I’m just strange like that.\nThe view from the room was great, with the UN building in the foreground, the East River and Brooklyn in the distance.\nThere were two issues I had with the room that others may find are no big deal but…\nFirstly the noise from the room next door. The corner room I was in seemed to be able to be a connecting room to the room next door. The connecting door was not sound proofed at all and I could pretty much hear every conversation the guest next door had, which made me aware that they could hear any conversation I had as well. I found this distracting to say the least. I don’t know that the guest next door was particularly loud but that didn’t seem to matter. This may only be the case in regards to connecting rooms (because of the door) and may not be an issue for other rooms in the hotel so it shouldn’t necessarily be a deal breaker.\nSecondly, the heating/cooling system in the room did not function too well for me. There is a touch screen panel on the wall with a pleasant display that provides a series of buttons to control the temperature for cooling and for heating as well as a means of controlling the fan speed. I went through all sorts of combinations to try and get a sensible setting for the room (it was reasonably cold in the city during my stay with intermittent snow and rain). I found that, when I tried to set a given heating temperature and fan speed the system would simply stare back at me for several minutes until I walked away from it. It’s possible it was shy or simply slow to respond but it was frustrating. Also, the “Current Temperature display setting for the room never varied from 73 degrees Fahrenheit, despite the room being obviously either much warmer or colder that than. I managed to get it to either get very warm by setting the Heat way up (77 degrees) or very cold by switching to “Cold” and setting the temp way down (69 degrees) but it was a challenge. Finally, I really want to find a place where I can set the fan on low or medium continuously when I am in the room for some background noise and also set the temperature for the room. It seems you can have one or the other, but rarely both.\nI had breakfast and dinner at the Ambassador Grille restaurant and enjoyed all meals there as well as the excellent service from the staff. I can heartily recommend a meal there whenever the restaurant is open. I also used the “Grab and Go” café many times for various coffees, fresh fruit and other small items. The staff there were also great and I have nothing but praise for the service and the food/drink there as well.\nThe issues I experienced were minor and wouldn’t stop me from trying the hotel again but if they persisted it might put me off in time.\nRoom Tip: The corner rooms in the West Tower have a little more space and an excellent view See more room tips", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-29T14:53:43.726+03:00", "highlightTitle": ""}