{"organizations": [], "uuid": "560406dcc4a30e851e26467876f9f3e5289c3eca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/03/5d/8c/71/hotel-lumieres.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d233456-Reviews-Hotel_Lumieres_Montmartre_Paris-Paris_Ile_de_France.html", "section_title": "Hotel Lumieres Montmartre Paris - UPDATED 2017 Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233456-r455946532-Hotel_Lumieres_Montmartre_Paris-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Four night stay in Montmartre -", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Four night stay in Montmartre - Review of Hotel Lumieres Montmartre Paris, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 1, "uuid": "560406dcc4a30e851e26467876f9f3e5289c3eca"}, "author": "nuggets66", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233456-r455946532-Hotel_Lumieres_Montmartre_Paris-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Four night stay in Montmartre -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I could not recommend this hotel enough for a stay in Paris. We stayed for four nights. We took a train from CDG airport to Gare du Nord and took the Metro (line 4) for four stops to Porte de Clignancourt. Then it was a 5/10 minute walk to the hotel. Lots of bakeries, supermarkets (one next door and one directly across the road), ATMs (2 across the road), pharmacies, honestly anything you might need on your trip you will find on this street. There is a bus stop right outside the door, although we did not use the bus at all while we were there. We arrived at the hotel at 12pm and were allowed check in immediately. The room was small but clean and very comfortable. There is a safe, hair dryer, toiletries and sufficient wall sockets. The TV only had French stations but this did not bother us. Excellent shower. A short stroll on to Montmartre and Sacré-Cœur, then down by the Moulin Rouge. There were a few other Metro stations close by which made getting around Paris extremely easy. The staff at the hotel were friendly and helpful and didn't really get in our way. They printed our boarding passes for our journey home which was a big help and we could store our luggage in a room downstairs (we were given a key to the luggage room and there was other people's bags in here too so if you are worried about valuables you leave them there at your own risk.) The only negative is a cleaner opened our door while we were chilling out on our bed even though we had a do not disturb sign on it, I'm just glad we were decent! However we did not let this affect our stay and it didn't happen again while we were there. I will 100% be recommending this hotel to my family and friends and I will most certainly be returning for my next trip to Paris!", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-28T07:57:41.991+03:00", "highlightTitle": ""}