{"organizations": [], "uuid": "84830d966deabd0738870abe26956fa516f70be1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/a5/1a/9d/guestroom-capo.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d252244-Reviews-Capo_d_Africa_Hotel-Rome_Lazio.html", "section_title": "Capo d'Africa Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d252244-r469420680-Capo_d_Africa_Hotel-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Good Hotel, Very Convenient for Old Rome", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Good Hotel, Very Convenient for Old Rome - Review of Capo d'Africa Hotel, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-22T02:00:00.000+02:00", "replies_count": 0, "uuid": "84830d966deabd0738870abe26956fa516f70be1"}, "author": "John H", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d252244-r469420680-Capo_d_Africa_Hotel-Rome_Lazio.html", "ord_in_thread": 0, "title": "Good Hotel, Very Convenient for Old Rome", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hotel is just a couple of hundred metres from the side of Colosseum, indeed from the north roof you can see it. Brilliant location. From the end of the road you can catch half dozen or so bus routes and a tram. The nearest Metro is maybe ½ kilometre away at the front of the Colosseum.\nRoom OK, big bed, adequate cupboarding, TV, large safe, kettle etc, mini bar, bath / shower, bidet, lots of towels, opening windows, quiet. Wifi is free but has to be renewed daily. Room kept meticulously clean. Quite suitable for a week's stay. (Yawn, I get fed up with writing this about hotels) the bath wasn't draining properly, I asked nicely for it to be seen to - it wasn't. Next day I asked less nicely and it was. But, ggrrr!\nEntrance to the hotel is up 14 steps. There are concierges but they're not particularly attentive. Reception desk has good English spoken, manned 24 hours. Next to Reception is a lounge with plenty of seating, a good bar (they make generous drinks). Art work in the lounge is modern and interesting. There's a gym in the basement, not that I saw it. We discovered late there's also an Internet station there.\nAt the top of the hotel is a breakfast room, a bit cramped. Outside it is a decent size roof terrace with chairs, tables etc. Lifts work fine.The breakfasts are rather ordinary and very often the breads and cakes are a bit stale. Fruit isn't top class. There's plenty of choices though.\nMy only negative is that the staff, although they're friendly enough, aren't very plugged into their customers, the don't seem to think, they just follow their procedures. Room service was for ever keeping us short of tea and milk. Both in reception / lounge and in the kitchen they talk across the areas to each other, little squabbles even. In Reception this is partly due to the concierges not having their own desk, they just seem to hang around, the situation not helped by their drab uniforms.\nBut, overall this is a good Hotel, very convenient for old Rome. The facilities are what you need and it's wonderfully clean. We would certainly use it again if visiting old Rome.\nTip - At the back of the hotel in the next street north (Via De' SS Quattro) is an excellent restaurant (Li' Rion) that the locals use, brilliant thin crust pizzas and inexpensive house wine, quick service.", "external_links": [], "published": "2017-03-22T02:00:00.000+02:00", "crawled": "2017-03-28T03:52:20.860+03:00", "highlightTitle": ""}