{"organizations": [], "uuid": "24cfa1ad32e433d18978c4574b94aa7b93b11607", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/bc/63/54/the-hotel--v2375200.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d192145-Reviews-Park_International_Hotel-London_England.html", "section_title": "Park International Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192145-r471377844-Park_International_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Made our trip awesome", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Made our trip awesome - Review of Park International Hotel, London, England - TripAdvisor", "spam_score": 0.008, "site_type": "discussions", "published": "2017-03-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "24cfa1ad32e433d18978c4574b94aa7b93b11607"}, "author": "cacklycuckoo", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192145-r471377844-Park_International_Hotel-London_England.html", "ord_in_thread": 0, "title": "Made our trip awesome", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I can't say enough about how good the location of this hotel is. London is not a small city, but the location made us 20 or 30 minutes away from anywhere we wanted to go. This made it possible for us to get up slightly later than if we had been anywhere else. The hotel is a three-minute walk from Gloucester Road on the Underground. We were also able to get to our hotel easily from Heathrow by the Underground.\nAlong the way and in the vicinity are several cafes and restaurants- serving anything from traditional British, to Thai, to Italian. The area is lively, which I appreciated, especially when we were coming back late at night, we meaning to me and my husband. There's also a 24 hour Tesco, Sainsbury's, and a laundromat in walking distance.\nFrom the brief look I got at the areas surrounding other hotels, I believe I made the best decision in picking a hotel in this location.\nNext, the service at the hotel. Impeccable. I have to mention Georgi especially. He was there when we checked in, and remembered our room number, and enquired on our stay every single day. His service was excellent, as was others', whose names I didn't get.\nOn a small down note, the tea we used in the room was not replenished, and the ironing board not folded. But we told Georgi, and he ensured this didn't happen again. Another small minus was that our air con turned off in the middle of the night every day, making us lose some sleep. The rooms are a little small, but that is expected.\nA big bonus was a mobile phone supplied free by the hotel, which included free local calls, and mobile data. This phone, which came as a surprise, proved handy when we needed to call our friends in the country, and Google for information.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-30T03:00:00.000+03:00", "crawled": "2017-03-31T16:12:57.724+03:00", "highlightTitle": ""}