{"organizations": [], "uuid": "80b9688093c714344c31105f5c0a354e62900287", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/54/7b/6b/hotel-crayon-rouge-by.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d6878364-Reviews-Hotel_Crayon_Rouge_by_Elegancia-Paris_Ile_de_France.html", "section_title": "Hotel Crayon Rouge by Elegancia - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d6878364-r459792390-Hotel_Crayon_Rouge_by_Elegancia-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "A mesmerising experience in the heart of Paris!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "A mesmerising experience in the heart of Paris! - Review of Hotel Crayon Rouge by Elegancia, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-09T02:00:00.000+02:00", "replies_count": 0, "uuid": "80b9688093c714344c31105f5c0a354e62900287"}, "author": "GartnerDa", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d6878364-r459792390-Hotel_Crayon_Rouge_by_Elegancia-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "A mesmerising experience in the heart of Paris!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My boyfriend and I couldn't imagine a better hotel to spend a romantic weekend in Paris. Crayon Rouge is perfectly situated in a charming neighbourhood with great little restaurants and bars near by, and just a couple of minutes away from Musée du Louvre, Le Palais Royal, Opera, Galeries Lafayette and all the main subway connections.\nWe simply loved hotel's retro design and its cosy lobby where you can relax, have a coffee/tea and enjoy their tastefully curated music. Hotel's staff was amazingly helpful, professional and welcoming... And as we like to discover hidden jewels of cities we travel to we couldn't be more grateful for staff's priceless recommendations (The burlesque show at La nouvelle Seine was a true jewel).\nAnd we also very much enjoyed their rich self-service breakfast. Two thumbs up for their home-made banana cake & freshly baked - still warm - bread, croissants and pains au chocolat! Gluten-free bread is also available.\nWe stayed 3 nights in the studio Attrape Rêve (Dreamcatcher) that was located at 5 minutes by foot from the hotel. This studio is in fact a spacious private apartment in the 7th floor (no worries there's an elevator) with a beautiful view on the roofs of Paris. Everything in this studio was superb: handpicked furniture & decoration, a spacious shower with romantic led lighting incorporated into the walls giving you a spa-like atmosphere, beyond confortable bed and fully equipped little kitchenette (fridge, coffee machine, kettle). We couldn't wish for anything more.\nThank you team Crayon Rouge! You made our stay very special.\nKeep up the good work!", "external_links": [], "published": "2017-03-09T02:00:00.000+02:00", "crawled": "2017-03-27T06:25:35.388+03:00", "highlightTitle": ""}