{"organizations": [], "uuid": "0347243c5bfdf5ebff0081e33cc76ccb7e925af0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/c0/2c/b7/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d299851-Reviews-or5-Novotel_Xinqiao_Beijing-Beijing.html", "section_title": "Novotel Xinqiao Beijing - UPDATED 2017 Hotel Reviews &amp; Price Comparison (China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d299851-r469199316-Novotel_Xinqiao_Beijing-Beijing.html", "country": "US", "domain_rank": 189, "title": "Great base for a few days touring Beijing", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Great base for a few days touring Beijing - Review of Novotel Xinqiao Beijing, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 1, "uuid": "0347243c5bfdf5ebff0081e33cc76ccb7e925af0"}, "author": "jim_kirkman", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d299851-r469199316-Novotel_Xinqiao_Beijing-Beijing.html", "ord_in_thread": 0, "title": "Great base for a few days touring Beijing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Beijing is huge and so there is no such thing as the perfect location, however this was fine for the guided tours and sightseeing we did.\nThe hotel is reasonably smart inside, no doubt of a typical Novotel standard.\nThe staff on reception need to smile more but the girls in the Galleria bar where you can have a small selection of snack meals, couldn't have been friendlier or more helpful. There is a \"happy hour\" between 18:00 and 20:00.\nThe assistant manager for guest experience Rebacca was sincere and lovely. She arranged a personal taxi trip to the Great Wall for us with a trusted driver. Her attitude was superb and it is true that one individual can make a real difference to your holiday experience.\nWe didn't use the tour desk or concierge (or spa) services themselves.\nOur room was spacious and generally fine, just a little tired in places. The air con was pretty noisy - a bit like having an engine running in the background. We never learnt how to turn it off but that probably tells you it wasn't that much of an issue!\nThere are drink making facilities in the bedrooms as well as iron and ironing board, hairdryer, shaving point etc. Even free toothbrushes and toothpaste. You get two free bottles of water each day.\nThe buffet breakfast had sufficient choice for Brits to find enough to enjoy, but they have no idea how to properly cook bacon or sausages! Do they boil them?\nPersonally prepared omelettes were fine and you could add tomato, baked beans, hash browns etc. if you like something approaching an English breakfast. There was a wide range of food to suit other nationalities and cultures.\nThere are other restaurants in the hotel but we didn't use them, finding our fellow travellers homed in on the bar to enjoy a good sociable atmosphere.\nUsefully there was a money changing machine next to reception but it doesn't take cards.\nLet's face it, you don't come to Beijing for a few days to stay in your room. You will be out and about and then exchanging stories in the bar with fellow guests. The Novotel was great for that.", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-28T04:48:26.850+03:00", "highlightTitle": ""}