{"organizations": [], "uuid": "82fa9e871bb5b14e06ef0103f8757c18adc078b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/85/44/bb/studio.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d596437-Reviews-or10-The_Inn_At_The_Roman_Forum-Rome_Lazio.html", "section_title": "The Inn At The Roman Forum - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d596437-r464578070-The_Inn_At_The_Roman_Forum-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Heaven in Rome", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Heaven in Rome - Review of The Inn At The Roman Forum, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-04T02:00:00.000+02:00", "replies_count": 1, "uuid": "82fa9e871bb5b14e06ef0103f8757c18adc078b0"}, "author": "Adi T", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d596437-r464578070-The_Inn_At_The_Roman_Forum-Rome_Lazio.html", "ord_in_thread": 0, "title": "Heaven in Rome", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On a recent trip to Rome we decided to split our stay between two places: the Inn at the Roman Forum and the Le Quattro Dame Suites (which I’ve reviewed separately).\nThe Inn at the Roman Forum is an absolutely charming little hotel (with a B & B feel), located right behind the Forum. It is initially tricky to find as it’s on a side street, and you can easily miss it as there’s no awning or signage.\nBut once you step in it’s a different story. Our room (103) was not particularly large, but absolutely charming, and fully equipped with everything one might want. Beds, linens, towels, etc., were of the highest quality, and the bathroom had a Jacuzzi tub.\nThe top floor houses an indoor and outdoor lounge/seating area with lovely views.\nBreakfast is served daily from 6:45-10am in that lounge, and is delicious and exhaustive (just about any and everything you could imagine is on the menu, and they make fresh to order eggs, pancakes etc. too).\nBut at the end of the day it is the quality of the people that can make or break an experience and here I must say that the staff really went out of their way to make our stay unique: Barbara, Cristina, Frederica, Paola, Valentina and Valerio, to name just a few.\nFinally, the location of this place is great. If you walk in one direction, you’re literally minutes away from Colloseum, Forum and Vittorio Emmanuel Monument. But if you go the other way (via Baccina) you walk into the more residential, less touristy, neighborhood of Monti, which is charming and filled with lovely restaurants. Thus, you have both the local and tourist Romes both within easy access.\nRoom Tip: We were in room 103 and loved it. No views (except of an interior courtyard) but very peaceful and q... See more room tips", "external_links": [], "published": "2017-03-04T02:00:00.000+02:00", "crawled": "2017-03-27T14:38:18.463+03:00", "highlightTitle": ""}