{"organizations": [], "uuid": "c3a44fdd11d9541d8c0bb5619f98752a937ad3c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/04/87/98/3f/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d224223-Reviews-Nyma_the_New_York_Manhattan_Hotel-New_York_City_New_York.html", "section_title": "nyma, the New York Manhattan Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d224223-r469243300-Nyma_the_New_York_Manhattan_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great hotel, good location, hilarious bellboys!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Great hotel, good location, hilarious bellboys! - Review of nyma, the New York Manhattan Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 1, "uuid": "c3a44fdd11d9541d8c0bb5619f98752a937ad3c2"}, "author": "jesscotttt", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d224223-r469243300-Nyma_the_New_York_Manhattan_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great hotel, good location, hilarious bellboys!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I was in NYC for a conference for a week, so the company had booked accommodation at Nyma and I'm glad they did! Located in Koreatown, Nyma is a hop, skip and a jump away from the Empire State Building, Madison Square Garden, Penn Station and some delish Korean food ( & cheap pizza, if you're into that, which my colleagues most definitely were). In other words, perfect location still in the throng of NYC but not overly busy!\nI stayed in a room on level 16 with two double beds, an ensuite and a telly, and had awesome views across the city. The only downside was that wifi was having trouble that week and wouldn't work in my room - so I needed to sneak out into the hallway to skype home (and by home, I mean my dog). There was a lot of choice each morning for brekky - from fruit to waffles, pancakes, donuts, fruit juice and tea and coffee, bagels and toast with jam, butter, cream cheese etc - and it was all you can eat (not as many options for vegans like myself, but this is totally not a complaint as I'm used to having to cater for my dietary choices).\nAlthough the two ladies who often worked at reception weren't the most helpful nor delightful, the young man (I wish I had have gotten his name for you) was a delight and very, very helpful (particularly when we were enquiring about the wifi issue) and provided great customer service. Also, the luggage men were very helpful (and always had a cheeky quip or two as we left and walked back into the hotel) which made for a jovial environment.\nI can't comment on the price - as I didn't pay - but I was thrilled with my stay (and the rooftop bar). The lifts are notoriously slow but all in all, great experience here.", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-30T19:37:07.800+03:00", "highlightTitle": ""}