{"organizations": [], "uuid": "ace889fc011092e5482c246ce1de28127da96a81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/82/2e/e1/hotel-exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d929153-Reviews-Hotel_Holiday_Inn_Paris_Gare_Montparnasse-Paris_Ile_de_France.html", "section_title": "Hotel Holiday Inn Paris Gare Montparnasse - UPDATED 2017 Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d929153-r464126726-Hotel_Holiday_Inn_Paris_Gare_Montparnasse-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Really Suprisingly Good", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Really Suprisingly Good - Review of Hotel Holiday Inn Paris Gare Montparnasse, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-02T02:00:00.000+02:00", "replies_count": 0, "uuid": "ace889fc011092e5482c246ce1de28127da96a81"}, "author": "FrequentTraveller921", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d929153-r464126726-Hotel_Holiday_Inn_Paris_Gare_Montparnasse-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Really Suprisingly Good", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This hotel has the obvious benefit of being only a 5 minute walk up the road from Gare Montparnasse so if you are in Paris for business then it is an easy reach. The hotel is actually tucked away in a building that kind of melds in with the others, so look out for the Holiday Inn logo up high on the side of the building, it is visible almost from the station if you go out the main entrance and look right up Avenue du Maine.\nThe reception is a very busy place, but the staff were welcoming and very efficient (I arrived and had to get changed and go for a meeting so I needed hustle, and that is what I got). The room I had was on the first floor, with a living room and sofa and a nice terrace with chair and table, cordoned off by some shrubs. Sadly it was pouring with rain so I didn't get to use it.\nThe bathroom was modern-ish, with a great rain shower and also a bath with multiple jets and so on. Must have been quite the thing for the weekend. The room was quiet, although I needed to close the french windows to the terrace as there was some sort of humming mechanical or electrical item outside.\nBreakfast was generic, with eggs (scrambled or boiled yourself in one of those communal contraptions) and a good range of fresh items. Bread was good and the coffee spot on.\nThe decor in the common areas of the hotel is showing its age - or probably just its exposure to so many people - a little but the hotel was pretty much exactly what I needed. They handled my late checkout request efficiently (although they did seem to forget this at one point as someone asked me to leave) and I would stay here again.", "external_links": [], "published": "2017-03-02T02:00:00.000+02:00", "crawled": "2017-03-27T04:48:53.785+03:00", "highlightTitle": ""}