{"organizations": [], "uuid": "ebfb5685140354385e403883702aeccc5fc1447c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/94/87/0b/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d193114-Reviews-or10-The_Piccadilly_London_West_End-London_England.html", "section_title": "The Piccadilly London West End - UPDATED 2017 Hotel Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193114-r466185472-The_Piccadilly_London_West_End-London_England.html", "country": "US", "domain_rank": 189, "title": "The best location!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "The best location! - Review of The Piccadilly London West End, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-10T02:00:00.000+02:00", "replies_count": 0, "uuid": "ebfb5685140354385e403883702aeccc5fc1447c"}, "author": "Amanda L", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193114-r466185472-The_Piccadilly_London_West_End-London_England.html", "ord_in_thread": 0, "title": "The best location!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "First of all, the location of this hotel is absolutely perfect. We were less than 2 minutes away from the Queens Theatre. There are lots of great restaurants within walking distance and great shopping on Oxford Street isn't far out of the way.\nThe hotel has a lot of other things going for it-- We loved the rainfall shower, Elemis toiletries and the glass of Prosecco upon check-in. The in room espresso bar, bottled water and a variety of pillows were all great. They also provide a smart phone for use if you are traveling internationally.\nThere were two things that bothered me on this trip. On our first day, housekeeping was very slow. We left the room around 11:15-3:30 and they had not been in yet. They specifically cite 'twice a day' housekeeping but it was obvious that we only got one round of housekeeping service that day. The second issue- the club level was simply not worth it at all. When I think of club level, I think of snacks, beverages, appetizers, etc, located on a designated floor. This 'club' had a room in the basement with sodas and popcorn in a glass jar (no bowls to put it in or utensils to scoop it out). When we went downstairs the first day to check out the offerings, an employee was very short with us and said we were only allowed in if from 4:30-9, which had not been made clear to us. Not sure why the door would be wide open if it was closed but it wasn't worth it anyway as, as I said, just bottled soda and popcorn. The extent of our 'club level' use was 2 bottles of soda. I was pretty frustrated by that as we had paid a lot more than the cost of a couple sodas for the upgrade. I highly recommend skipping this; very disappointing. The employee's rudeness was also very off-putting.\nThe elevator was also very slow but we were on the second floor so we often just took the stairs. At one point I almost slipped and fell in the lobby so be careful if you are wearing heels.\nOverall, this was probably hovering around a 3.5-4 due to some service issues but I rounded up to 4 stars because of the numerous things I appreciated. I would stay here again because of the excellent location.", "external_links": [], "published": "2017-03-10T02:00:00.000+02:00", "crawled": "2017-03-28T00:59:13.374+03:00", "highlightTitle": ""}