{"organizations": [], "uuid": "e4bf7929e56b94711a19476f0747fcbe1acf306c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/1b/88/7e/the-milestone-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d193121-Reviews-The_Milestone_Hotel-London_England.html", "section_title": "The Milestone Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193121-r471167554-The_Milestone_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "perfection", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "perfection - Review of The Milestone Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "e4bf7929e56b94711a19476f0747fcbe1acf306c"}, "author": "loml95", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193121-r471167554-The_Milestone_Hotel-London_England.html", "ord_in_thread": 0, "title": "perfection", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "we stayed at the milestone in november 2013. and since that time i have been telling anyone who will listen that it is my favorite hotel ANYWHERE. and we have stayed at the four seasons in europe and the u.s. and the de russie in rome. (which is in my top 5 favorites) so i was a bit nervous because it is sometimes true, you can't go back again. but not at the milestone. this hotel has all the pampering of any 5 star hotel but it has the warmth of the best boutique hotels.\nwe stayed in a junior suite on the sixth floor and loved the privacy and sort of secluded feel of that floor. the room was spacious and comfortable with a great shower, so important, and a king bed loaded with pillows! i love extra pillows.\nroom service was fast although it was usually just drinks or coffee. the nespresso machine is a nice touch. and once they learned our favorite drinks, the fridge was usually loaded with them. the breakfast room is lovely, again super efficient staff but really with the added warmth you just don't get at the larger properties. the concierge made all our reservations, including great seats at a great show.\nnot sure what else to add except we can't wait to go back.\njust some personal recognition for andrea massari, the concierge i dealt with most frequently though they were all all great, jose as well. in the breakfast room we loved them all, but magda went the extra mile and sent us off to the train\nwith a lovely box of my favorite pastries. other names i recall are pedro who welcomed us and showed us room after room until we were happy without ever making it feel like a bother. colin picked us up from the airport and i think it was patricio who took us to the train. marvin and george i think were at the door or anywhere when you needed.\nwe hope to see you all again soon.\nand our deepest appreciation for all that you all did....", "external_links": [], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-30T16:06:27.206+03:00", "highlightTitle": ""}