{"organizations": [], "uuid": "7d7fe317825a6061a0d51f045743fbeb8ab06bc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/02/5d/c0/e4/the-lounge.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d195198-Reviews-Crowne_Plaza_London_Kensington-London_England.html", "section_title": "Crowne Plaza London Kensington - UPDATED 2017 Hotel Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d195198-r470437279-Crowne_Plaza_London_Kensington-London_England.html", "country": "US", "domain_rank": 189, "title": "Excellent in every way", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Excellent in every way - Review of Crowne Plaza London Kensington, London, England - TripAdvisor", "spam_score": 0.009, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 1, "uuid": "7d7fe317825a6061a0d51f045743fbeb8ab06bc7"}, "author": "TrA11", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d195198-r470437279-Crowne_Plaza_London_Kensington-London_England.html", "ord_in_thread": 0, "title": "Excellent in every way", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "All of the previous positive reviews you read about the Crowne Plaza are true. My wife, son and I stayed for 6 nights from 3/13-3/19 and we could not be more pleased with our choice. It is a great location very close to the tube station. Easy access to almost everywhere in London. Many choices of places to eat within walking distance. But don't overlook Ken's Bar in the lobby. Great food, drinks and service at a very reasonable price. Clean, comfortable rooms. We had a two bed room. WE found the beds were decent size and we have a great view of the garden. We hardly heard any hall noise. Wi-fi never failed us during our stay. PC access available with printer if needed. Wonderful secret garden which is a welcome sight in the city. Two items to make sure I highlight. First, every member of the staff was superb. We could not ask for better service. Everyone was friendly and helpful. Second, the breakfast (regular breakfast, not the club level) is truly spectacular. Again, the staff was great and began to remember our orders each morning! The buffet has great selection and there are number of cook to order items. Rita and everyone there does a great job and should be highly commended. We decided on the Kensington area to stay based on recommendation of friends, and decided on the Crowne Plaza based on Trip Advisor reviews. We are so glad we listened to both of these recommendations!\nRoom Tip: Ask for a view of the garden if available See more room tips", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-31T16:23:10.551+03:00", "highlightTitle": ""}