{"organizations": [], "uuid": "7858d40a725441bae9c38a544e1320bdc551b243", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/a4/d5/6f/hotel-exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d6678144-Reviews-The_Peninsula_Paris-Paris_Ile_de_France.html", "section_title": "The Peninsula Paris - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d6678144-r468816068-The_Peninsula_Paris-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Better than a Palace", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Better than a Palace - Review of The Peninsula Paris, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "7858d40a725441bae9c38a544e1320bdc551b243"}, "author": "Pipworld", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d6678144-r468816068-The_Peninsula_Paris-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Better than a Palace", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We had an incredible four day stay at the Peninsula! When planning a return visit to Paris, we decided to pick a new area instead of the usual St. Germain des Pres. My main apprehension was the location of the Peninsula in the 16th, where we’d never been. Some guidebooks skip over the 16th entirely or I found some Marais lovers online saying the 16th is their least favorite area. Well, now we know, the Peninsula is located in a fabulous spot, I could easily live there. It’s a short stroll to the Eiffel Tower & Arch de Triomph, great museums, restaurants, we walked everywhere (late at night too) and enjoyed the safe and quiet streets.\nNow for the hotel, which is top notch, – I think our new world favorite. The quality of the materials in the room, the ample dressing area with plenty of drawers (we don’t pack lightly), the comfy bed, the gorgeous bathroom with separate areas for shower/tub/toilet. Also, the bathroom had two sinks (with ample drawer space) on either side of the room. If you forgot something, they had toothbrushes (& Crest toothpaste), shavers, shave cream, etc. It was my birthday and they made me feel so special! I sent photos home to my friends and they flipped over the gorgeous bouquet & cake I received.\nThe food was also wonderful. Breakfast was great with healthy options and I flipped over the LiLi breakfast, which I’m still craving. We also had a delicious lunch at LiLi – the best hot/sour soup (made with shredded chicken) we’ve ever had (better than Hong Kong).\nThe security of the hotel is important as well and we felt this was one of the most ‘secure’ of anywhere we’ve ever stayed. We loved the complimentary mini bar & movies and the (easy to use) high tech panels in the room. There was a nice desk with a printer and outlets – perfect, as my husband had to get on his laptop and take care of a work issue, which he got done in record time with no issues.\nAmazingly, we never needed to request anything. The staff was so kind and made sure we were comfortable and well looked after. The concierge (Pierre/Harold) helped with great restaurant reservations and museum tickets, Guest Relations: Camille – who greeted us on arrival, gave us a thorough tour of the hotel and was sure to seek us out to wish us a farewell and Geoffrey who drove us to our next venue & Alexandre (Front Desk). They were all stars! The positive feeling we got throughout our stay is a testament to the management of the friendly and energetic General Manager, Katje Henke, as everyone we encountered was a true professional.\nOur only regret was that we didn’t take the time to use the spa, gym, pool or have dinner at L’Oiseau Blanc. We will just have to return, asap.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-27T03:35:51.281+03:00", "highlightTitle": ""}