{"organizations": [], "uuid": "170940a2fbc78ec4e65533ccd608efa077c87d95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/f7/ea/f9/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d194278-Reviews-Artus_Hotel_by_MH-Paris_Ile_de_France.html", "section_title": "Artus Hotel by MH - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d194278-r468816628-Artus_Hotel_by_MH-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Paris is a wonderful city! - Review", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Paris is a wonderful city! - Review of Artus Hotel by MH, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 1, "uuid": "170940a2fbc78ec4e65533ccd608efa077c87d95"}, "author": "F96PVamandam", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d194278-r468816628-Artus_Hotel_by_MH-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Paris is a wonderful city! - Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I was overly impressed with the Artus Hotel and the city of Paris. This was my husband and I's first trip to Paris ever and my selection of the Artus Hotel was based mainly on location, but also on aesthetics because it just looked so cool and different from all the other hotels I viewed. The concierge staff was very helpful and spoke English very well! They were willing to help with any request that we had. If we get the pleasure to return to Paris in the future we would gladly stay in this hotel again. Here is a break down:\nLocation: We could not have had a more perfect location for our trip to Paris. This was a surprise 30th birthday trip for my husband, who is an artist, so the main purpose for this trip was to visit as many museums as possible. We mainly walked to every location that we wanted to see within a 30 minute walk! We did take the Metro some as well, and there was a convenient metro entrance only 1 block away from the hotel. Each day we walked either up above the Seine river or to the East or West of the hotel, so everyday we walked past new areas that we had never seen before. The location was perfect for shopping, eating, and sightseeing.\nStyle/Comfort: This hotel is visibly stunning, they mix so many bold colors that you wouldn't think look good together, but it works and looks amazing. We stayed in The Classic Room Pop (Les POP) and it was really cool looking with bright yellow and red colors. The room was somewhat small, but I read that most hotel rooms in Paris are small. It didn't feel uncomfortable being small, it was just cozy. The bed was on the stiff side, and my husband and I didn't sleep very well on the bed. Our legs were usually sore after walking all day, and sleeping on a stiff mattress didn't help.\nBathroom/Shower: The shower was a very large standing shower with a huge rain style shower head on the ceiling. The only issue, was the door didn't shut all the way so it leaked water a little onto the floor while showering so we just had to ring out the floor towel mat after showering. They changed the towel every day so there was never an issue of needing to use a wet towel. The toilets in Paris are different than American toilets. The toilet is in a room all by itself and you can close the door, however any noises made in that room echo in the hotel room! This was not just the hotel toilet, but all toilets in Paris, they just hold little water in the base, amplifying sounds.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-27T23:49:01.719+03:00", "highlightTitle": ""}