{"organizations": [], "uuid": "dfa6d85f9c6fa880e844d99b991e2f7b33661f47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/2b/21/8e/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d497689-Reviews-The_Soho_Hotel-London_England.html", "section_title": "The Soho Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d497689-r462559971-The_Soho_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "TWENTY-FOUR HOURS OF SHEER AND UTTER BLISS!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "TWENTY-FOUR HOURS OF SHEER AND UTTER BLISS! - Review of The Soho Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-24T02:00:00.000+02:00", "replies_count": 0, "uuid": "dfa6d85f9c6fa880e844d99b991e2f7b33661f47"}, "author": "Alex J", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d497689-r462559971-The_Soho_Hotel-London_England.html", "ord_in_thread": 0, "title": "TWENTY-FOUR HOURS OF SHEER AND UTTER BLISS!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My husband and I were going to a concert at The London Palladium and decided at the last moment to treat ourselves to a nights stay at The Soho Hotel as were we also celebrating a special occasion.\nWhen we checked in, we were given a very warm welcome by Helen (one of the reception staff) who very kindly offered us an upgrade from a deluxe junior suite to 'Room 504'. We had no idea what 'Room 504' was, but Helen assured us that we wouldn't be disappointed. That turned out to be the understatement of the year!\nWe were absolutely stunned when we opened the door to 'Room 504'. It turned out to be the most beautifully designed huge rooftop room with an enormous terrace offering stunning skyline views of London. The super-luxurious marble bathroom featured a majestic free standing bath and walk-in shower that could have happily housed a small party.\nEvery detail in the spotless room was nothing less than perfect. Gorgeous toiletries (RikRak - the hotel's own brand), a luxuriously stocked mini-bar, beautiful flowers, exquisite linen, an extensive spa menu, fabulous eclectic interior design....the list goes on and on. There really was everything we could have asked for and more besides.\nShortly after we arrived a lovely welcome note and gift of some sublime RikRak pillow and linen spray was sent up to our room by the Deputy General Manager (Charlotte Oberg). This was such a wonderful and unexpected touch. I rang Ms Oberg to thank her for both the gift and the upgrade and during our conversation, mentioned that we were celebrating a special occasion.\nWhen the tea and cake that I'd ordered arrived (tip:try the raspberry cupcakes, they're out of this world...no ordinary cupcake for sure!), the plate was iced with a celebratory greeting and there were two glasses of complimentary champagne next to the cake! Having stayed in many world class hotels across the globe, in our experience this level of thoughtfulness is very rare indeed.\nThe room service was incredibly fast and the Concierge could not have been more helpful, both checking the start time of the concert for us and even popping out to get me some hair tie-backs when I realised I'd left mine at home. Simply nothing was too much trouble for the hotel staff who really are a credit to the management and owners of Firmdale Hotels.\nThe bed was hands-down the most comfortable we've ever slept in. I'm not a very good sleeper, but on this night, thanks to the sound-proofing in the room (I might add that Storm Doris was causing havoc outside but we didn't hear any of it!), the ridiculously comfortable mattress, softest linen, excellent sensitive air conditioning and aforementioned pillow spray, I slept like a baby and felt more refreshed than I have in a very long time when I awoke.\nI had breakfast in the room as I wanted to enjoy the views for a bit longer and my husband ate in the Refuel restaurant, both were excellent with a long,varied menu catering to a very wide range of tastes.\nAfter checkout (when I absolutely HAD to buy myself some of the RikRak toiletries that we'd used in the room and a candle to take home!), the concierge stored our bags and we had coffee in the very chilled out drawing room before heading home.\nWe were both feeling tired and rather run down on the day we checked in to the hotel, but by the time we left, we felt throughly relaxed, recharged and very happy indeed. This was the perfect way to hit the reset button for two stressed out Londoners in need of a break.\nI cannot recommend The Soho Hotel highly enough. Situated right in the middle of the capital, it's the perfect place for any traveller who wants to explore the buzz of the city and all it has to offer, but is also a peaceful oasis once you're inside the building. Similarly if a Londoner just needs the ultimate destination for rest and relaxation, this is the place to check in.\nTo sum up, The Soho Hotel really did provide us with twenty-four hours of sheer and utter bliss. We will most certainly be returning in the near future. 10/10", "external_links": [], "published": "2017-02-24T02:00:00.000+02:00", "crawled": "2017-03-26T20:21:18.528+03:00", "highlightTitle": ""}