{"organizations": [], "uuid": "b64f0672992cf6bd9953c1faf52ac1cad4c8041f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/8f/d6/56/de-la-tamise-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d595771-Reviews-Hotel_La_Tamise_Esprit_de_France-Paris_Ile_de_France.html", "section_title": "Hotel La Tamise - Esprit de France - UPDATED 2017 Reviews &amp; Price Comparison (Paris) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d595771-r469374419-Hotel_La_Tamise_Esprit_de_France-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "The best nineteen room hotel in the world", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "The best nineteen room hotel in the world - Review of Hotel La Tamise - Esprit de France, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-22T02:00:00.000+02:00", "replies_count": 0, "uuid": "b64f0672992cf6bd9953c1faf52ac1cad4c8041f"}, "author": "ELVUHZZ", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d595771-r469374419-Hotel_La_Tamise_Esprit_de_France-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "The best nineteen room hotel in the world", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My wife and I stayed in room # 12 for four nights. The location is the BEST in Paris for tourists, in my humble opinion. It is between the Tuileries Gardens, the oldest park in Paris and Rue Saint Honore, one of the top fashion streets in Paris and Rue d'Alger itself is very quiet. It is a highly tech-savvy hotel and is fantastic in its efficient use of room space. But, for us, the team at the hotel made this the perfect choice. We dealt primarily with four people and, while it may seem silly to some, we gave them all titles: Ewa the Beautiful, Rodrigo with the Flashy Brazilian Smile, Pierre, the Brilliant One and, of course, Julien the Magnificent. Their care and lovingkindness will never be forgotten. Unfortunately, this was and will be our only visit to Paris. So, in May, 2016 I booked the last Classic room available for March, 2017 based on Trip Advisor reviews. My wife was so thrilled with La Tamise that I will probably be treated extra nicely for at least the next two weeks. The staff at La Tamise, I can honestly say, made the City of Light sparkle just that much more for us. Nous adorons Hotel La Tamise!\nPS- My wife told Ewa she was beautiful but I can confirm that.\nPSS- Even though we used many superlatives to describe you, please, the four of you, remain humble and amazing.\nPeace to all our fellow TripAdvisor travelers.\nEd and Cynthia\nRoom Tip: Our room was on the street but the windows close so tightly that we could hear nothing. See more room tips", "external_links": [], "published": "2017-03-22T02:00:00.000+02:00", "crawled": "2017-03-26T18:36:45.604+03:00", "highlightTitle": ""}