{"organizations": [], "uuid": "6a7232607583240ac551748a41a1ab3455aed547", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/32/e0/79/exterior-night.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d205044-Reviews-Hotel_Artemide-Rome_Lazio.html", "section_title": "Hotel Artemide - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d205044-r471460129-Hotel_Artemide-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Top Hotel - Don't hesitate to book!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Top Hotel - Don't hesitate to book! - Review of Hotel Artemide, Rome, Italy - TripAdvisor", "spam_score": 0.162, "site_type": "discussions", "published": "2017-03-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "6a7232607583240ac551748a41a1ab3455aed547"}, "author": "philadelphus", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d205044-r471460129-Hotel_Artemide-Rome_Lazio.html", "ord_in_thread": 0, "title": "Top Hotel - Don't hesitate to book!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Check in was friendly and efficient. Our room, 323, was not large but contained everything we needed for our four night stay. Bonus of being at the back of the hotel, no road noise, we got an excellent sleep! Not bothered about no view from the window, there's so much to see in Rome, you're not going to spend much time in the bedroom unless you're asleep! Lighting in the room was very good for bedtime reading and walls not so thin that you could hear next room's TV! Furnishings, bed linen, towels etc excellent quality and all quite new. The hotel is beautifully designed and decorated, especially the lovely light fittings! Hotel very clean throughout, and everybody genuinely friendly and helpful. Amazing breakfast, lots of fresh items to set you up for the day. Hotel staff give you a map, Metro is less than five minutes away but we only used it once, to the Vatican, (e1.50) but walked back. Rome is so interesting it's a shame not to walk to all the sights, pop into a church or three, have an ice cream on the way. We ate in the hotel restaurant one evening, it was delicious but expensive, we followed the recommendations of the reception staff for our other evening meals and all were good. There are tea making facilities in your room, together with a fridge stocked with beer, water and soft drinks, refilled each day and complimentary. There's also a comfortable lounge area with yet more tea making facilities! The free wifi is very good and a free safe in the room. Will be recommending this hotel to all our friends and family, it is in a really good position for all the sights, and only a 10 minute walk from the Termini station, which takes you straight back to the airport, e14 each way.\nRoom Tip: We probably had one of the smallest rooms in the hotel with no view, but it was still excellent! See more room tips", "external_links": [], "published": "2017-03-30T03:00:00.000+03:00", "crawled": "2017-03-31T11:09:14.426+03:00", "highlightTitle": ""}