{"organizations": [], "uuid": "1fa4a77ff6fb6362c2186c61705cc8d6ee9df1e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/9e/b1/08/nobleden-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d7363884-Reviews-NobleDEN_Hotel-New_York_City_New_York.html", "section_title": "NobleDEN Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d7363884-r469713353-NobleDEN_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Cool contempoarary spot in good location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Cool contempoarary spot in good location - Review of NobleDEN Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 1, "uuid": "1fa4a77ff6fb6362c2186c61705cc8d6ee9df1e3"}, "author": "Alan M", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d7363884-r469713353-NobleDEN_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Cool contempoarary spot in good location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This is a great little hotel, we really enjoyed our stay here. The hotel itself is no frills, a boutique hotel with no gyms, swimming pools, vast lobbies and restaurants but it hits the nail on the head.\nIt is located downtown Manhattan. Its hard to spot among the hussle and bussle. The hotel is in the middle of a block, to the left is Chinatown and to the right is little Italy. Its right on the border. The lobby and reception area is small, clean and modern. There is a reception desk which is always manned.\nThere is no breakfast available but who goes to NY to eat in a hotel anyway?! Accross the road is 'Baz' bagels where you can get awesome bagels and plenty of cafes within 5 minute walk. There is a coffee machine next to the lift and you can help yourself to coffee, tea and hot chocolate anytime. At 7:30 each morning a tray of pastries is delivered from the bakery on the far side of the street. Its first come first served but we usually found a few left even when we were late up. What we usually did was run accross the road for bagels abd bring them back, get coffee and pastries in the lobby and eat them in our room. Perfect! When we hit the road each day the kids took a hot chocolate.\nThe rooms and lay out are ultra modern. We loved it. Again no frills so dont expect arm chairs but uber contemporary. Huge flat screen tv, nice beds, lovely decor. The highlight was the open plan bathroom area which consists of a sink in the hall area with a huge mirror that lights up when you touch it, a seperate toilet room and a huge awesome shower room yu could swing several cats in with the shower head above you given the \"rain type\" experience.\nFrom our window we had a view of the Empire State building. When we arrived the kids were delighted to find a toy monkey on the bed for them.\nYou are spoiled for places to eat so I wont even start but you wont be stuck, whatever you pleasure. The subway is a few blocks away, Spring Street is in a trendier neighborhood but Canal St is the same distance and can get you anywhere in Manhattan.\nIt was only when we were leaving that by accident we went in the lift to the roof... wow! You have a view all over the city.\nWe had young kids with us and felt welcome. No unapproving looks or elderly guests and the manager even showed us how to make the best hot chocolate. We also ate pizza in the room a couple of times and Allan at reception said that was cool so nice a friendly atmosphere.\nIf you want to hang around a leisure centre all day pay double the price and go somewhere else but if like us you want to hit the streets of the Big Apple go to Nobel Den for an ultra-cool boutique experience.", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-29T03:35:55.320+03:00", "highlightTitle": ""}