{"organizations": [], "uuid": "f01c862262ca2e6d914262d7089079e4b1e1103c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/fe/2d/b5/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g32715-d80687-Reviews-The_Westin_San_Francisco_Airport-Millbrae_California.html", "section_title": "The Westin San Francisco Airport - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Millbrae, CA) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g32715-d80687-r467491798-The_Westin_San_Francisco_Airport-Millbrae_California.html", "country": "ZA", "domain_rank": 189, "title": "Very convenient for airport transit", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Very convenient for airport transit - Review of The Westin San Francisco Airport, Millbrae, CA - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "f01c862262ca2e6d914262d7089079e4b1e1103c"}, "author": "ptseng", "url": "https://www.tripadvisor.com/ShowUserReviews-g32715-d80687-r467491798-The_Westin_San_Francisco_Airport-Millbrae_California.html", "ord_in_thread": 0, "title": "Very convenient for airport transit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The location of this hotel is excellent as it is only about 5 minutes from the airport. The pick up shuttle operates every 15 minutes from the hotel courtesy shuttle stop just outside the domestic terminal. So getting to the hotel from the airport is very easy. The driver was helpful in transferring our three suitcases onto the shuttle.\nAlthough I and my wife arrived at the hotel around 9 am in the morning, the hotel allowed us to check into our room just after 10 am without any extra charge. After a long flight with severe jet-lag, that was a nice touch.\nThe other good thing about the hotel location is that it is right on the Bay, or the shoreline of the Bay is just across the road. We arrived on a cool but beautiful and sunny day. I went for a long walk before checking in the hotel, and there was a nice walking trail along the shoreline that runs for at least a few miles. There were quite a few people walking and jogging, taking in the view of the Bay and the sight of numerous planes lining up for the take-off on the runway. There were lots of wild ducks and geese in the area along the shoreline. It was a very enjoyable walk .\nThe size of the hotel room we had was rather spacious, with room to spare even though there were two double beds. The amenities in the room were good and standard for a Westin hotel of this class. The only minor disappointment was the absence of a kettle for boiling water or for making tea. Instead, there is a small coffee making machine which is not very user friendly if only boiling water is required, as the boiled water (one cup only) will only come out in drips and drops. The Wifi in the room was not free ($ 10 daily). However up to 3 devices can be used.\nWe did not get a chance to try the food in the restaurant. The menu appears to be mainly American and the prices were on the high side. I did use the swimming pool in the morning and the water was rather chilly even though the pool is heated. There is also shuttle service to the nearby Burlingame shopping strip but we did not get the chance to use it.\nOverall, for passengers on transit for a one night stay, this hotel meets the requirements at a reasonable cost.", "external_links": [], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-26T18:35:15.715+03:00", "highlightTitle": ""}