{"organizations": [], "uuid": "adf41b0364791001550f2f934b2faaca40b897cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/04/90/a2/6b/guest-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d232849-Reviews-Antico_Palazzo_Rospigliosi-Rome_Lazio.html", "section_title": "Antico Palazzo Rospigliosi - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d232849-r470638456-Antico_Palazzo_Rospigliosi-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "An Amusingly Eccentric Experience", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "An Amusingly Eccentric Experience - Review of Antico Palazzo Rospigliosi, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "adf41b0364791001550f2f934b2faaca40b897cd"}, "author": "Mike C", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d232849-r470638456-Antico_Palazzo_Rospigliosi-Rome_Lazio.html", "ord_in_thread": 0, "title": "An Amusingly Eccentric Experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My wife booked us in to the Antico Palazzo Rospigliosi for a surprise weekend birthday trip. Travelling in March, the weather was pleasantly warm without being too hot; shirtsleeves are adequate although a light jacket or top might be needed for dining out in the evenings.\nThe location was good, a relatively easy walk from the Termini railway and bus terminus (the name 'Termini' is coincidental), the area boasts many small places to eat and drink, as well as a coupe of small supermarkets and the inevitable souvenir shops. Travel by underground or bus is easy (get a travel pass - better still the Roma ticket which also entitles you to a couple of free museum entries), although walking the narrow but exceptionally picturesque streets is a pleasure all in itself.\nThe building itself dates from the late 1500s and has been the palatial home to many important Roman families. It encompasses a cool central courtyard garden with a central pool and garden furniture. There are also a couple of magnificent large rooms which hold books and paintings - these are evidently rooms that the hotel could not turn over to accommodation, either out of a sense of history or by government order. The lifts and stairs are an adventure. One set takes you to half the building, and then you have to descend to the ground floor to take another set to get to the other half of the building. We spent some time exploring and I'm sure that we passed through several dimensional gateways and ended up back where we started via impossible geography. Should going up a set of stairs really land you lower down than you started?\nOur bedroom windows (room 201) faced onto the main street, the Via Liberiana, but across the road our view was blocked by a large building. However, given that the building in question was the Basilica of Santa Maria, originally built in the C5th AD and systematically added to and rebuilt between the C12th and C18th, we didn't feel too hard done by... Our room had full-height balcony windows (but no protruding balcony)and it was fun to sit and watch the people in the street below. The bed was excellent - wide (two separate mattresses rather than a single large one) and very comfortable, with comfy pillows. It was tastefully and respectfully decorated, and came with a mini-fridge (unstocked) and safe.\nBreakfast (agreeable served up until 10am) was a fairly basic selection of cold meats, rolls and pastries. There was a facsimile of a cooked breakfast but this was (cold) overcooked fried eggs, pieces of Frankfurter-style sausage and cannelloni (?) beans in a tomato sauce. Never has eggs, sausage and beans looked less appetising as a breakfast. The coffee machine showed what the hotel believed was important for a breakfast, and that machine made better coffee than those high-street 'coffee'-selling corporate chains. You may not get a fried breakfast in the hotel, but by gum you'll be awake when you leave for your sightseeing.\nThe bathroom was... less good. Space and the need to work with a listed building meant that the room was deep but very narrow. With an obstacle course line-up of sink, toilet and bidet, reaching the (roomy) shower cubicle at the end meant treading carefully. Once in the shower things were not much better. The shower unit itself promised much - it was a large stainless steel contraption that appeared to offer anything from a relaxing shower to a cup of cappuccino. Sadly it delivered neither. A large fixed overhead shower rose managed a barely adequate flow of lukewarm water that heated slightly over time to grow from tepid to body-temperature. The flexibly-hosed side showerhead was somewhat better (having a more concentrated flow), and the three vertically-arranged fixed 'jacuzzi'-style jets were simply odd. You moved between each arrangement with a handle - I would have loved to try all three simultaneously but that wasn't possible, possible for reasons of water pressure or possibly for reasons of good moral taste.\nThe electrics were similarly slightly suspect, and possibly again for reasons of practicality in converting such an old and important building. We never did work out what all the light switches were meant to do, I'm sure that somewhere downstairs someone was being subject to an impromptu son et lumière performance. The lighting is subdued to the point of making reading very difficult except next to a bedside lamp or the window. The bulb in our bathroom over-mirror light was highly erratic, occasionally fading out before buzzing and flickering. We reported it but nothing appeared to have done by the time we left. In truth, it may have behaved when the maintenance man looked at it. More worryingly, within the shower cubicle was a (tied-up) pull-cord. In the pursuit of knowledge and possibly a warmer shower, my wife gave the cord a tentative tug whilst showering. The whole switching unit promptly fell out, held up only by the electrical cables behind. There was no sign that the unit had been attached within its hole in any way except friction and blind optimism. After turning off the shower my wife bid a hasty retreat and I carefully pushed the unit back into its uncertain cave.\nSo, in summary. The hotel is beautiful and is certainly the oldest I have stayed in by some centuries. Playing at being a Renaissance merchant prince is worth staying here for the entertainment value alone. The room was clean and nicely decorated, with a few scuffs and dents. The bathroom is probably as good as you are going to install in a listed building in the middle of Rome. Yes, a larger room and power shower would have been nice, but knocking-through 400-year-old mansions and draining the capital's limited water supply is frowned upon. The electrics are more alarming but again, the building's age limits what can be done. Breakfast is evidently not an important meal in Rome, and with the profusion of bakeries and street cafes you will not miss being unable to pig out on your morning fry-up.\nI recommend the hotel, but you should be aware of its limitations. Take on board what I and others have written and make your decision - remembering that Rome is outside and your room is only the place to sleep and change clothes for the evening's promenading.", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-29T15:31:04.167+03:00", "highlightTitle": ""}