{"organizations": [], "uuid": "8fe33defd5df03282130e7d5d4b80393ff135e04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/06/af/92/sanctuary-hotel-lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93525-Reviews-Sanctuary_Hotel_New_York-New_York_City_New_York.html", "section_title": "Sanctuary Hotel New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93525-r471099284-Sanctuary_Hotel_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Perfect! - Review", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Perfect! - Review of Sanctuary Hotel New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "8fe33defd5df03282130e7d5d4b80393ff135e04"}, "author": "bbn1122", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93525-r471099284-Sanctuary_Hotel_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Perfect! - Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After messy up my reservation. Manager, Jeremy Poon came thru with flying colors and saved the day. Thank you. You made our 29th Anniversary a success.\nI was looking for a comfortable and romantic hotel for our Anniversary night in NYC with Dinner and Theatre. I am so happy I found the Sanctuary. My hubby works in NY and hates to come back in but he did for me. I am very familiar with area having worked on Broadway and Avenue of the America. Our theatre was right off the Avenue and so was our resestaurant, so being able to navigate the area without having to drag my hubby thru the caos of Broadway was great.\nWe were greeted as soon as we arrived in front of the hotel. Note: We parked right across the street. Perfect. Our luggage was taken from us and we were shown to the front desk. We were told about the amenities of the hotel and where the Contintential Breakfast would be served. We went up to our room on the 4th floor, which looked exactly like the photos online. It was appointed perfectly. Our luggage arrives as promised with 5-10 minutes. We were then off to our dinner which was happily a block away and the theatre two blocks away. Easy travel.\nWhen we arrived back to our room for the night there was a note card wishing us a Happy 29th Anniversary and the offer of some sparkling wine. We were thrilled but did not take the hotel up on their offer. Thank you Sanctuary. The gesture was lovely.\nThe spilt bath area was great. Water closet with toliet and sink. And exterior area with sink and shower. The exposure shower are does have a heavy curtain that can be pulled over for privacy. The bed was okay, pretty comfy. The TV was large with plenty of channels.\nIn the morning we went down for breakfast. The Continental Breakfast looked pretty good but we decided to have something off the menu for an additional cost. I had the Vegetable Frittata and my husband had the Egg Sandwich with sausage. Both were very good and the price was fine.\nWe will definitely look to stay again at the Santuary the next time we are in the area. It really is a hidden gem. We did not get to take advantage of the roof top area, The Haven or the restaurant Tender. But both looked like something we would loved to try in then future.\nSanctuary Staff you are definitely doing it right!", "external_links": [], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T04:32:04.360+03:00", "highlightTitle": ""}