{"organizations": [], "uuid": "8f3ebda1fc563dc17a1e780b5362fd41e2c9640b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/04/87/01/7f/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d203130-Reviews-Hotel_Canada_BW_Premier_Collection-Rome_Lazio.html", "section_title": "Hotel Canada, BW Premier Collection - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d203130-r467426710-Hotel_Canada_BW_Premier_Collection-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Beautiful Hotel -", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Beautiful Hotel - Review of Hotel Canada, BW Premier Collection, Rome, Italy - TripAdvisor", "spam_score": 0.674, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "8f3ebda1fc563dc17a1e780b5362fd41e2c9640b"}, "author": "magon121254", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d203130-r467426710-Hotel_Canada_BW_Premier_Collection-Rome_Lazio.html", "ord_in_thread": 0, "title": "Beautiful Hotel -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This hotel is small but beautiful. Marble floors. Lots of woodwork framing on the walls, paintings and drawings in hardwood frames, glazed terracotta tiles on the hall and room floors (Instead of the usual tacky carpets), a fully functional cage elevator, wallpapered hallways and rooms, comfortable beds, well maintained almost-antique furniture, generously sized rooms and bathrooms (this being Europe).\nThis is a family owned hotel, it would seem they take pride in it and want to give it an ambiance of times gone by. For me, it works.\nThat said, it's also quite modern, with all the conveniences. Small bar, pretty well stocked and offering MUCH more than pretzels to much on while enjoying a beer, wine or drink. Small but comfortable and yes, elegant, sitting rome off the bar.\nBreakfast is inexpensive, plentiful and varied. Quiche, scrambeld eggs, ham, fruits breads, juices, milk and mineral water. They offer American and that delicious espresso Italian coffee. The staff can be a bit shy if their English isn't very good. Try speaking Italian to them, and watch their warm nature come out. but whether you do or don't, they're pleasant, helpful and polite. Erver at the front desk stands out. Efficient, helpful, respectful and outgoing (He speaks excellent, though slightly accented, English.) and with a witty, wry sense of humor, if he gauges you'd be appreciative of it.\nIn short, if I'm in Rome, this is my hotel.\nRoom Tip: I don't think it makes much of a difference which room you choose. Though a busy street, it&#39... See more room tips Green Features: They try to convince you to hold onto your towels for a couple of days, to cut down on the water use.", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-28T03:29:13.951+03:00", "highlightTitle": ""}