{"organizations": [], "uuid": "4c8c81b674d18110c6b99ff5c41036ea494e2b54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/26/34/f0/hotel-wo-wilson-opera.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d678590-Reviews-Hotel_WO_Wilson_Opera-Paris_Ile_de_France.html", "section_title": "Hotel WO - Wilson Opera - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d678590-r466344568-Hotel_WO_Wilson_Opera-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Best Hotel in Paris - highly recommended!!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Best Hotel in Paris - highly recommended!! - Review of Hotel WO - Wilson Opera, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-11T02:00:00.000+02:00", "replies_count": 1, "uuid": "4c8c81b674d18110c6b99ff5c41036ea494e2b54"}, "author": "KejyTrips", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d678590-r466344568-Hotel_WO_Wilson_Opera-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Best Hotel in Paris - highly recommended!!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed for 2 nights at the end of Feb-beginning of March.\nWe absolutely loved everything about this hotel and we will definitely choose to come here again next time we visit Paris. I don't write many reviews, but this hotel was so outstanding, I wanted to share my experience.\nThe staff were just brilliant during our stay - as soon as we arrived we were welcomed warmly and we were provided with a metro map, a number of recommended restaurants in the area (as well as information about when we would be best to visit them) as well as information about the hotel such as wifi, room service, breakfast and everything we might need. Despite my lack of French, the staff spoke perfect English - we met several staff during our visit and each of them were fantastic, really friendly, really thoughtful and helpful. What a team!! The hotel is great, but as the other reviews say, the staff make it even better.\nI also had excellent help before I arrived at the hotel, I emailed to ask about which train route I should take and they replied quickly with the best route. I also contacted the hotel to ask if they could help me arrange a surprise room upgrade and champagne for my partner, whose birthday it was. Once again, the replies were fast and the information was really useful. Along with the champagne and room, the team also wrote a happy birthday note and provided some macarons for my partner which were a wonderful surprise - he was so happy!\nThe room we stayed in was outstanding (602). The view of the Eiffel Tower was beautiful, especially at night when it would light up every hour! And waking up with the bed facing it, made you feel like you were somewhere special. The photos of the Eiffel Tower view don't do it justice, it feels much closer when you are there on the balcony. The amenities inside the room were great too - I can't think of one thing we were missing. We had everything from shampoo, shower gel, hairdryer, tooth brush, shaving kit, shower cap, sewing kit, coffee machine, glasses, bathrobes, slippers and more! The TV in the room had a number of channels in english and the bed was very comfortable after a days walk around the city, we drifted right off!\nIn terms of location, it is extremely close to Gare Saint Lazare making it easy for you to get to via train/metro (we travelled from CDG airport). But you can also walk to the main landmarks very easily too. When we left, we still had a full day before our flight and the hotel let us leave our bags there for the day and when we came back, they let us sit down in the reception, have some water and pack our shopping into our suitcases. They also checked we knew which train route to take back to the airport.\nWe had breakfast in the hotel both days which covered everything you might want to prepare you for the day, there was a good variety of food and drinks to suit your preference. And after arriving a little late in the evening, we also ordered from the room service menu, which was delicious!!\nAlthough we upgraded for my partners birthday, I would certainly say that the quality of the hotel was so good that all of the rooms there would be a very high standard no matter which room you were in. (although we did love being able to see the Eiffel Tower, that was a big bonus!) The prices were reasonable for all rooms, especially given the location.\nWe'll certainly be back again next time! Thank you for such a lovely trip Hotel WO!", "external_links": [], "published": "2017-03-11T02:00:00.000+02:00", "crawled": "2017-03-27T13:45:22.273+03:00", "highlightTitle": ""}