{"organizations": [], "uuid": "3d7e4d7048419276ae4f6ad7a9806ef9a840116f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/1b/88/7e/the-milestone-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d193121-Reviews-The_Milestone_Hotel-London_England.html", "section_title": "The Milestone Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193121-r467320541-The_Milestone_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Exceptional Experience", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Exceptional Experience - Review of The Milestone Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "3d7e4d7048419276ae4f6ad7a9806ef9a840116f"}, "author": "Odysseus2017", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193121-r467320541-The_Milestone_Hotel-London_England.html", "ord_in_thread": 0, "title": "Exceptional Experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Our family (3 generations) planned a week-long stay in London making the Milestone our home for the entire week, as I had wanted this trip to bring us all together for a very nice time. We were given adjoining rooms that we could close off as a suite and were welcomed with a series of wonderful sweets and treats and personalized gifts, including lovely book marks from South Africa for my mother and me, and a plate of personalized tea cakes accompanied by a personal hand-written message of congratulations for my daughters who had just finished a set of exams at their school. These things just appeared in our rooms, like magic, and enveloped us in a feeling of well being. Breakfasts at this hotel were outstanding, from delicious tender haddock to kippers, poached eggs on salmon, brioche french toast, fresh squeezed juices. Simply delicious, served by very attentive, engaging staff. The welcome tea was equally wonderful, and the high tea we had one afternoon was sumptuous and beyond filling. Leftovers were boxed up in little red cardboard boxes and taken up to our room for us to continue enjoying later on. Dinner was good but more formal than we wanted, so one night we ate at the bar, which was fun, as the bar used to be the stables and the space is unusual. Other nights, we followed the excellent recommendations of of the many highly knowledgeable concierges. We were directed to a nearby Italian restaurant Otto Cento that was very very very good and to an extremely cozy british restaurant called Ffiona's that was both good and just plain fun to experience as Ffiona cooks (delicious lamb), serves, and sits down at your table to add up your check at the end (and she can talk and add at the same time). These stellar recommendations were all a part of what made the Milestone so great. The doormen were helpful every step of the way too, providing directions as we set out and welcoming us back when we returned. Our rooms were of modest size but well appointed and the beds were unbelievably comfortable We chose natural duvet filing and mattress pads and were all floating in a sea of down. The only drawback was getting the teens up in the morning. It was a bit hard travelling with very tired teens who did not always dress or behave as this parent would have wished, but again, though I felt embarrassed at times, the staff was too professional to express any displeasure. I really can't recommend this place enough if you want your trip to be very special. The location is also great - close to the tube and right across the street from Kennsington Gardens, and in walking distance to the Royal Albert Hall, the V&A, and other museums.", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-26T16:10:57.953+03:00", "highlightTitle": ""}