{"organizations": [], "uuid": "6e9590d41900f54173965f39113e193dbd97621b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/20/09/70/hotel-mademoiselle.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d233514-Reviews-Hotel_Mademoiselle-Paris_Ile_de_France.html", "section_title": "Hotel Mademoiselle - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233514-r465412352-Hotel_Mademoiselle-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Ideal for an overnight stay in Paris", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Ideal for an overnight stay in Paris - Review of Hotel Mademoiselle, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-07T02:00:00.000+02:00", "replies_count": 0, "uuid": "6e9590d41900f54173965f39113e193dbd97621b"}, "author": "AliceEM1992", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233514-r465412352-Hotel_Mademoiselle-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Ideal for an overnight stay in Paris", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As we were only staying in Paris for one night, I wanted to make sure we stayed as close to the Gare du Nord as possible, so that we could make the most of the short amount of time we had and minimise how long we spent travelling from the airport to the hotel and back. I booked Hotel Mademoiselle after seeing how close it was and reading several positive reviews.\nAfter walking five minutes from the Gare du Nord, we arrived ahead of check out time so left our bags at reception. The staff were very helpful, and even though we hadn't checked in properly yet, we were told to help ourselves to complimentary coffee and pastries in the breakfast area.\nWhen we got to the room a bit later, it was exactly what we needed. I had booked a standard double room, and even though it was compact, it was extremely clean and had everything we needed. The bed was extremely comfortable and the bathroom was more than adequate, with an overhead rainfall shower. There were coffee and tea making facilities, which came in handy in the morning as we had not booked to have breakfast. The dressing gowns and chocolates were also a lovely extra touch.\nWhen we checked out the next morning, we left our bags with reception to pick up in the afternoon before heading back to the airport. When we returned, we checked the train times back to the airport to find that there was a delay on the line. The receptionist was very helpful in explaining what was happening, and suggested alternative methods of getting to the airport in case we got to the station and the trains ended up being cancelled.\nAll in all, I would not hesitate to book again for a longer trip. Staff were extremely helpful and friendly, and the room was great value for money. This, and the excellent location of the hotel made it a great base for a whistle stop tour of the city.", "external_links": [], "published": "2017-03-07T02:00:00.000+02:00", "crawled": "2017-03-27T05:07:46.882+03:00", "highlightTitle": ""}