{"organizations": [], "uuid": "eb0cc480a4d3361842b9743590fa27ca8e283b14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/76/8a/d5/staybridge-suites-london.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d6787576-Reviews-Staybridge_Suites_London_Vauxhall-London_England.html", "section_title": "Staybridge Suites London - Vauxhall - UPDATED 2017 Hotel Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6787576-r469106904-Staybridge_Suites_London_Vauxhall-London_England.html", "country": "US", "domain_rank": 189, "title": "Well deserving of its excellent reputation", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Well deserving of its excellent reputation - Review of Staybridge Suites London - Vauxhall, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 1, "uuid": "eb0cc480a4d3361842b9743590fa27ca8e283b14"}, "author": "DL_Gunner", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6787576-r469106904-Staybridge_Suites_London_Vauxhall-London_England.html", "ord_in_thread": 0, "title": "Well deserving of its excellent reputation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I'm a big fan of the Staybridge concept, especially as I don't always feel like eating out when travelling by myself. Therefore, I was really looking forward to having a short stay in London at the Vauxhall Staybridge.\nThe hotel's a short walk from Vauxhall station (both the National Rail and tube stations). I'd recommend using the National Rail station as it is a bit closer to the hotel and the services into Waterloo are very frequent.\nI had a warm welcome at reception and my IHG membership was acknowledged.\nI'm always impressed with the security arrangements at Staybridge and Vauxhall is no exception: you need to use your key card to even get in the lift and then use it again to operate the lift. Very safe.\nI had a room on the second floor. Previously, I've always had a one-bed suite when staying at Staybridge, but I opted for the open suite this time and found it just as agreeable. The kitchen area was clean, tidy and well-equipped, with a cookie waiting for me on arrival. Very nice.\nThe bed was very comfortable and the small sofa at the end was also very nice. Perfect for relaxing or storing your things. The bathroom is quite small but had a good shower and everything I needed. One thing I would say – the hot water was very, very hot. I couldn't seem to get it at the right temperature, no matter how much I turned it down.\nHaving enjoyed Sky Sports at Staybridge before, I was delighted to have both Sky Sports and Sky Movies available. Perfect for when I was in of an evening. Moreover, Apple TV was also available. I was so impressed with this, as I had brought my iPad, so I was able to stream some movies to the TV.\nThe aircon worked well throughout and although the duvet was quite thin, it was very warm on those cold February nights.\nThe breakfast area was roomy and well stocked. The staff on hand were helpful and polite. There was also a pancake machine, which looked intriguing, alongside the usual fridge full of juices and a good continental selection as well as a hot offering.\nI'll definitely stay here again when I need a short London break. It ticks all the boxes.", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-30T02:02:18.274+03:00", "highlightTitle": ""}