{"organizations": [], "uuid": "ad9394e34e336db57755643a42050978aaa1d848", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/35/76/0e/dumont-nyc-one-bedroom.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d292142-Reviews-or10-Dumont_NYC_an_Affinia_hotel-New_York_City_New_York.html", "section_title": "Dumont NYC-an Affinia hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d292142-r467425312-Dumont_NYC_an_Affinia_hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "My 4th Stay - Great Hotel Overall", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "My 4th Stay - Great Hotel Overall - Review of Dumont NYC-an Affinia hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "ad9394e34e336db57755643a42050978aaa1d848"}, "author": "BidAsk13", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d292142-r467425312-Dumont_NYC_an_Affinia_hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "My 4th Stay - Great Hotel Overall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This was my 4th stay at Affinia Dumont, not counting my past stay at Affinia Shelburne. I love Affinia Dumont because of its great location and overall cleanliness of the hotel. I booked a Skyline Suite for 3 nights. Check in is at 3:00pm; however, when I arrived from from the airport at 3:00pm the room wasn't ready and I was asked to wait an extra 20 mins for housekeeping to finish up. Not a big deal at all, these things happen and it didn't bother me. Once we got to our room, everything was in order; nice and clean. The view of the city skyline was beautiful as always when you book a Skyline Suite. The rooms are quiet, unlike many New York buildings, where the walls leak sound from neighboring rooms. Another nice thing about Affinia Dumont is that the rooms have a kitchenette with a full sized fridge. Housekeeping always did a great job of tidying the room and making sure we had ample towels and toiletries. The front desk were friendly and quick to ring up any items we purchased with our daily resort credit.\nAlthough the stay was very pleasant overall (as it has been the last 3 times), I do have one complaint. On our final day, we checked out around 11:00am and asked to leave our luggage in the storage room while we grabbed breakfast nearby. We have always done this in the past with no problem, and in fact, the very same bellman who had been very pleasant over the last few stays decided to be a jerk to us this time for absolutely no reason. Once we checked out, the front desk told us to wait for the bellman. Once the bellman came back, he appeared to be in a bad mood from the get go as he completely ignored us initially until we approached him a second time. We kindly asked if we could leave our bags while we grabbed breakfast nearby. The bellman asked \"when are you coming back?\" My friend replied, \"we'll be back in about 2 hours.\" With an annoyed tone, he repeated his question with an emphasis on WHEN, as if we didn't answer his question to his satisfaction; \"WHEN, WHEN are you coming back??\" My friend looked at me confused as to why this guy was being rude, then told the bellman, \"I don't understand, I just told you we're going for approximately 2 hours.\" The bell man once again said \"what time??\" I said \"around 1:30\".. The bell man took our bags and and gave us our luggage tags for later. We went for breakfast and came back, as planned, 2 hours later. The bellman was there and we approached him with the luggage tags to get our bags. He said he was assisting someone else and he'd come back in a bit. No problem, we waited. When he came back down a few minutes later, he didn't say a word to us. He walked right past us and proceeded to the front desk where he started chatting with one of the employees behind the counter. When he finished, he signaled with his hand for us to give him the tags as if he was hailing a cab on the street; didn't say a word. At this point we were pretty ticked off at the way this guy was treating us. We told each other that this guy is definitely not getting a tip from either one of us. This would be the first time I don't tip the bellman at a hotel, but this guy had no respect for us whatsoever. I understand that we all have bad days, but there's absolutely no reason to be rude to guests who've been nothing but patient and courteous with you.\nRoom Tip: Book a skyline suite if you care for a nice view. See more room tips", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-29T07:28:45.776+03:00", "highlightTitle": ""}