{"organizations": [], "uuid": "f8e390b72f72adc6df9b6cd5841d049756abf040", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/80/99/2b/hudson-studio.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1218720-Reviews-The_Standard_High_Line-New_York_City_New_York.html", "section_title": "The Standard, High Line - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1218720-r469893285-The_Standard_High_Line-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "One of the best hotels in NYC", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "One of the best hotels in NYC - Review of The Standard, High Line, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "f8e390b72f72adc6df9b6cd5841d049756abf040"}, "author": "Marlene U", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1218720-r469893285-The_Standard_High_Line-New_York_City_New_York.html", "ord_in_thread": 0, "title": "One of the best hotels in NYC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I loved my stay at The Standard! Everything about it was spectacular, so it made my boyfriend's birthday weekend go perfectly. But beware, I booked the room through a third party and had some booking issues. Thankfully, The Standard's customer service was so helpful!\nI booked the Superior King room, and it was so spacious. There was a plumbing issue and someone was able to quickly fix it for us! The only thing I did not like was the layout of the stand up shower and the toilet. It was opened with no door available, not really ideal during the winter time. You really needed to stay underneath the hot water to avoid getting cold. As for the toilet, it was in this separated room. I felt a bit claustrophobic. Despite that, our room was very nice. We had a spectacular view of the high line and the hudson river! Overnight, the noise level was moderate. Which was understandable because of the rooftop nightclub. The Standard altered how to get to the elevator towards the evening, and I assume this was to avoid clubgoers and hotel guests from bumping into one another. Awesome idea.\nThe location around The Standard could have not been better. You have the high line in walking distance, the village is very nice to explore and has plenty of bars opened to keep you entertained. During the winter, The Standard have an ice skating rink for free access for hotel guests! Only need to pay for the skate rental (only $4) but I ended up staying during a nice, warm weekend and all the ice melted. The beer garden and grill are also cool places to try during your stay.\nI can't wait to come back and book the Studio room.", "external_links": [], "published": "2017-03-24T03:00:00.000+03:00", "crawled": "2017-03-30T22:59:15.028+03:00", "highlightTitle": ""}