{"organizations": [], "uuid": "de32b86b5d5a4742a2e0820a1fa2355018d768dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/f1/66/b8/citadines-place-d-italie.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197561-Reviews-Citadines_Place_d_Italie_Paris-Paris_Ile_de_France.html", "section_title": "Citadines Place d'Italie Paris - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197561-r466330406-Citadines_Place_d_Italie_Paris-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Excellent service", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Excellent service - Review of Citadines Place d'Italie Paris, Paris, France - TripAdvisor", "spam_score": 0.003, "site_type": "discussions", "published": "2017-03-11T02:00:00.000+02:00", "replies_count": 1, "uuid": "de32b86b5d5a4742a2e0820a1fa2355018d768dd"}, "author": "Pete D", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197561-r466330406-Citadines_Place_d_Italie_Paris-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Excellent service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I came to Paris for work at Orly airport. The hotel is positioned nicely in proximity of Orly. By car it is only about 20 mins with light traffic. There are a lot of nice restaurants in the area and you are very close to Chinatown from the hotel.\nThe hotel has a breakfast area on the 1st floor at a cost of about 13€. I didn't eat there but I've heard it is very good with lots of choices. There are laundry facilities that cost 5€ for a wash (soap is injected during the cycle) and 4€ for drying. The drier is very fast and is done in about 30 mins for a full load.\nThe cleaning staff are wonderful and come once a week to clean the flat. If you need anything like extra pillows or blankets for visiting family they bend over backwards to help.\nI had a 1 bedroom studio that had a separate bedroom. The bed was comfortable and there is a nice closet to put away your clothes. There is a safe in the flat as well. The fridge is a nice size for 1 or 2 people and holds quite a bit with a small freezer section too. There is a small dishwasher, microwave/grill oven, kettle, 2 burner cook top and pots, pans dishes cutlery enough for four people. There is a couch which pulls out into a queen size bed or separate twin beds.\nThere are 2 views depending on which room you get. Even numbered rooms look out onto the streets and odd numbered look into the shopping center, so I had a great view of the escalators going up to the Hippopotamus restaurant inside the shopping center...the beeping of the escalator every 22 seconds can be annoying if you have any windows open.\nRight across from the hotel entrance is the entrance to the Metro. Line seven is the closest and in 10 mins you are at the Louvre or Notre Dame.\nIf I ever come back to Paris for vacation I would definitely stay here again, just in an even numbered room..", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-11T02:00:00.000+02:00", "crawled": "2017-03-28T12:33:29.389+03:00", "highlightTitle": ""}