{"organizations": [], "uuid": "37eda5efda0182a0f05e2f5816c44da2a43a4288", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/8a/f0/71/lobby-main.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99766-Reviews-or80-The_Roosevelt_Hotel-New_York_City_New_York.html", "section_title": "The Roosevelt Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r465777130-The_Roosevelt_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "March in NY - Review", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "March in NY - Review of The Roosevelt Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-09T02:00:00.000+02:00", "replies_count": 1, "uuid": "37eda5efda0182a0f05e2f5816c44da2a43a4288"}, "author": "Mobilefitter", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r465777130-The_Roosevelt_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "March in NY - Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We chose this hotel on British Airways Holidays,it had mixed reviews on this site but here is an honest report for others to make their own mind up when looking for a NewYork hotel.\nOn arrival we waited in line for to check in,this did not take long,we got two room keys we were given room 340 on the third floor,plastic credit card style that you insert in the door lock which both worked every time,the room was ok,it had the biggest bed we have ever slept in,i think it is called a king size,any way the bed was very comftable and the bedding was clean.\nThe room comes with a wall mounted television which we never switched on as we were on holiday to see NY not television,it had a wardrobe/cupboard that had a rail with hangers,a shelf with a free to use safe,an ironing board and an iron which we never used,also in the room were two bed side cabinets with draws.\nThe bathroom had a bath and shower,handwashbasin and toilet,plenty of towels and toilet paper were supplied.\nThe only negatives of the room were not a lot of space for clothes but we managed,the heating was noisy but we only used it twice as the outside temperature dropped,the noise from outside ie traffic etc was louder than we are used to at home but never stopped us sleeping.\nThe lifts in the hotel, 6 in total were always busy but if the lift arrived going up we just got in and then went down again to the lobby so no probs there.\nThe reception area and bar area were very scenic,the beer in the bar was $9 for a pint of Stella Artois did not try anything else but the bar was allways busy with a lot of people eating and drinking.\nThe hotel is close to Grand Central Station so handy for the subway,there are coffee shops and diners in abundance in the area so for breakfast i popped out for two coffes and muffin for breakfast whilst my wife had an extra half hour in bed.\nThe hotel itself is not new and some of the furnishings are a bit tired but the staff are good,the maid made the bed every day and cleaned the room,the doorman at the hotel spoke every morning and would give us directions and help with a smile,he also arranged the transport back to the airport,we took a stretched limo with another couple of guests for the same price as a cab.\nOverall would we use the hotel again? yes no problem but doubt if we would return to NewYork as we are not young and have now done it.If anybody reading this has any questions we will do our best to give you a honest answer", "external_links": [], "published": "2017-03-09T02:00:00.000+02:00", "crawled": "2017-03-31T21:30:59.175+03:00", "highlightTitle": ""}