{"organizations": [], "uuid": "884e0e356c507b4ac860e67c1dd591b9bdba4176", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/7e/96/4d/hotel-manfredi-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d456489-Reviews-Hotel_Manfredi_Suite_in_Rome-Rome_Lazio.html", "section_title": "Hotel Manfredi Suite in Rome - UPDATED 2017 Reviews &amp; Price Comparison (Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d456489-r468693645-Hotel_Manfredi_Suite_in_Rome-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Private location, intimate hotel, yet everything right at your doorstep!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Private location, intimate hotel, yet everything right at your doorstep! - Review of Hotel Manfredi Suite in Rome, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 1, "uuid": "884e0e356c507b4ac860e67c1dd591b9bdba4176"}, "author": "Beachbabyboo", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d456489-r468693645-Hotel_Manfredi_Suite_in_Rome-Rome_Lazio.html", "ord_in_thread": 0, "title": "Private location, intimate hotel, yet everything right at your doorstep!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My hubby and I (both mid-40's) stayed 2 nights at this hotel during the first leg of our 17 day European adventure. I did lots of hotel research online and searched in the area near the Spanish Steps, upon recommedation of a friend. This turned out to be the perfect spot for us, and we couldn't have been happier with our stay here!\nThe hotel is a lovely small \"boutique\" hotel tucked away on a quiet side street, but exit the hotel and you are literally two blocks from all the action! The Spanish Steps are very near, as well as several side streets filled with charming cafes and shops. The Hotel Manfredi also appears to be located in a high fashion retail district, so the window shopping alone was quite fascinating, as the window displays were truly like art installations!\nSince this was our first time ever to Rome (and to Europe for that matter), we decided to arrange, through the hotel directly, transportation from the airport to the hotel It may have cost us a little bit more, but it gave us a bit of peace of mind knowing that the driver would know exactly where to take us. And upon check-out, we arranged our own taxi from the hotel to the cruise terminal and that worked out fine, too.\nThe little café inside the hotel is just precious, and the breakfasts offered a nice variety and you can have coffee made any way you like it (cappuccino, latte, espresso, Americano, etc).\nAfter our first day of exploring the city, we were pooped by the time we arrived back at the hotel early that evening. So we went into the café and ordered a couple of cold beers and along with them came some complimentary snacks It was a nice way to wind down after being on our feet all day running around and seeing the sights!\nWe booked the small room but got bumped up a little bit bigger room upon arrival. It was still pretty small but this is to be expected in Europe. The room was clean and fine, not much of a view and in fact the shutters were almost closed on the outside so the room was a bit dark. But we will most definitely stay at this hotel again, and if finances permit, we may even splurge for one of their suites instead, just to have a little more room and have it possibly be a little bit brighter. This hotel was very reasonably priced, though, so it's a very nice accommodation even in the small rooms.\nWe did a mixture of Hop on Hop Off Bus, walking, and taxis. Saw a lot of the major sights: Spanish Steps, Vatican, Colosseum, Trevi Fountain, the Wedding Cake building, ate fabulous gelato, and hit up some nice restaurants.\nWhen we return to Rome one day (and we will!), we won't even look any further, we will stay at Hotel Manfredi again. It was the perfect hotel for us.\nRoom Tip: If you can afford the splurge, upgrade to a suite. Or see if you can get a free upgrade to a larger... See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-28T15:16:46.614+03:00", "highlightTitle": ""}