{"organizations": [], "uuid": "40d2b3327a7ecd6c74772ff579ad22cbd2748d84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/8a/f0/71/lobby-main.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99766-Reviews-or50-The_Roosevelt_Hotel-New_York_City_New_York.html", "section_title": "The Roosevelt Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r467189125-The_Roosevelt_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Second Vist - Second impressions", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Second Vist - Second impressions - Review of The Roosevelt Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "40d2b3327a7ecd6c74772ff579ad22cbd2748d84"}, "author": "Anthony D", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r467189125-The_Roosevelt_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Second Vist - Second impressions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Just back from a few days in NYC and having previously stayed at the Roosevelt I was looking forward to returning.\nIt was not disappointing.\nCheck in was quick and swift. We arrived early from JFK airport and was able to check right into our room about 1:30pm which was great.\nThe room we were assigned was 662 which was on the 6th floor.\nVery cosy room, big enough for 3 three people with two very comfortable double beds, a shower over the bath tub and everything you would expect in a hotel room was provided. Metlife centre was right outside the window but other then that the view wasn't that great.\nNo problems at all with the room - Very comfortable. House cleaning came maybe once during our three night stay but that wasn't a problem.\nCoffee inside the hotel is pretty steep, especially if you are buying for more then one person. I think three coffees and three bagels cost us almost $35 - Cosi just across the road from the hotel offers more value for money when it comes to coffee and breakfast.\nAll the staff are very polite, the door guys work hard, be sure to tip them when they collect your case from the taxi or hail you a cab.\nThe hotel is in a great place, everything is in easy walking distance. Times square is about a 5 min walk, Grand Central is just around the corner and Central Park is about a 15 min slow walk up 5th Ave.\nYou will not find a better located hotel that has a retro feel in New York City. Its like stepping back in time once you get into the lobby. Its amazing!\nCheck out was very easy even at 4:30am to catch an early flight. Took the hotel offered transfer and the driver was very polite and a good driver. Felt very safe.\nAs always, look forward to returning again!\nThanks Roosevelt for another enjoyable stay!\nRoom Tip: try and get a higher room floor number. I am sure the views are to die for See more room tips", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-31T21:22:50.432+03:00", "highlightTitle": ""}