{"organizations": [], "uuid": "60737486667082e29fc3269d85bb50fa456c5801", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/3b/b5/4f/ludlow-lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d6727310-Reviews-The_Ludlow_New_York_City-New_York_City_New_York.html", "section_title": "The Ludlow New York City - UPDATED 2017 Hotel Reviews &amp; Price Comparison - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6727310-r469570494-The_Ludlow_New_York_City-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "4 nights in a very hip hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "4 nights in a very hip hotel - Review of The Ludlow New York City, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 1, "uuid": "60737486667082e29fc3269d85bb50fa456c5801"}, "author": "hugwal2016", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6727310-r469570494-The_Ludlow_New_York_City-New_York_City_New_York.html", "ord_in_thread": 0, "title": "4 nights in a very hip hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We very much enjoyed our 4 nights at the Ludlow. My wife was in NY on business and the hotel's location in Lower East Side was ideal for her work. I'm not sure I'd recommend the LES for a \"normal\" holiday visit as it's certainly not a tourist area. But if you know London, think Shoreditch, Brick Lane and you'll get the idea.\nOur 7th floor room had a big terrace which would have been even nicer if NY hadn't been snowbound at the time! The room was on the small side as all NY hotel rooms seem to be but it was very well appointed with a very comfortable bed.\nWe only had breakfast in the hotel on our first morning - beware if you order \"morning potatoes\" and you're weight watching. My plate had no less than 12 roast potatoes!\nOther mornings we went to the little coffee shop two doors down - excellent raspberry muffins! We had dinner one night in the hotel's Dirty French restaurant - we were seated in the Garden Room which was actually better as we could hear what we were saying to each other! The food was excellent but it is expensive. It comes as a shock when you're retired and have to pay for these things out of your own pocket! The rate of exchange at the moment isn't helping.\nThe door staff, reception, room and waiting staff could not have been more helpful and friendly. If we had one gripe about the hotel it would be the bar and lounge service. The area is full of beautiful, trendy people (think fashion, social media types) all pretending to be really busy on their Mac books. Unless you fit into this category some of the bar waiting staff really give the impression they are doing you a favour by taking your order. I see other reviewers have commented on this.\nBut that's a very minor complaint about an otherwise excellent hotel which I have no hesitation in recommending.\nRoom Tip: We had a room with terrace on the 7th floor with no noise problems. I heard people higher up raving... See more room tips", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-30T23:13:33.216+03:00", "highlightTitle": ""}