{"organizations": [], "uuid": "c21475b35bb673791e9c2d22a7da2e43ac89f87f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/02/5d/c0/e4/the-lounge.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d195198-Reviews-or20-Crowne_Plaza_London_Kensington-London_England.html", "section_title": "Crowne Plaza London Kensington - UPDATED 2017 Hotel Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d195198-r466989911-Crowne_Plaza_London_Kensington-London_England.html", "country": "US", "domain_rank": 189, "title": "Short Visit to London -", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Short Visit to London - Review of Crowne Plaza London Kensington, London, England - TripAdvisor", "spam_score": 0.114, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 1, "uuid": "c21475b35bb673791e9c2d22a7da2e43ac89f87f"}, "author": "kernowlad2011", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d195198-r466989911-Crowne_Plaza_London_Kensington-London_England.html", "ord_in_thread": 0, "title": "Short Visit to London -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Since we have used the IHG Group hotels before we booked at the Crowne Plaza Kensington for a couple of nights whilst I celebrated my 70th birthday.\nThe hotel is nicely central with easy access to Gloucester Road Tube Station and the London Underground system. (Whilst I have mentioned the London Underground, I would recommend getting a visitors Oyster Card. It does make travel on the Underground easy)\nMy wife and I were welcomed into the hotel by the reception staff. We had booked a quiet room away from the Lift and that is exactly what we got. The room was overlooking the back of the hotel and the garden area.\nThe room was well provisioned, neat and clean. However, and sadly there are a couple of \"howevers\", the room air-conditioning did not seem to be working. We had selected the maximum fan speed on the coldest setting but all the system but all that seemed to be happening was air at the ambient room temperature - no cooling. The room was quite hot and stuffy. We found the beds very firm. For some this would be acceptable but for us not so much. We ended up trying to sleep on the pillows as a softener but this wasn't successful. We also tried folding the duvet in 4 to get some softening but again not too successful. We appreciate that the firmness would be very good for some, but a little too firm for us.\nThe breakfasts were very good, buffet style with specials being able to be ordered.\nOne thing that really struck me was the courteousness of the staff. Well done Crowne Plaza on that one.\nWould we stay again? Most probably yes but we would ensure the aircon is working and bring our own mattress toppers!!!", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-31T17:00:07.158+03:00", "highlightTitle": ""}