{"organizations": [], "uuid": "84bae8e5fcaa9c1fcd81cf2d702595f0f5ac4526", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/b9/43/97/the-gallivant-times-square.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d75711-Reviews-The_Gallivant_Times_Square-New_York_City_New_York.html", "section_title": "The Gallivant Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d75711-r467597751-The_Gallivant_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Damn you snow!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Damn you snow! - Review of The Gallivant Times Square, New York City, NY - TripAdvisor", "spam_score": 0.25, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "84bae8e5fcaa9c1fcd81cf2d702595f0f5ac4526"}, "author": "Nichole T", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d75711-r467597751-The_Gallivant_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Damn you snow!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The front desk staff and all there were amazing. My only complaint was the shower not closing all the way. It left a lot of water at times. We checked in on Monday after a long bus to find Suny, one of the sweetest and most professional front desk reps I've seen and meet. She was everything amazing about NYC in a body. She checked us in swiftly and we were on our way. This Tuesday NYC was hit with major snow and ice. After our show was canceled we really didn't know what to do. No museum were open, NYC was rather quiet. My daughters boots decided to go,leaving us with not many options for dinner. The hotel has a Korean restaurant on one side and a Chinese restaurant on the other. We went with the pho/ Korean restaurant. It was tasty and affordable. The reason we did? Another Galvant staff member. He told us about both restaurants in detail. Kind, friendly African American male. Sadly I missed his name but he was amazing.\nThe rooms are small but for myself and a 8 year old it wasn't bad at all. Tv worked, shower was clean and hot and the bed was comfortable. Because of the impact of the storm we were notified that housekeeping wouldn't be able to service us but for one night, who cares lol. There were towels and toiletries left out for guest on each floor and staff were around to help. I would totally stay here again. It's in a great location. Turn left and you have diners and the train, turn right and you are in the middle of Times Square! As we left, my daughter wanted a souvenir from the hotel. I was hoping to buy her the pin that many staff wore. Sadly they weren't for sale but Suny to the rescue! She gave my daughter hers. Gabriella was ecstatic after having part of the trip be a disappointment because of the show being cancelled. I can't tank the staff enough for keeping everything going so smoothly through that crazy storm!", "external_links": [], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-30T19:07:38.254+03:00", "highlightTitle": ""}