{"organizations": [], "uuid": "e1d8396e70eac38cfc6ba990900757cde886ffae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/33/91/a8/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1218792-Reviews-or20-Hilton_Garden_Inn_New_York_West_35th_Street-New_York_City_New_York.html", "section_title": "Hilton Garden Inn New York/West 35th Street - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1218792-r463338581-Hilton_Garden_Inn_New_York_West_35th_Street-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "5 Reasons to Stay Here", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "5 Reasons to Stay Here - Review of Hilton Garden Inn New York/West 35th Street, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-27T02:00:00.000+02:00", "replies_count": 1, "uuid": "e1d8396e70eac38cfc6ba990900757cde886ffae"}, "author": "CarolDM1900", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1218792-r463338581-Hilton_Garden_Inn_New_York_West_35th_Street-New_York_City_New_York.html", "ord_in_thread": 0, "title": "5 Reasons to Stay Here", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We were VERY satisfied with our stay here because:\n1. PERFECT LOCATION - within easy walking distance, even with luggage, of Penn Station, for those who arrive in New York by train. Easy access from there to the subway, easy walk to a lot of interesting sights, like the High Line, Times Square.The giant Macy's just steps away!\n2. COMFORTABLE AND QUIET - not a huge room, but a well-appointed one with thick enough walls to keep out the noise, making it a good spot to rest up after a busy day. Not a dinky bathroom, either, but something with a little breathing room, which we appreciated. Comfortable beds, nice linens and pillows, lots of them.\n3. GREAT FOOD AND DRINK JUST ACROSS THE STREET, or nearly so, at Brendan's Bar and Grill, with its friendly, stylish atmosphere and a wonderful bar and bartender, plus excellent breakfasts and dinners, a real gem in this neighborhood, not known for good food and drink.\n4. NO NEED TO PAY FOR BREAKFAST INCLUDED if you'd rather just go out on the local economy and find something interesting, but there if you want it, so how can you lose?\n5. FRIENDLY & ACCOMMODATING STAFF AND NICE BAR open late in the day for a sociable time and some decent drinks, if that's what you'd like. True, the bar could be open all day, but as a practical matter people tend to congregate there in the late afternoon and early evening, making for a convivial atmosphere. It was busy and fun, with people enjoying themselves, especially right around the dinner hour.\nThis hotel was well-priced for its neighborhood and did not break the bank. That's not the primary reason why we enjoyed it, but it helps, and we will certainly go back. It was all so easy, no-muss no-fuss, staying here after the train ride from Vermont. If you want to relax and have fun, this is the place where can do it at reasonable cost.\nNice job, folks. We felt well taken care of.", "external_links": [], "published": "2017-02-27T02:00:00.000+02:00", "crawled": "2017-03-29T04:34:59.742+03:00", "highlightTitle": ""}