{"organizations": [], "uuid": "2daee711189e6f5a004660a09075ddad7ae0ac32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/8c/5a/c5/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d188961-Reviews-Hotel_41-London_England.html", "section_title": "Hotel 41 - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r470556094-Hotel_41-London_England.html", "country": "US", "domain_rank": 189, "title": "An excellent stay at this boutique hotel in the heart of London.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "An excellent stay at this boutique hotel in the heart of London. - Review of Hotel 41, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "2daee711189e6f5a004660a09075ddad7ae0ac32"}, "author": "TGKnapp", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r470556094-Hotel_41-London_England.html", "ord_in_thread": 0, "title": "An excellent stay at this boutique hotel in the heart of London.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The small hotel of only thirty rooms is perfect in my opinion. You enter on the ground floor where a receptionist buzzes you in and are taken to the fifth floor for check-in at the concierge desk. We were told to leave our luggage downstairs and were greeted by name when we arrived upstairs. We sat at the desk and were served our choice of champagnes. We were checked in quickly and brought to our room with our luggage already waiting. The rooms was spacious and well appointed. The bathroom was fine, perhaps a little small with a tub/shower combo. We were only there for 3 nights and spent our 2 full days sightseeing away from the hotel. We had continental breakfast the first morning and it and the service were excellent. When we asked for directions to a specific pub for dinner one day, the concierge quickly printed out a walking map and by the time we got downstairs, the receptionist was at the door pointing the way. Evenings in the lounge are the best. With lower lighting and soft music, the staff will serve your favorite beverage while you get nibbles from a buffet of hot and cold snacks. After being busy all day it was a perfect end to our days. We did have laundry done and our only snag was not having all of our items returned. When I told the concierge, however, she went down to the laundry room herself and got the forgotten items within minutes. Overall, a tremendous property and great staff.", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-28T07:19:07.016+03:00", "highlightTitle": ""}