{"organizations": [], "uuid": "3cac4b9bb9a66e6f02d3fa5466d3a2c5d9fc0bbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/c0/7b/3f/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197656-Reviews-or10-Mercure_Paris_Centre_Tour_Eiffel-Paris_Ile_de_France.html", "section_title": "Mercure Paris Centre Tour Eiffel - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197656-r467554432-Mercure_Paris_Centre_Tour_Eiffel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Amazing view, perfect location, nice staff - the premium room totally worth it!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Amazing view, perfect location, nice staff - the premium room totally worth it! - Review of Mercure Paris Centre Tour Eiffel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 1, "uuid": "3cac4b9bb9a66e6f02d3fa5466d3a2c5d9fc0bbf"}, "author": "Tanya K", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197656-r467554432-Mercure_Paris_Centre_Tour_Eiffel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Amazing view, perfect location, nice staff - the premium room totally worth it!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed at Mercure hotel near Eifel tower on 11-12th March 2017\nI booked a premium room with a view and I don’t regret the extra charge at all.\nAt first I was worried as there is another hotel in front of this one but the premium rooms are on the 12th floor so you have the view to the Eiffel tower\nIf you are standing and looking from the window you will see the other hotel with some messy premises on the roof but when you sit on the bed you only see the Eiffel tower which is super nice. When it gets dark again – if you are standing and looking toward the tower – there is a disturbing very strong light from the other hotel logo, but when you sit – only the tower!!! (I’m still excited)\nOvernight we enjoyed the light of the tower and it’s magical when it starts blinking on every hour. When we woke up – the view was amazing!!!\nThe room was very clean, the bathroom is with a shower and there is some system where you can put aroma capsule and when you start using the shower it starts to smell amazing.\nWe had robes to use, the mini bar was free and also there was a dock to connect your mobile to, via Bluetooth or a cable. Also a big TV (we didn’t use it anyway). The bed was very comfy, warm room.\nIt was my boyfriend’s birthday and we had a nice sweet surprise from the hotel.\nWe bought a bottle of wine but didn’t realize that it was with a cork cap and the staff from the restaurant helped us, all were very kind.\nThe breakfast was also very good.\nI’m happy with my stay in that hotel and would happily recommend.", "external_links": [], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-27T13:25:21.225+03:00", "highlightTitle": ""}