{"organizations": [], "uuid": "82685cc3673ae9e45ba396c0bfb9a8c59944ce18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/8c/5a/c5/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d188961-Reviews-or5-Hotel_41-London_England.html", "section_title": "Hotel 41 - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r469708836-Hotel_41-London_England.html", "country": "US", "domain_rank": 189, "title": "Perfection", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Perfection - Review of Hotel 41, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "82685cc3673ae9e45ba396c0bfb9a8c59944ce18"}, "author": "californian94", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r469708836-Hotel_41-London_England.html", "ord_in_thread": 0, "title": "Perfection", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How do you define perfection? Well, the beautifully located Hotel 41 in the heart of London comes to mind. This is my daughter and my second stay at the Hotel 41 and to be perfectly honest, I would never stay anywhere else while visiting one of my favorite cities. From our warm reception upon arrival to our final good-byes and all the cherished moments in-between the entire staff helped to create our home away from home. Each mornig heading out after breakfast and armed with travel advice and snacks, it was always a pleasure to return \"home\" after an exciting day to share experiences with the staff who were genuinely interested in our stories. Plunder the Pantry was a brilliant offering and each evening my daughter and I would meet to take part in all the delicious goodies. I will never forget the Harry Potter treat left in our room after returning from the theatre or how Mitchell and others magically produced the Harry Potter DVD's complete with popcorn - so thoughtful. I will not soon forget how Nicole went out of her way to check my train tickets and inquire about riding in Hyde Park or how Mr. Hendry made sure that our breakfast was taken care of not to mention Steve and Dominic who always charmed and contributed to the welcoming atmosphere So even though this hotel's rooms are beautiful, its beds the most comfortable, the food delicious and the Executive Lounge luxurious...perhaps perfection can best be defined in terms of the Hotel 41 staff...special people like Flo, Marlen, Lauren, Andrew, Edgar and a host of others who made all the difference in our stay. Thank you, all. We will return!", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-27T02:40:29.842+03:00", "highlightTitle": ""}