{"organizations": [], "uuid": "66239a30cbf65eff7a2bd5fd7d7a79096e51f35c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/f4/9f/f7/citadines-tour-eiffel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197659-Reviews-Citadines_Tour_Eiffel_Paris-Paris_Ile_de_France.html", "section_title": "Citadines Tour Eiffel Paris - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197659-r465900976-Citadines_Tour_Eiffel_Paris-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "25th Anniversary in Paris", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "25th Anniversary in Paris - Review of Citadines Tour Eiffel Paris, Paris, France - TripAdvisor", "spam_score": 0.002, "site_type": "discussions", "published": "2017-03-09T02:00:00.000+02:00", "replies_count": 1, "uuid": "66239a30cbf65eff7a2bd5fd7d7a79096e51f35c"}, "author": "vdubtx", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197659-r465900976-Citadines_Tour_Eiffel_Paris-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "25th Anniversary in Paris", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Getting to the Hotel was a bit of an adventure from CDG, we chose to take the RER B train and Metro to just in front of the hotel. Wasn't so bad on a Sunday morning.\nOnce we arrived we were greeted promptly and we started the check in process. We were early and they stored our bags for us while we walked around the neighborhood for a bit. There was a great farmers market going on just outside the hotel. Bought a baguette and some cheese and enjoyed it while we browsed the fresh produce, meats and cheeses.\nQuite a few cafes etc nearby. We especially liked the Boulanger/Patisserie literally across the street with Green awning, excellent croissants in the morning. Poupart-Piquot is the name of it.\nView of the Eiffel Tower was a plus from our room. We especially enjoyed the hourly light show from our window. Location of the hotel to the Metro made it very convenient to get anywhere in the city. We felt safe during our entire stay in Paris and on the Metro. As long as you are aware of your surroundings you will be fine. Even though the #6 Metro runs right outside above street level, the noise of it in the room was really non existent.\nThe room was very spacious and the bed was comfortable. Nice kitchenette with utensils and plates etc.\nCoffee machine downstairs was a nice touch and was used quite often during our stay.\nCute neighborhood just out of hotel and to the left down Rue de Commerce. Nice little shops and restaurants for quick bite to eat, nice walk that ends right at a little church.\nStaff at front desk were always friendly and helpful getting us to the correct Metro lines to where we wanted to go in the city.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-09T02:00:00.000+02:00", "crawled": "2017-03-28T04:44:01.129+03:00", "highlightTitle": ""}