{"organizations": [], "uuid": "adbb918a390b9c930d0e80d13252ac58ef1ac650", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/8c/5a/c5/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d188961-Reviews-or25-Hotel_41-London_England.html", "section_title": "Hotel 41 - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r465598394-Hotel_41-London_England.html", "country": "US", "domain_rank": 189, "title": "Exceptional on every level - Just the best experience ever.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Exceptional on every level - Just the best experience ever. - Review of Hotel 41, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "adbb918a390b9c930d0e80d13252ac58ef1ac650"}, "author": "hubbotrelo", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r465598394-Hotel_41-London_England.html", "ord_in_thread": 0, "title": "Exceptional on every level - Just the best experience ever.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We booked an overnight stay here to celebrate my Birthday, we also booked the Afternoon Tea and the Romantic Turndown Package, I cannot stress enough how perfect everything was at this beautiful romantic hideaway in the heart of the City.\nThe levels of service and attention to detail were second to none. We had Champagne on arrival, we had been upgraded as a special treat for my Birthday into a stunning two storey suite. We were greeted with fresh fruit and a Birthday Cake together with a bottle of Champagne and chocolates which had been arranged by our Daughter as a surprise. Everything was just perfect. Our Afternoon Tea was exquisite, everything was so fresh and perfectly arranged. The scones were warm and the orange ones were a work of genius. The cake selection was superb and the sandwich selection worked really well, they also kindly made us fresh beef sandwiches without the horseradish as neither of us like it. Finally we were defeated and unable to move such was the loveliness and enormity of this Tea. After our trip to the theatre, we returned to the \"plunder the pantry\" experience, what a fantastic choice awaited us and drinks from the bar, not to mention an ice cream too finished off a perfect day and evening. We then went to our room which had been transformed with floating tea lights, rose petals, Champagne and Chocolate Dipped Strawberries all waiting for us, just magical.\nBreakfast the next morning did not disappoint, complimentary Champagne for my Birthday and lovely choices from the Buffet, we both had fish, smoked haddock and Kippers both perfectly cooked. We both came away saying that we had never felt so spoiled or special, all the staff really make the stay extra special, we would like to thank them all and will be returning again very soon.\nRoom Tip: We Stayed in Room 4119 - Luxury Personified See more room tips", "external_links": [], "published": "2017-03-08T02:00:00.000+02:00", "crawled": "2017-03-27T05:52:23.875+03:00", "highlightTitle": ""}