{"organizations": [], "uuid": "96d62f082ce8da73d4acbf40f785f36d092286a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/bf/a3/62/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d233741-Reviews-Mercure_Paris_Tour_Eiffel_Pont_Mirabeau-Paris_Ile_de_France.html", "section_title": "Mercure Paris Tour Eiffel Pont Mirabeau - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233741-r469725034-Mercure_Paris_Tour_Eiffel_Pont_Mirabeau-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "4 Nights in Paris - November 2016", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "4 Nights in Paris - November 2016 - Review of Mercure Paris Tour Eiffel Pont Mirabeau, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 1, "uuid": "96d62f082ce8da73d4acbf40f785f36d092286a0"}, "author": "MarianneMcfos", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d233741-r469725034-Mercure_Paris_Tour_Eiffel_Pont_Mirabeau-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "4 Nights in Paris - November 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Our stay in Paris was brief this time and we chose to stay at the Mercure Paris Tour Eiffel Pont Mirabeau. This is in the 15th Arr and more residential & business. The hotel was small, smaller than the Mercure size we are accostomed to here in Australia. It was clean and the staff were very friendly and helpful. Our room was on the 3rd floor and we had double windows looking out over the street where you could see the river Seine. The standard room is large enough for with the toilet separate to the bathroom, which is good. However if you have large luggage, I would suggest upgrading to Privilege Room, which is 22 square meters and gives more room to move and stow luggage. We ensured our stay included breakfast, as we didn't know the area. The hotel was a 5 minute walk to the train which runs parallel to the Seine and gives you access to stops close to multiple historic sites. The Metro is also only 5 minute walk. There is a laundromat (Laverie) 10 minutes walk from the hotel at 77 Rue de Javel. There is a pizza place next door, so if you're hungry you can grab a bite while you wait. Also when walking to the Laundromat, you will pass a green grocer, who has lovely produce. Around the area there is also a couple of grocery type stores similar to an IGA, boulangeries, patisseries, restaurants etc. ATM's were a little harder to find, so suggest you have some cash on you plus a credit card. If you are wanting to try some traditional French food, then I suggest Cafe du Commerce, 15 rue du commerce. The entrance is a little odd, there was seafood being sold, however once you pass this, and enter the restaurant it's truely a lovely surprise. The menu will be in French, however if you ask the waiter for a menu in english, he will grudgingly oblige. I would suggest brushing up on your French before dining there.\nRoom Tip: Ask for a Room Level 3 and above with view to street & river. Upgrade to a Privilege Room for mo... See more room tips", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-28T15:08:27.122+03:00", "highlightTitle": ""}