{"organizations": [], "uuid": "3958d1fa85cc8608bcbbefae981e2a79cbb057d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/cd/22/80/lobby-3.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d193107-Reviews-St_Martins_Lane_London_Hotel-London_England.html", "section_title": "St Martins Lane London Hotel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193107-r470829719-St_Martins_Lane_London_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Ultra modern, stylish stay.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Ultra modern, stylish stay. - Review of St Martins Lane London Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "3958d1fa85cc8608bcbbefae981e2a79cbb057d4"}, "author": "761samb2015", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193107-r470829719-St_Martins_Lane_London_Hotel-London_England.html", "ord_in_thread": 0, "title": "Ultra modern, stylish stay.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I booked St Martins Lane Hotel as part of my husbands birthday treat. It is not our usual style of hotel, but he had wanted to stay here, to stay somewhere 'different' (for us). It's sleek, trendy, stylish and modern, and strangely, we liked it! (we normally prefer character properties). Check in was efficient and we were upgraded to a room with a odd 'internal' patio - no view, but a table and chairs outside - you could see the sky above, but you could only see into your room or look at two walls. Quirky. Wasn't offered a tea & coffee tray on check-in, which our friends were (they checked in later on), would really have liked this to have been offered as I could have murdered a cup of tea on arrival (I went out for one). However, I did ask when I realised and a tray was in the room when we got back from our night out. I was told that breakfast was not included in our rate, and I was made to feel a bit as if I was \"trying it on\" when I insisted it was. When I provided proof later - once I had found the information, it was added.\nThe room was comfortable, ultra modern and very clean, and as mentioned before, it did have a very trendy outside area. Although I personally probably would have preferred a view as I am quite claustrophobic, but it was a lovely room and perfect for a single night in town. Great shower room with all the amenities you need - powerful shower and large sink, separate toilet. The only downside was it was quite noisy during the night - we could hear music - not loudly, but could hear it. No idea where it was coming from, indeed if it was coming from the bar, which we think was below us? It could have been coming from an adjoining room. Anyway, we were bone tired so eventually slept through it. Bed was super comfy though!\nWe went to the bar in the hotel after our meal out and theatre visit (Blind Spot). It was very very dark (we had to read the cocktail menu by a torch on our phone!) but it was sumptuously decorated and the tables and chairs were very comfortable. Service was excellent and the cocktails delicious. A DJ provided the music and was pretty good. We spent 2 hours in there and loved it. Bar bill was steep though, but it is London.\nBreakfast the next day was great. Great service and a good choice. Glad it was included!!\nSadly we had to leave early to get back home, but would have liked to have stayed a bit longer and lingered over breakfast and maybe had lunch later on in the afternoon. We have eaten in Restaurant before and loved it.\nGreat place to stay - really good location, friendly service. Small niggles, but overall stay was pretty good.", "external_links": [], "published": "2017-03-28T03:00:00.000+03:00", "crawled": "2017-03-31T18:19:54.072+03:00", "highlightTitle": ""}