{"organizations": [], "uuid": "6e0cc5e5fde5c7a24961a721e4a76b36082ca208", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/ff/a2/1a/paramount-hotel-times.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93517-Reviews-or10-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "section_title": "Paramount Hotel Times Square New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93517-r469449791-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "The perfect hotel for our city break.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "The perfect hotel for our city break. - Review of Paramount Hotel Times Square New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-22T02:00:00.000+02:00", "replies_count": 0, "uuid": "6e0cc5e5fde5c7a24961a721e4a76b36082ca208"}, "author": "Tenzin421", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93517-r469449791-Paramount_Hotel_Times_Square_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "The perfect hotel for our city break.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Before visiting NYC we saw a lot of very mixed reviews about The Paramount hotel, some of which did have me worried before we arrived and even had me thinking about changing hotels. I am happy to say I'm glad I didn't.\nTo cover the 'negative' points of the hotel; yes the rooms are probably a bit smaller than you would like. But they are not uncomfortable and certainly not the smallest rooms we have stayed in as a couple. It's an affordable hotel in the middle of New York City so don't be expecting Kevin Mccallister's suite from Home Alone 2. If you want that triple your budget and head over to the Plaza.\nThe bathroom & bath are also a bit on the cozy side, but not unusable. I'm 5'10 and I was able to have a relaxing bath no issue. Yes the rooms are dated. If you look hard you will see cracks in the skirting boards, maybe a bit of peeling paint or some dust in the air conditioning unit. These things are not something you notice unless you look for them and really have no impact on your stay.\nThere is also a charge for wifi - I'm not sure why and I do think they should look to make this free with the room. I have free roaming data so this was no issue for me, but might be for others. This would be my only real criticism of the hotel.\nSo, the reason I would recommend this hotel is the service from housekeeping was fantastic, we came back to a lovely fresh room every day. The location is spot on. Mere minutes away from Times Square, Broadway, Grand Central, Rockerfella, 15 minutes from Central Park and the subway for the rest. The location is perfect. That did mean we could hear Times Square at night, but we were so tired from all the exploring it made no difference, and the beds were just so comfy.\nWe didn't have to speak to the staff much but when we did they were efficient, friendly and helpful. We didn't use the in house restaurant or room service so can't comment on this.\nUltimately when it came to hotels we needed something central, comfortable and clean where we could establish a good base while exploring the city, and The Paramount delivered this on every level. I would happily stay again.", "external_links": [], "published": "2017-03-22T02:00:00.000+02:00", "crawled": "2017-03-30T19:03:26.992+03:00", "highlightTitle": ""}