{"organizations": [], "uuid": "26462b8c260cb2f486870bfa0965bd69a03ad3da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/2f/f9/60/grange-rochester-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d224663-Reviews-Grange_Rochester_Hotel-London_England.html", "section_title": "Grange Rochester Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d224663-r465970550-Grange_Rochester_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Single rooms are perfect for a single travel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Single rooms are perfect for a single travel - Review of Grange Rochester Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-09T02:00:00.000+02:00", "replies_count": 1, "uuid": "26462b8c260cb2f486870bfa0965bd69a03ad3da"}, "author": "ROBOTC3", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d224663-r465970550-Grange_Rochester_Hotel-London_England.html", "ord_in_thread": 0, "title": "Single rooms are perfect for a single travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I found the hotel cheaply on one of the big discount travel sites, it was fairly last minute. Checked the hotels own rate and found one very similar, maybe a few dollars more than the travel site but including breakfast. I ended up booking through their website as the included breakfast seemed positive.\nI stayed here for one night on arrival to London. Chose the hotel due to its location, wanting a quick transfer from Gatwick to the hotel, and something close to the Tate Britain so I could visit early the next day without much trouble.\nWith the hotel being about a 15 minute walk from Victoria, the simple directions of follow one major road then turn onto one side street were wonderful after my transatlantic crossing. At check in, the only confusion was with the tablet style check in. I've encountered this before, and it has never been a very pleasurable experience. The hotel staff were very helpful and nice. Only downside is when I booked on their website I had made a comment requesting a room with a bath, and instead had a room with only a shower. This was never mentioned to me at check in, even just a simple \"I am sorry we cannot accommodate\" would have been appreciated.\nThe room was small. There are a few images of the exact room I stayed in posted here on tripadvisor. Once you entered the room, it was essentially a hallway to a window with enough room for a shower room on the right, and a closet on the left. The depth of the shower room, and depth of the closet were then matched by the desk on the left, and the bed on the right once you were entirely in the room. Not small enough to touch either wall with ones hands at the same time, but fairly close.\nThe bed was firm, but comfortable. The blankets were very warm, and the room was warm itself. I ended up opening the window for most of the night. I was on the side with the street, and while there was some construction going on in the building opposite, the noise wasn't an issue if the windows were closed. When opened, it was more noticeable, but it wasn't bothering me enough to force me to close the windows. Nighttime noise was not a problem.\nIn the morning, I realized I had forgotten my dopp kit. I went down to the desk to ask if there might be some place near by and opened that early that would sell them. Instead, the man at the desk just pulled out a kit that included a toothbrush and toothpaste (crest brand) and a shaving kit that had a disposable three blade razor and some shaving cream. This service was very much appreciated. I used these toiletries for the rest of my 12 day trip.\nThen came breakfast. The breakfast was quite well set up. Lots of fruit, cereal, toast made to order, and coffee and tea by the pot. The room is gorgeous, with a fantastic ceiling and the staff were wonderful. I sat and ate my breakfast and finished off the coffee while I read without any problem. The room isn't the largest, but the hotel was full the night I stayed and when I went down to eat around 7am there was no one there. By roughly 8am when I left, there had been one family, and one other single traveler through the area. So while I am sure it could get busy, it didn't seem a problem while I was there.\nThe style of the hotel is quite old fashion. For those coming from North America, it is much like the grand old railway hotels. The reception area was small, as were the rooms, and while the decor was dated and looked nothing like the professional pictures posted with beige bedding, nothing I saw was tattered or near filthy. The elevator was very clean, and being entirely glass was a neat element of the decor. The cleanliness of the hotel was excellent in my mind.\nOver all, as a single traveler that doesn't mind the necessities in terms of space, this is a solid choice. I had enough space and outlets to work on my computer at the desk in my room, while charging my phone, a camera and the computer. With the price I paid for this hotel in mind, I really think with its location, breakfast and service, this is very much a hotel worth revisiting.\nThe only real negatives I can think of is the lack of air conditioning (there was a fan in the closet in my room however, and lack of air conditioning is quite normal in London) and the tablet check in.\nAlso just to add, the concierge was very helpful with directions and was more than happy to hold onto my bag from roughly 9am until almost 4pm after I checked out. This really let me get out and see some sights without the annoyance of carrying my bags about. The Wifi was quite good. I was at the far end on floor 3 and it had very good connectivity. While the language on the website was a little confusing about if it was or wasn't free, it was nice to find out it was free when I arrived.", "external_links": [], "published": "2017-03-09T02:00:00.000+02:00", "crawled": "2017-03-31T18:42:25.814+03:00", "highlightTitle": ""}