{"organizations": [], "uuid": "899f9b086a863fbd4937fc25488e958caf8d8782", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/9e/e1/9d/triple-suite--v11220522.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d238451-Reviews-Hotel_Papa_Germano-Rome_Lazio.html", "section_title": "Hotel Papa Germano - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d238451-r467888425-Hotel_Papa_Germano-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "CLEAN rooms! Staff very nice and helpful, great value!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "CLEAN rooms! Staff very nice and helpful, great value! - Review of Hotel Papa Germano, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-16T02:00:00.000+02:00", "replies_count": 0, "uuid": "899f9b086a863fbd4937fc25488e958caf8d8782"}, "author": "Theresa P", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d238451-r467888425-Hotel_Papa_Germano-Rome_Lazio.html", "ord_in_thread": 0, "title": "CLEAN rooms! Staff very nice and helpful, great value!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I had a problem with Agoda where I booked this through, they repeatedly GUARANTEED that the city tax was included (I explicitly asked as some said it wasn't for other rooms for this hotel but this one said it was!) for my party of 4 when I prepaid and they assisted me with booking it only to arrive there and have an extra 72 euros to pay! The staff (Hannah) was especially patient and did not get all huffy or anything with my dilemma. I went ahead and paid it but am going to contest that charge w/my cc as I took screenshots of the info when I booked it for back up. Agoda was no help and said I was mistaken,,, yeah good thing I have the screen shots! I liked that there was a Bakery around the corner and an Espresso Bar a few doors down that same street. We got Cappuccinos & fresh pastries for about $1.75 per person each morning and some delish pizza/tomato pies from the Bakery! EXCELLENT location (a few blocks from the Terminal), thorough cleaning of room w/fresh white clean towels daily. Much better value than the places with \"free\" breakfast that are blah! I would rather get exactly what I like for a fraction of the price around the corner! The whole staff right down to the cleaning lady were A++ I took off one star for the spotty internet connection. Beds were comfy, hot water never ran out, a few nights noisy guests woke us up but that can happen anywhere. If we ever go back to Rome I would definitely stay there again.\nRoom Tip: The quad room w/private bath temp couldn't be lowered so we opened the window (it was cold out... See more room tips", "external_links": [], "published": "2017-03-16T02:00:00.000+02:00", "crawled": "2017-03-29T12:39:18.432+03:00", "highlightTitle": ""}