{"organizations": [], "uuid": "b11c7ab84f023aadfde73a3b9d7ba3b7817a411d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/03/9d/a1/52/getlstd-property-photo.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d3973287-Reviews-or10-BEST_WESTERN_PREMIER_Herald_Square-New_York_City_New_York.html", "section_title": "BEST WESTERN PREMIER Herald Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d3973287-r468578850-BEST_WESTERN_PREMIER_Herald_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Quick trip to the city", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Quick trip to the city - Review of BEST WESTERN PREMIER Herald Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 1, "uuid": "b11c7ab84f023aadfde73a3b9d7ba3b7817a411d"}, "author": "Linda P", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d3973287-r468578850-BEST_WESTERN_PREMIER_Herald_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Quick trip to the city", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Needed a place to stay for a quick trip to New York with my young adult grandson that was located within walking distance to the theater district. Have had luck with other Best Westerns and decided to give this one a try. I was not disappointed. The location is ideal (easy walk to Penn Station, theater district, Times Square, etc) but on a quieter side street (36th Street between 5th and 6th Avenues). Met friendly and helpful staff throughout our stay. Rooms were New York tiny, but immaculate and provided all essentials. Beds were comfortable. Great views of the Empire State Building out 17th floor window. Expansive hot breakfast was complimentary and there was a bar in the back. Though I didn't use it, I was given a card for a free second drink. The only negatives I have were relatively minor and both involved the elevator..there was a very long wait for the elevator after breakfast (2 elevators, 17 floors and everyone going to and from breakfast at the same time) and a weird banging from the elevator shaft that other reviewers mentioned. The only time the banging was bothersome was early in the morning when the elevator was in frequent use going to breakfast. It sounded like someone was bouncing a ball against the wall outside our room. Once I realized where the noise was coming from, I could ignore it. My grandson slept through it and never heard it at all. Great \"grab food\" eat in/take out place a couple of doors down was helpful as well. Final tally-reasonable NYC price became better with breakfast savings and walkable location. Would definitely stay here again, even with the elevator noise.", "external_links": [], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-29T04:51:27.587+03:00", "highlightTitle": ""}