{"organizations": [], "uuid": "3595a90f1c1d2862680f611c6fdd28f624a230d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/20/3b/c1/studio.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d6003130-Reviews-The_Beaumont-London_England.html", "section_title": "The Beaumont - UPDATED 2017 Hotel Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6003130-r462445416-The_Beaumont-London_England.html", "country": "US", "domain_rank": 189, "title": "Best of the Best A unforgettable Experience", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Best of the Best A unforgettable Experience - Review of The Beaumont, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-24T02:00:00.000+02:00", "replies_count": 0, "uuid": "3595a90f1c1d2862680f611c6fdd28f624a230d8"}, "author": "D111REN", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6003130-r462445416-The_Beaumont-London_England.html", "ord_in_thread": 0, "title": "Best of the Best A unforgettable Experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed at the Beaumont few days before Christmas with the family.\nGreat location took the kids to hamley's and Selfridges which was only walking distance away and a Stones throw away from oxford street if you enjoy retail therapy.\nAbsolutely blown away with this hotel attention to detail is spot on at this place. The level of service we received during our stay was amazing and totally unexpected by us.\nAll the staff were very, very friendly and approachable.\nThe door man Colin was exceptional at his job, a delight to see and has a very welcoming nature, he is such pleasant and chatty guy, even my 6 year old felt at ease with him and would chat away with him like he had known him for years.\nMaya at reception is such a lovely and helpful lady always smiling and so helpful. she made sure everything was ok with us, she is such a great asset to The Beaumont keep it up it doesn't go unnoticed.\nThe suite was the best we have stayed in, comfortable and very good sized, loved the art decor theme too.\nThe little touches made our stay so much more of a unique experience, one example to share was We had complimentary chocolates which was prepared by the pastry chef at the hotel, in our room in form of Christmas designs, carefully layered on pure coco shavings making it a very festive experience, and went down a treat with the little ones too.\nI also received a complimentary cake and a bottle of champers which was unexpected for my birthday tasted divine and am so grateful for the thought thank you again.\nWill highly recommend staying here to my friends and family.\nSee you again Beaumont and thank you so so much.\nDee", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-02-24T02:00:00.000+02:00", "crawled": "2017-03-26T22:15:33.775+03:00", "highlightTitle": ""}