{"organizations": [], "uuid": "2a4297279098508b55627296d495538ba15d2078", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/25/2b/6f/ham-yard-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d6619160-Reviews-or10-Ham_Yard_Hotel-London_England.html", "section_title": "Ham Yard Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6619160-r463637980-Ham_Yard_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Nice Afternoon Tea in good location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Nice Afternoon Tea in good location - Review of Ham Yard Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-28T02:00:00.000+02:00", "replies_count": 1, "uuid": "2a4297279098508b55627296d495538ba15d2078"}, "author": "NMP55", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6619160-r463637980-Ham_Yard_Hotel-London_England.html", "ord_in_thread": 0, "title": "Nice Afternoon Tea in good location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As ladies who love our afternoon teas, we travelled to London for a girly day out, having planned to shop,eat and go to a show. We booked afternoon tea (£22pp) at the Ham Yard given its great location, 2 minutes walk to Picadilly Circus and 5 minutes walk to Leicester Square. We arrived 10 minutes early and were able to take in the lovely quirky interior design and decor. We were shown to a corner table closer to two others than we were expecting and had to move the chair behind in order to sit down. Clearly busy, it had a great buzz and we were served promptly. There were comfortable chairs, pristine white tablecloths and nice silver cutlery.\nA variety of speciality teas were offered but we were happy with our choice of English Breakfast tea. Tea consisted of finger sandwiches of smoked salmon and cream cheese, cucumber, ham and some sort of meaty filling which was tasty although we didn't know what it was. We were offered two mini scones (one plain, one with fruit) but we requested two fruit ones which we received. Neither was warm but was still very tasty with the strawberry or raspberry jam and the clotted cream. The selection of cakes were a modern rather than traditional selection; small but very nice including macaroons but sadly no chocolate eclair, meringue or fruit cake. We chatted happily for around three hours and received a refill of our pot of tea before being gently asked to leave to make way for evening guests around 18.30.\nYou should be aware that the bill included what the hotel calls a discretionary 12.5% service charge in very small print. We felt the afternoon tea very pleasant but a little underwhelming and did not live up to our expectations of it being a 2016 award winning afternoon tea.", "external_links": [], "published": "2017-02-28T02:00:00.000+02:00", "crawled": "2017-03-27T13:58:50.268+03:00", "highlightTitle": ""}