{"organizations": [], "uuid": "0ad3ede61fcfa43669dd5ff7d41be5bdc46d49ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/fb/e1/2c/high-above-the-lower.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d514488-Reviews-Hotel_on_Rivington-New_York_City_New_York.html", "section_title": "Hotel on Rivington - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d514488-r471263862-Hotel_on_Rivington-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Top notch service and stay", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Top notch service and stay - Review of Hotel on Rivington, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "0ad3ede61fcfa43669dd5ff7d41be5bdc46d49ac"}, "author": "lindsay5402", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d514488-r471263862-Hotel_on_Rivington-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Top notch service and stay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What a wonderful change of pace while visiting the city. We typically stay midtown and wanted to change it up a bit. I stumbled upon Hotel on Rivington while I was looking for somewhere that had good views and larger rooms. This seemed to fit the bill. We booked a high floor king suite and were just blown away. Upon arrival, we had a handwritten note from Kristen wishing my husband a happy of continuation of his birthday celebration (I had briefly mentioned to her in an email prior to arriving). Along with the note were cupcakes and a bottle of nice champagne. He was absolutely floored. Then, on our last night, we came in to a beautiful gift bag with a candle, ear plugs and nice note apologizing for any noise on the penthouse floor, as it had been rented out for a private party. The note also stated that breakfast was on them (the hotel) in the morning, should we choose to have any, downstairs. Again, floored. We could barely hear anything. But the fact that the hotel anticipated any issues and tried to counteract them with act of generosity and something useful, like earplugs, is just plain excellent customer service and something so many other businesses could take a lesson from. The room itself was just beautiful, crisp white linens, comfortable bed, wonderful views from the floor to ceiling windows and the bathroom tops it all. We can't thank you enough, Kristen and staff. You exceeded our every expectation and made my husband's turning 40 much more bearable! He forgot his age. Mission accomplished. We are already trying to figure out when we can come back.", "external_links": [], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-30T23:15:47.702+03:00", "highlightTitle": ""}