{"organizations": [], "uuid": "d06b84b9e76026072ff37959f65fb4d6905d22c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/bd/4b/46/guest-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93516-Reviews-or20-Novotel_New_York_Times_Square-New_York_City_New_York.html", "section_title": "Novotel New York Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93516-r466560651-Novotel_New_York_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great Location for Broadway", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great Location for Broadway - Review of Novotel New York Times Square, New York City, NY - TripAdvisor", "spam_score": 0.004, "site_type": "discussions", "published": "2017-03-12T02:00:00.000+02:00", "replies_count": 0, "uuid": "d06b84b9e76026072ff37959f65fb4d6905d22c2"}, "author": "Matombo", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93516-r466560651-Novotel_New_York_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great Location for Broadway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I was there for a weekend reunion with family, and the Novotel was a very pleasant stay. Keep in mind that it is in Manhattan, which means that the rooms are small and the prices are not inexpensive. Still, the room was clean and quite large for New York City, and since it was at the end of the hall, it was very quiet.\nThe staff were efficient and cordial. Check in was smooth, and the desk clerk, Ian, was a delightful welcome to the hotel. The lobby, which is on an upper floor (I did not figure out how high, but probably about five or six floors up), was spacious and included a bar, a restaurant, and a small outdoor seating area. Food at the restaurant was ordinary and predictably overpriced. With all of the restaurants in the area, I'd go for a short walk instead. The steak house next door (Gallaghers) was very good but, again, this is New York, so keep your wallet out.\nThey seek to project a fairly modern and sleek vibe, which meant that we could not find the primary lighting for the room. It turned out that it was contained within the headboard for the beds (see attached). We finally had to have maintenance show us where the switch was. There was also a small fridge in the room, and a safe, which I always appreciate. The reading lights over the beds were a nice touch, as was the night light in the bathroom.\nThe bathroom itself was well-appointed, with both a rain shower and a hand-held showerhead, but unlike such a setup that I have seen in the past, the mount for handheld unit could not be adjusted, so if I was not holding it, it was hitting my upper chest. It was a bit awkward but not calamitous.\nThe location was excellent, within easy walking distance to Times Square and the Broadway theaters. When we were there, Cats was playing right next door.\nIn short, I would recommend the Novotel Times Square. Few hotels in New York strike me as perfect, but I'd definitely stay there again.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-12T02:00:00.000+02:00", "crawled": "2017-03-29T14:09:19.796+03:00", "highlightTitle": ""}