{"organizations": [], "uuid": "c1589135b2042aa444765982626d597427cd78ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/3d/e6/09/lexington-penthouse.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d2148819-Reviews-Hotel_48LEX_New_York-New_York_City_New_York.html", "section_title": "Hotel 48LEX New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d2148819-r470327813-Hotel_48LEX_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "The Best Hotel in Midtown", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "The Best Hotel in Midtown - Review of Hotel 48LEX New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 1, "uuid": "c1589135b2042aa444765982626d597427cd78ff"}, "author": "JacksonMSCstone", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d2148819-r470327813-Hotel_48LEX_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "The Best Hotel in Midtown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I recently visited this hotel during our spring break. I have stayed in the Baccarat, the Pearl, The Plaza, And some other boutique hotel I can't remember. These hotels were all good but 48Lex surpassed them all. I was pleasantly surprised in every area down to the restaurant, the lounge, our room, not to mention all of the people that worked in the hotel all had one thing in common. They all had friendliness and class. If you book with the hotel (not third party) they offer you upgrades and request needs prior to your arrival. I requested a possible early check-in and late checkout out plus extra towels and the largest double bedroom that they had available. They fulfilled all of my requests and then some. I stayed there all week and anytime I needed anything there was less than a 10 minute wait on any requests. I was impressed by so many of the young staff. I wanted to make mention of several who really stuck out in my mind. I first person I met was Jason. He checked us in and was super efficient and kind. He never forgot my name and made sure we were all taken care of without missing a thing. Wow! The Restaurant attached to the hotel was AMAZING. The home made chicken soup down to the avocado toast and tuna poke was to die for and the staff was so Accommodating to my younger child. One of my favorites in this restaurant was Brian Malloy. I am pretty sure he was a manager. He seems to be able to do it all from hosting to waiting tables to delivering food etc. He always had a smile on his face and was always willing to go over and beyond the call of duty. Loved him and his kind smile. The girls and guys that worked the front desk and Lounge were as equally great. The ones that stick out to me are Jason, Jasmine, Melvin, Ingrid, Evelyn, Aliana, Allen...I truly wanted them to all know that they helped us have the best vacation ever. These young people know what it means to work and work hard. They never acted like any request was a bother. Thank you to each and everyone of you for setting a Great example of how people should behave and treat customers in the hospitality industry. My hats off to Jonathon Goldberg, the general manager, I happened to meet the day before I left to come home. Good job on putting together one of the best staffs I've seen in a while. I also wanted to make note that my room was to die for. Anyone he goes there that needs more than one bed to sleep then try to request room 304. You couldn't get any better than that in Manhattan for the money and hospitality. This hotel is close to everything, super clean, best employees, good gym, amazing good, great views...love this place and I will be back. Thanks for everything.\nCami Hill/Jackson MS (March 13-17 2017)", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-29T05:07:02.091+03:00", "highlightTitle": ""}