{"organizations": [], "uuid": "6f721045a4556c5a0216627891b7ec596e7b9969", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/81/cf/d6/hilton-garden-inn-times.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99352-Reviews-or30-Hilton_Garden_Inn_Times_Square-New_York_City_New_York.html", "section_title": "Hilton Garden Inn Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99352-r467014092-Hilton_Garden_Inn_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Weekend Get-Away Appropriate", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Weekend Get-Away Appropriate - Review of Hilton Garden Inn Times Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 1, "uuid": "6f721045a4556c5a0216627891b7ec596e7b9969"}, "author": "Jailene R", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99352-r467014092-Hilton_Garden_Inn_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Weekend Get-Away Appropriate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This hotel is great for one or two night stays max. The location was unbelievable and the price was just as exciting! The hotel itself was average.\nParking is a nightmare (but it is that way for every hotel in the heart of NYC). We arrived for a weekend trip to see The Phantom of the Opera at the Majestic (which was only a 5- minute walk away). We got in at 8pm on a Friday night. BIG MISTAKE! It took us 30 minutes for our car to be picked up by the garage attendant. Once in the hotel I asked the receptionist about the parking and she said it wasn't apart of the hotel (which is why I'm not including this into the rating-Just using this as a warning for others). The hotel has a partnership with the garage and we were able to park at a discounted rate.\nThe hotel itself was remodeled and upgraded. While it was small, it packed a punch and had a bellman and a concierge to help you with your stay. The room was tiny! We had a two double bed room and it was small! There was view of a brick wall which wasn't exactly what we were expecting, especially after seeing the pictures online. But the room was packed with amenities as well. It had a refrigerator, coffee maker, and surprisingly a microwave.\nThe location was the best part of this hotel. If you walked half a block you were in the heart of times square. It was phenomenal being so close to all the attractions (which compensated for the tiny room since we weren't in it for so long).\nThe hotel offers complimentary luggage checking. Once we checked out at 12pm (great late check out!) we left our luggage with the Bellman while we explored the city and watched our matinee show. There was a small grocery store across the street which was great for midnight snacks and water bottles.\nOverall, this was a great stay. I didn't give it five stars because of the tiny room size and the view of a brick wall.", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-31T19:47:53.802+03:00", "highlightTitle": ""}