{"organizations": [], "uuid": "34da2fc7e82eab8a01a3c66affc27b7316373438", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/9f/d4/0c/the-knickerbocker.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d7255276-Reviews-The_Knickerbocker-New_York_City_New_York.html", "section_title": "The Knickerbocker - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d7255276-r470911429-The_Knickerbocker-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Outstanding Hotel with Outstanding Service!!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Outstanding Hotel with Outstanding Service!! - Review of The Knickerbocker, New York City, NY - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-28T03:00:00.000+03:00", "replies_count": 1, "uuid": "34da2fc7e82eab8a01a3c66affc27b7316373438"}, "author": "Tamika B", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d7255276-r470911429-The_Knickerbocker-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Outstanding Hotel with Outstanding Service!!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It was my husband's birthday and he always wanted to stay in Times Square. After reviewing numerous hotel reviews, I selected The Knickerbocker, and it was the best hotel ever. I wrote and requested a room on a high floor with a view of Times Square, and they accommodated us in Room 1011 which was a Premier King Room. In addition, a bottle of wine and a pastry with \"Happy Birthday\" were in the room when we arrived. The window had a blackout curtain you could control by remote to keep the room dark, and they worked very well. The windowsill also had a little ledge that you could stand on and see right onto Times Square. The bathroom was simply amazing, with touch controls and glass. In addition, there was a turn down service, and they placed a mat on the floor on each side of the bed (in case you didn't want your feet to touch the carpet) and slippers. Even though the hotel is right in Times Square, you can't hear any noise; the rooms are soundproofed very well. Then there is the rooftop bar with outstanding views. The Knickerbocker is the hotel where the New Year's Eve party on television takes place. You have a direct line of sight to the New Year's Eve ball, and the ball is lit and changes colors and patterns all year round. My husband was thrilled!! But most of all….the service is topnotch. Everyone was polite and helpful. I really can’t overstate how professional and friendly the staff is. We had such a good time that we added a night to our stay. Remember to check the hotel direct rates before booking anywhere else. We used a direct mobile rate and received 20% off, and when we added a night, we kept it at the same rate (even though it’s usually higher for a Saturday night). Highly recommend The Knickerbocker. We definitely will return … again and again!!!", "external_links": [], "published": "2017-03-28T03:00:00.000+03:00", "crawled": "2017-03-31T22:03:01.159+03:00", "highlightTitle": ""}