{"organizations": [], "uuid": "e4e97bc672a4ee5e714b4afcdf8fcfb00c9547b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/8c/5a/c5/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d188961-Reviews-or5-Hotel_41-London_England.html", "section_title": "Hotel 41 - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r468846091-Hotel_41-London_England.html", "country": "US", "domain_rank": 189, "title": "The ratings should go up to 6 for this place", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "The ratings should go up to 6 for this place - Review of Hotel 41, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "e4e97bc672a4ee5e714b4afcdf8fcfb00c9547b6"}, "author": "monkeyman07", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r468846091-Hotel_41-London_England.html", "ord_in_thread": 0, "title": "The ratings should go up to 6 for this place", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I'm fully aware that this may sound like another gushing review and one must think they put something in the drinks at Hotel 41, but whatever it is I'll gladly have more. You never quite know how good service can be until you stay here. First, we were immediately upgraded to a nicer suite. There was a lovely fireplace and a little lounge space with champagne on arrival, a huge bed and fantastic bathroom with a bath and superb shower and all the little extras I wouldn't even have thought to ask for! The executive lounge is where it all happens, whether relaxing in front of the fireplace or under the astounding globe centrepiece, we were treated like old friends. They seem to have struck the perfect balance between being friendly and utterly attentive without being intrusive. Whiling away the afternoon with tea and scones or champagne and their impressive help-yourself pantry of snacks or cooked dinner was a delight, and Steve Jones was an absolute treasure, it felt as comfortable as chatting to my favourite uncle without feeling awkward when he topped up my drink or brought some food over. All of the staff went out of their way to make sure that our trip was perfect and you could tell that they genuinely enjoyed working there and bringing you as much joy as they could. We even had the pleasure of meeting Bea Tollman herself, who was happy to sign her lovely book for us. Yes, its luxury hotel prices and the drinks aren't cheap, but this is truly a special place and something which we will always cherish. Thank you to everyone at Hotel 41.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-27T02:40:27.915+03:00", "highlightTitle": ""}