{"organizations": [], "uuid": "c2800b48e2de74154d75a68cd046e98382846368", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/f6/90/55/city-king-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d572859-Reviews-Apex_City_of_London_Hotel-London_England.html", "section_title": "Apex City of London Hotel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d572859-r470695943-Apex_City_of_London_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "\"Fantastic hotel, great location, wonderful service ....\"", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "\"Fantastic hotel, great location, wonderful service ....\" - Review of Apex City of London Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "c2800b48e2de74154d75a68cd046e98382846368"}, "author": "BackToLondon", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d572859-r470695943-Apex_City_of_London_Hotel-London_England.html", "ord_in_thread": 0, "title": "\"Fantastic hotel, great location, wonderful service ....\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Last month I enjoyed a weekend stay at the Apex City of London Hotel, and can't say enough nice things about this property.\nThe location is perfect - a short walk from the Tower Hill underground, with various bus routes nearby, and many restaurants, bars, pubs, sandwich shops, etc. A stone's throw from the Tower of London, Tower Bridge, and several stops for the Hop On/Hop Off Buses. Finding a taxi was never a problem.\nThe hotel is nicely decorated with contemporary furnishings and design, and has an amazing staff.\nThe check-in process was very quick and efficient, and early access to the room was not a problem.\nThe young woman who checked us in, Omari, is an absolute delight -- warm and friendly, whilst very professional. Always with a smile. She'd noticed it was my birthday, and not only wished me a happy birthday, she also notified the management and not long after settling into my room received a lovely hand written note with warm birthday wishes, and a gift as well -- a box of chocolates.\nI was upgraded to a deluxe room which was spacious, beautiful and well appointed. The bed, an american king size, was very comfortable, and had high quality crisp linens. The best night's sleep I'd had in a long time. The towels were thick, fluffy and soft, as were the comfy bathrobes and slippers.\nThe room had a large flat screen TV with abundant choices in channels, and a desk with a (hidden) lighted make up mirror. There was also a comfortable sofa. Naturally, tea/coffee services, but with filtered coffee (not instant), bottles of spring and mineral water, biscuits and other snacks were complimentary. The room also has excellent lighting, and was quiet. I heard no noise from either the corridor or the outside. The bathroom was quite spacious with a large deep bathtub, separate walk in shower, towel warmer, and high end toiletries - everything was spotless.\nMy friend visited the bar, was very pleased with the service he received, and with the choices of beer and ale.\nAll the staff members were equally polite, friendly and gracious -- Always greeted with a smile, and warm hello, even when passing in the corridors.\nThis is a hotel I'll certainly visit again, and will highly recommend to friends and colleagues. A big Thank You to the staff at the Apex City of London Hotel.\nAnd Omari -- you are awesome...and you rock!\nP.S.\nI forgot to mention that you receive a complimentary rubber ducky to take home!", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-31T21:03:51.944+03:00", "highlightTitle": ""}