{"organizations": [], "uuid": "58fa51f949b878c73c81884ddf87e98c7c59a88f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/5e/f6/ad/imperial-penthouse.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d80112-Reviews-San_Carlos_Hotel-New_York_City_New_York.html", "section_title": "San Carlos Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d80112-r470722387-San_Carlos_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Awesome. Has become our permanent hotel in NYC.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Awesome. Has become our permanent hotel in NYC. - Review of San Carlos Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "58fa51f949b878c73c81884ddf87e98c7c59a88f"}, "author": "NYCMegaTraveller", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d80112-r470722387-San_Carlos_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Awesome. Has become our permanent hotel in NYC.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Made an account specifically to give this place the review it deserves. My family of three kids, all 6 or under, has stayed there several times now. It's friendly, offers great service, and the rooms are fantastic.\n* The owner sometimes invites families with kids back to his office. He chats about whatever - history, New York, his family - and gives the kids little gifts. Reminds you of the way airlines used to treat little kids, inviting them up to the cockpit and giving them pilot wings.\n* The suites with the two queen beds are HUGE by Manhattan standards. Dining alcove, kitchenette, an almost too-large living room, bedroom with two queens and still plenty of room for a full size desk, large bathroom. Nothing comparable in this price range in this location with this level of service. A true gem.\n* Did I mention it's friendly? The maids adore our kids, play with the baby, joke with the older kids. The turn-down service pretty much includes them wanting to sing your kids a lullaby.\n* Nothing has ever gone wrong. Never too cold, too hot, too noisy, too anything. Everything just is what it's supposed to be. I think experienced travelers know how rare that is.\n* Some things to consider: the king bed suites are pretty tight when you unfold the couch in the living room. There is a high-rise going up next door - we never heard a thing but maybe if you're in exactly the wrong room you could hear it? Honestly though we've never heard any sounds. The breakfast is good, but there isn't anything like hot sausage or omelets. Mostly things like bagels, toast, cereal, fruit, juice, yogurt, even hot cocoa for the kids - and it's all kosher, as a bonus.\nSo, like I said, this place is just so good that I would feel guilty not creating an account to give them a plug. Stay there.\nRoom Tip: Suites with two queen beds are HUGE See more room tips", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-29T05:04:50.520+03:00", "highlightTitle": ""}