{"organizations": [], "uuid": "e003399fd047f22f81d82d706d49b9b16ea1da6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/1b/88/7e/the-milestone-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d193121-Reviews-or10-The_Milestone_Hotel-London_England.html", "section_title": "The Milestone Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193121-r464547240-The_Milestone_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "6 Stars For Service Alone!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "6 Stars For Service Alone! - Review of The Milestone Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "e003399fd047f22f81d82d706d49b9b16ea1da6d"}, "author": "SolihullTraveller", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193121-r464547240-The_Milestone_Hotel-London_England.html", "ord_in_thread": 0, "title": "6 Stars For Service Alone!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We've just returned from a two-night stay at The Milestone Hotel in Kensington. I last stayed here on a business trip some eight years ago and remembered it to be very good then, hence wanting to revisit with my wife. That and the fact that according to Tripadvisor, this is the most highly regarded hotel in London and one of the most highly regarded in the world.\nSo to give my conclusion on those accolades; Yes, I'd say it probably is.\nFirstly, the service here is superb. I have never experienced service like it anywhere in the world. The attention to detail is mind blowing frankly.\nOne memorable example would be the fact that we were staying at the hotel because we were here to see the Harry Potter play; The Cursed Child. I'd had to wait 17 months since purchasing my tickets and so it was special really. My wife and I were in our room one afternoon and we had a knock at the door from a lovely lady who had brought us two Harry Potter cocktails in little bottles, complete with labels of potions from the books. Unbelievable attention to detail and so thoughtful of a hotel that had listened and gone out of its way to make our stay special.\nAlso, your welcome drink isn’t some paltry glass of orange juice or sparkling wine, we were handed the drinks menu and asked what we wanted and were promptly served two glasses of our chosen Lanson champagne. That’s forty-quid’s worth of welcome on the house for a start!\nEvery member of staff that serves you learns your name and checks to make sure they're pronouncing it properly too. There are little touches everywhere that make this place special and above the normal five stars, and we've stayed at The Dorchester, The Ritz, The Lanesborough, The Savoy, The Landmark and many others. None went out of their way like this.\nThe hotel is very Victoriana in style, not least because you’re in a beautiful period, red brick building. The hotel upgraded us when we checked in, which was a lovely surprise and we were led to a delightful third floor room, overlooking Kensington Palace. The first thing you notice about the room is how quiet it is. You can barely hear the busy road outside the hotel and certainly not the neighbours. The room is also very well equipped with features galore and touches everywhere, including a huge super king (and incredibly comfortable) bed and a 60” LCD TV. I doubt there is anything else you could possibly need in a hotel room frankly.\nWe had breakfast included in our rate, which was a lovely buffet and à la carte affair in the wood panelled dining room. It’s extremely high quality and I’m pushed to think of a better breakfast, even amongst the hotels already mentioned.\nOur two nights stay with breakfast included was £550. That represents unbelievable value in my opinion and I can’t thank the hotel and staff enough for looking after us so well and for going out of their way to make our stay incredibly memorable. I can not recommend this hotel enough.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-04T02:00:00.000+02:00", "crawled": "2017-03-26T20:01:36.956+03:00", "highlightTitle": ""}