{"organizations": [], "uuid": "9368965995574d4b3573aea79c4b4d1af9bc2fe7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/4e/91/a3/the-court-a-st-giles.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d194238-Reviews-The_Court_A_St_Giles_Hotel-New_York_City_New_York.html", "section_title": "The Court - A St Giles Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d194238-r468827916-The_Court_A_St_Giles_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Quaint little hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Quaint little hotel - Review of The Court - A St Giles Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "9368965995574d4b3573aea79c4b4d1af9bc2fe7"}, "author": "jkemommy", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d194238-r468827916-The_Court_A_St_Giles_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Quaint little hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed here for our honeymoon. The front desk staff was really nice and accomodating. The housekeeping staff were really nice as well. asking every morning when we left if we needed service. The rooms are a little dated but i mean cmon were in NYC everything is a bit outdated here. The beds are firm but comfortable. The pillows are King size pillows and so comfy. The fridge was fully stocked with water, wine beer. we didnt touch those because they are so overpriced. The heater did run 24/7. never turned off but kept it perfect. The shower curtain was too high so it barely stayed in the tub during showers but i always put a towel down to step on anyway so that wasnt a big deal. The shower head was really loose and very low but on the right side is a knob that you turn to loosen and you can slide the shower head up and then tighten it and it works perfect. No ducking under the shower. There is a lot of noise from the traffic outside but again your in NYC not the country so noise is expected. However, after about 11-12 the streets were quiet so no issue there. We really had no issues whatsoever with the hotel. there was one night someones kid pulled the fire alarm and the staff responded quickly. As soon as it was pulled i got up and opened the door and a lady at the end of the hall was frantically trying to get into her room with her around 6 year old son. when she saw me poke out she froze like a deer in headlights and asked what to do since her son pulled the alarm. I said call the desk and tell them. but a moment later an employee came up and told us to stay in the rooms no reason to leave it was a false alarm and i told him someones child pulled the alarm and what room she was in. (yes i ratted her out) They cleared the alarm just as the fire engines were pulling up. but the staff handled it quickly and efficiently. No issues at all with this hotel. It is one block from Grand Central Station, about a 15 minute walk to Times Square. we would definately stay here again...", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-31T08:00:21.353+03:00", "highlightTitle": ""}