{"organizations": [], "uuid": "fa17866e4fd2a087a6375c35fdf5da631cdfe2c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/41/35/92/the-hotel--v11753430.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d232844-Reviews-Hotel_Julia-Rome_Lazio.html", "section_title": "Hotel Julia - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d232844-r470998313-Hotel_Julia-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Perfect location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Perfect location - Review of Hotel Julia, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "fa17866e4fd2a087a6375c35fdf5da631cdfe2c5"}, "author": "Stefan P", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d232844-r470998313-Hotel_Julia-Rome_Lazio.html", "ord_in_thread": 0, "title": "Perfect location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What should you look for when booking a hotel in Rome? Proximity and easy access. When we visited Rome in March for 4 full days we looked for a hotel situated in the center of the action, right next to the Fontana di Trevi.\nAfter doing some research, we decided that would be a lovely place to be at, especially as we were really excited about viewing some of the surrounding areas at night. After we decided upon the area, we found a good deal on Agoda and we booked a small room at Hotel Julia.\nAccess:\nFor those coming in Rome by plane, from each of the two airports (Ciampino or Fiumicino) there are bus shuttles that takes you to Termini Train Station. From there you can take the subway on the red line for two stations, until you reach Barberini Metro Station. You exit left and keep left for about 100 meters where you turn left again, on Via delle Quattro Fontane. Second street right is Via Rasella, where the Hotel is situated at number 29.\nDescription:\nNow, before moving forward with our review, you have to understand the fact that Hotel Julia is not a modern hotel, it is not made out of steel and glass and does not boast with the latest technologies.\nWhat this hotel is, is a building from 1949, situated on a street not very circulated, between Fontana di Trevi, the Spanish Steps, Piazza Barberini and the famous Via Veneto.\nThe breakfast is served daily between 7:30 and 10:30 AM, offering a range of pastry, fruits and sandwich ingredients. We mostly enjoyed the cappuccino/espresso, which was served at request and you could order one per guest.\nStaff:\nFrom the moment we stepped inside for the first time we were greeted warmly. There is always someone at the reception who will answer any question and offer to help in any situation.\nThe cleaning staff was present daily with turndown service.\nWe interacted with 3 or 4 hotel staff at the reception, more than 5 cleaning personal and 2 waitresses. Everybody was really nice and always had a smile on their faces.\nProximity:\nAs we detailed above, the hotel is very close to many major sights as it is located in the historical center of Rome. You will have easy access to Trevi Fountain (450 m), Spanish Steps (700 m), Piazza Barberini (300 m) and Via Veneto (600 m). The Colosseum is located at 1.6 km away so it’s a short and enjoyable walk away.\nThis is the most important feature of the hotel. Because of it’s perfect location it gives you the option to visit everything at night, as they are all so close. Rome by night is an entire different city to visit.\nOur verdict:\nIf ever again in Rome we would definitely stay here. Situated so close to Fontana di Trevi, is a major advantage since the entire area is charming in the evening and at night.\nOverall, one of the nicest hotels we were ever accommodated in.", "external_links": [], "published": "2017-03-28T03:00:00.000+03:00", "crawled": "2017-03-29T21:47:45.561+03:00", "highlightTitle": ""}