{"organizations": [], "uuid": "3a1fbf7269f19e29b5839f834346ea4a5246aaa0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/e4/1a/2c/hotel-lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d7037463-Reviews-NUO_Hotel_Beijing-Beijing.html", "section_title": "NUO Hotel Beijing - UPDATED 2017 Reviews &amp; Price Comparison (China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d7037463-r471299585-NUO_Hotel_Beijing-Beijing.html", "country": "US", "domain_rank": 189, "title": "Impressive hotel- top comfort with some service flaws", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Impressive hotel- top comfort with some service flaws - Review of NUO Hotel Beijing, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "3a1fbf7269f19e29b5839f834346ea4a5246aaa0"}, "author": "Charlie M", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d7037463-r471299585-NUO_Hotel_Beijing-Beijing.html", "ord_in_thread": 0, "title": "Impressive hotel- top comfort with some service flaws", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nuo Hotel is an impressive establishment definitely show-casing very fine Chinese lifestyle design with remarkable elegance in almost every corner of the hotel. The art work and the vases and layout in the various hotel spaces is utterly impressive. The foyer speaks for itself as a welcoming spectacle dwarfing you in the presence of what one would imagine as the home of very fine giants!\nClean and well kept: I can say this about my club room and all the other places I visited in the hotel. Housekeeping definitely lives up to the mark here.\nThe restaurants are impressive- and my favourite was the teahouse. Excellent service and lovely place to relax.\nThe pool and spa: outstanding. Clean. And a pleasure to swim in.\nProblems:\nNuo Hotel fell short in the standards of service processing just upon my arrival where a number of mistakes were achieved in within an hour of my arrival. This also made for a rather lower impression of the hotel than I had started off with. One must not have to ask where the club lounge is if one has a club lounge booking. It should be automatic to take one there. Then I was double charged (for my prepaid room) which I noticed before accepting the payment. This they immediately changed.\nPoor communication about what the hotel sells and does not sell, including conditions for sale, made me cancel an order that I had made. A pity it had to be that way. The situation was poorly managed by Drake.\nPositive staff experience- my thumbs up go to:\nMickey (Head of Executive lounge) and Tiffany (executive lounge staff) good at their jobs. Outstanding performance. Ladies you shined! Thanks again for everything!\nSimon, Edward, Barry and Daniel: concierge. Did their best in arranging everything for me, including my trip to the Summer Palace. Well done! And I will not forget those smiles from you guys!\nEva: O Bar Manager. Pleasant and sassy lady. Lovely, warm personality! Thanks for your warmth and your radiant personality. You make the O Bar great! The DJ definitely did a wonderful mix of music. Well done to him too for setting the perfect tone and mood in the bar.\nHousekeeping did a really good job at taking care of me in the room. Thanks!\nNegative experience from staff:\nI was not happy with the attitude from Drake (Duty Manager) and the failed efforts he made for Cassandra to get in touch with me to solve what in my opinion was a simple problem. Cassandra never got in touch with me even after I was told to expect her to contact me. No explanation was given for this either.\nIn all honesty, I feel the ladies in the Executive Lounge (Mickey and Tiffany) were by far more competent in handling matters than their seniors, and perhaps the managers mentioned above could learn a lot more from Mickey and Tiffany on how to handle guests.\nMr Adrian Rudin (GM), please feel free to get in touch with me should you wish to hear about the rather unfortunate episode which has subtracted that extra mark to what would have otherwise been a well deserved star for Nuo.\nThanks for an overall good stay at Nuo Beijing!", "external_links": [], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T00:42:24.858+03:00", "highlightTitle": ""}