{"organizations": [], "uuid": "88aacedb219aa493d53de2c8f86da5e2fd4e8017", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/90/4d/da/queen-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d192157-Reviews-Ashburn_Hotel-London_England.html", "section_title": "Ashburn Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192157-r460459048-Ashburn_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Excellent location and wonderful service", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Excellent location and wonderful service - Review of Ashburn Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-07T02:00:00.000+02:00", "replies_count": 1, "uuid": "88aacedb219aa493d53de2c8f86da5e2fd4e8017"}, "author": "Matthew_S1980", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192157-r460459048-Ashburn_Hotel-London_England.html", "ord_in_thread": 0, "title": "Excellent location and wonderful service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Booked hotel for a surprise weekend away for wife's birthday. Originally chose hotel due to location - walking distance to Royals Albert Hall and literally 2 mins from underground with several lines. I had also read about the service. I notified hotel in advance that it was a special weekend and upon arrival at 11.30am they had already got room ready for us which was great and had placed a card with chocolates in room wishing my wife a happy birthday. Within a couple of mins of arriving they also brought two glasses of bubbly to the room as another gesture! The staff continued to be super helpful and friendly for the whole weekend, couldn't fault them in any way.\nWe had a king double, which was perfect and provided plenty of space. Hotel is just off main road but couldn't hear any traffic. The room and hotel is nicely decorated and has an upmarket feel and very clean. Yes there is the odd mark here and there but it is a hotel after all and you would have to be really picky to notice it. We had continental breakfast in bed both days, which was typical breads, hams and cheeses with cereal, hot drinks and juices and was plenty. Each evening you get a complimentary drink which is a lovely touch.\nThe location is great with the underground a couple of mins walk and takes you to all major attractions. There are also numerous restaurants and eateries within a couple of minutes walk and a Waitrose. The best compliment I could give the hotel is that we will definitely use it again, and thank you to the staff for making the weekend that extra special\nRoom Tip: King double is good sized room and large bed See more room tips", "external_links": [], "published": "2017-03-07T02:00:00.000+02:00", "crawled": "2017-03-31T16:13:45.123+03:00", "highlightTitle": ""}