{"organizations": [], "uuid": "b9a5644331ab07299ce395431f954e091f6d0adf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/ef/6e/b7/hotel-mistral.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d608193-Reviews-Hotel_Mistral-Paris_Ile_de_France.html", "section_title": "Hotel Mistral - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d608193-r468336706-Hotel_Mistral-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Do not have front desk staff order taxi for you", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Do not have front desk staff order taxi for you - Review of Hotel Mistral, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "b9a5644331ab07299ce395431f954e091f6d0adf"}, "author": "traveljunkie1978", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d608193-r468336706-Hotel_Mistral-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Do not have front desk staff order taxi for you", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The hotel is in a good location. Not too far from the Montparnasse train station. My room was clean, the bed was comfortable. There was no kettle for coffee or tea. There was barely any room between the bed and the wall. The size was fine for one person, but I can't imagine two people in the room. I had breakfast only one of the mornings I stayed there. Nice selection of items. Besides the eating area inside, there is a patio for when the weather is nice. I had to share a table the morning I had breakfast because it was crowded. Coffee was always available downstairs in the breakfast area. After a long day, it was nice to sit downstairs and relax with a capaccino. The only issue I had with Hotel Mistral was with getting a taxi. The first time the front desk called for a taxi for me, I thought the fare was a little high. When I checked out of the hotel, I was told by the front desk clerk the fare to the airport would be 25 euros. When I arrived at the airport, I was told it was 45 euros. I was astounded. The driver informed me that it was because the front desk clerk called him. It I had hailed the taxi outside the hotel, I would not have been charged the extra fee.\nI believe I should have been informed by the desk clerk regarding the up charge. I wrote to the hotel when I arrived home. Their response was not satisfactory. I will be visiting Paris in two months, and I will not be staying at Hotel Mistral. I travel frequently and hadn't run into this taxi issue ever before. In good conscience, I can't stay at Hotel Mistral again.", "external_links": [], "published": "2017-03-18T02:00:00.000+02:00", "crawled": "2017-03-27T04:22:03.364+03:00", "highlightTitle": ""}