{"organizations": [], "uuid": "e0ab616b135b491fd54126a92bf9d117fc4f4268", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/c8/d7/5b/appia-antica-resort.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d4698947-Reviews-or5-Appia_Antica_Resort-Rome_Lazio.html", "section_title": "Appia Antica Resort - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d4698947-r459106475-Appia_Antica_Resort-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Nice apartment but lack of understanding to customers needs", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Nice apartment but lack of understanding to customers needs - Review of Appia Antica Resort, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-27T02:00:00.000+02:00", "replies_count": 0, "uuid": "e0ab616b135b491fd54126a92bf9d117fc4f4268"}, "author": "JohnBron", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d4698947-r459106475-Appia_Antica_Resort-Rome_Lazio.html", "ord_in_thread": 0, "title": "Nice apartment but lack of understanding to customers needs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed at these apartments for three nights in February 2017 primarily to watch a Rugby international as part of a holiday touring Italy. Our party consisted of 2 mature couples who have visited Rome on 5 previous occasions. We chose the property because it had private parking and access to central Rome by bus as we did not want to drive in central Rome.\nName and location.\nIt is a misnomer to call the Appia Antica a resort. The definition of a resort is somewhere where you go for rest, food and entertainment. The Appia Antica is a set of 3 apartments in a private house with a small garden (the owner lives above), in a residential area of Rome. So it is clearly not a resort in true terms. The property is situated on a busy road which in part is quite scruffy, has large refuse bins on the pavement and cars are also parked on it which means that it is difficult to walk in a direct line.\nAccommodation.\nWe stayed in the 3/ 4 bedroom apartment. The beds were comfortable and could sleep up to 8 people. However the seating n the living area would only accomodate 4 or 5 people. There was a dining table in this room and a table and chairs the kitchen which ajoined the living room.\nThe apartment was very well appointed and spotlesly clean. Every cupboard was full of china, glass and equipment which didn't leave any room for food! The eclectic decoration was not totally to our liking but that is personal choice..\nAdvice from owners\nWhen we arrived after a long drive from Tuscany we did not want to be confronted by the owner who gave us a full tour of his garden explaining everything about the plants, age of the trees, Koi carp etc. before we could unload our car. We had driven over 3 hours to get to Rome and all we wanted at that stage was have a cuppa. We unloaded and within a few minutes Julia , the owners assistant, arrived to give us a talk on Rome and the Appian Way. I had already told her in e-mails that we had visited Rome several times and walked part of the Appian way, all we wanted was a timetable for the local bus! Julia, was very nice and pleasant but she was with us for 30 minutes. She told us it was her shortest talk ever, we understand from other guests that they are normally about 90 minutes.\nWe knew exactly what we wanted to do in our 2 day visit and it was not to listen to a long talk on wines we could taste, what accompanied walks we could do or visits we could take, all at a price of course. They should tailor their talks to the needs of the guests rather than delay them by telling them things they don't need to know especially after a long car journey. It's better to find out what guests need rather than ram everything down their throats.\nAnother aspect we did not like was the constant referral by the owner to being number one on trip advisor and how important it was to them to be number one. I had an e-mail on my return telling me how to fill in the trip advisor schedules giving excellent on every occasion. We stayed in 2 other hotels in Italy both had a far nicer”feel” to them because of the pressure we felt to give a good rating\nI have tried to be totally objective in this review and have not been swayed by the owner of the apartments whatsoever who certainly wants to stay No1.\nWe travelled as 2 couples neither of us would return. They are good apartments , clean and modern but not for us.", "external_links": [], "published": "2017-02-27T02:00:00.000+02:00", "crawled": "2017-03-27T03:17:15.550+03:00", "highlightTitle": ""}