{"organizations": [], "uuid": "a864916c64e7d23e22ee3d976a721087866196d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/20/3b/c1/studio.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d6003130-Reviews-The_Beaumont-London_England.html", "section_title": "The Beaumont - UPDATED 2017 Hotel Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6003130-r468643286-The_Beaumont-London_England.html", "country": "US", "domain_rank": 189, "title": "Perfect Location and Stay in London with Service like no other!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Perfect Location and Stay in London with Service like no other! - Review of The Beaumont, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "a864916c64e7d23e22ee3d976a721087866196d6"}, "author": "MeWorld22", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d6003130-r468643286-The_Beaumont-London_England.html", "ord_in_thread": 0, "title": "Perfect Location and Stay in London with Service like no other!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We just returned from a 4 night stay during Spring Break at the Beaumont with our 2 college-aged daughters and it was one of the most memorable places we have ever stayed. From the time of booking to the time of check-out, every single member of the staff catered to our every need and went above and beyond. Prior to arrival, the house and concierge staff - Isabelle, Christophe, Kathrin, Theo, Virginie etc - helped make our stay comfortable at every moment and also arranged several excursion, tea, and dinner reservations for us.\nFrom the moment we arrived, we felt at home and they greeted us by name and with a smile. We appreciated every little touch about this hotel...from the amazing amenities and treats in the rooms: chocolates, cupcakes, nuts, macarons, gourmet teas, etc. to the fresh croissants and scones each morning in the Cub Room...to the bar drinks and lovely spa facilities...we were in heaven.\nThe hotel is also located just a few steps away from Oxford, Regent, and Bond streets so we were in shopping heaven.\nThe most comforting thing was when Manoj, the night manager, helped our two daughters find a lovely and safe place for going out at night, arranged a ride for them, and then even called the restaurant to make sure they were ok! My husband and I did not have to ask him for any of that...it was incredibly good of him.\nAnd even to the last day the service did not fail. When we checked out and left our coats behind by accident, they arranged for a driver to bring them to us at the airport terminal.\nThe general manager Jannes is extremely personable and truly knows how to pick the right staff and create a fantastic environment for his guests.\nI work in the travel business and we have traveled all over the world. When it comes to hotel customer service, The Beaumont is now on my top 5 places of all time!\nI will recommend The Beaumont to my clients and will definitely stay there the next time we visit London!", "external_links": [], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-26T22:17:51.701+03:00", "highlightTitle": ""}