{"organizations": [], "uuid": "bf93ccc904f4d97b536ddddef44692dae3ef2b36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/32/4d/8d/superior-king-guest-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d195225-Reviews-or10-London_Marriott_Hotel_County_Hall-London_England.html", "section_title": "London Marriott Hotel County Hall - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d195225-r467284913-London_Marriott_Hotel_County_Hall-London_England.html", "country": "US", "domain_rank": 189, "title": "Near Perfect", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Near Perfect - Review of London Marriott Hotel County Hall, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "bf93ccc904f4d97b536ddddef44692dae3ef2b36"}, "author": "BestTravelUSA", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d195225-r467284913-London_Marriott_Hotel_County_Hall-London_England.html", "ord_in_thread": 0, "title": "Near Perfect", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My husband and I, along with our two adult children and cousin, just returned from a MAGNIFICENT stay at the London Marriott Hotel County Hall.\nThe location is AMAZING! You will have priceless views of Big Ben, House of Parliament, the London Eye, and Thames River from some of the rooms and also the Executive Lounge. Both Westminster and Waterloo Stations were within easy walking distance. Buckingham Palace, Trafalgar Square, Piccadilly Circus are about a mile away. We also walked to see the Lion King and Aladdin which were about 1.5 miles away from the hotel.\nBut in addition to the beautiful newly renovated rooms (some of the friendly and unobtrusive construction workers were still renovating rooms on the 4th floor were our kids were staying), the staff were simply FRIENDLY and accommodating. We want to specifically mention Elizabeth and Felicia from the Front Desk who were so down to earth and helpful, Mihai from the luggage staff who showed us helpful things about our room including the light and mirror inside one of the closets, and the OUT OF THIS WORLD Executive Staff of Kib, Kuki, Andre, and I'm so upset that I forgot the name of the lady from Poland who welcomed us two of the three days we were at the Lounge. I also did not catch the name of the young man who brought extra toiletries to our room. He was also the same young man who made up the sofa bed in our children's suite. The staff is international and are the friendliest and most professional people you'll meet.\nAnd we must attest to the examples of management. Our family were getting ready to go on the elevator, but there were a group of about 5-7 from the management staff also waiting for the elevator. When they saw us, they let our family take the elevator even though they were there first! Truly amazing service!\nThe beds were very comfortable and we were impressed with the very large towels. That was the first time we've stayed at a hotel that had BIG towels for guests.\nThe only sour experience was when we returned Saturday around 3 pm to our room. We always leave tip for the housekeeper. That Saturday, we got to our room and our room was not serviced (bed not made), but the tip was no longer there. We were concerned as we want to make sure the one who makes up our room is the one who gets the tip and not just anyone who may have access to the room. We called to the front and we didn't really want anyone to clean our room anymore, but it was made up when we returned after dinner.\nOur room was 235 and it overlooked Thames River. Our kids were on a different floor. Their suite in 408 overlooked Thames and the London Eye. But it was very far away from the elevator. One of them recorded their walk from the elevator to the room and it was about 2 minutes. But that was okay as they are young. They could use the exercise. :-)\nBut we will still give the hotel 5 stars as our overall experience was MAGNIFICENT! Thank you to the staff for making our stay very special!", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-31T23:16:59.819+03:00", "highlightTitle": ""}