{"organizations": [], "uuid": "5b34f470c6717429ae5b84ce14ae0edd6b0946e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/45/83/48/the-hotel--v9167999.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d188492-Reviews-Prince_de_Galles_Hotel-Paris_Ile_de_France.html", "section_title": "Prince de Galles Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d188492-r468560199-Prince_de_Galles_Hotel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Everything You Would Want and More", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Everything You Would Want and More - Review of Prince de Galles Hotel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 1, "uuid": "5b34f470c6717429ae5b84ce14ae0edd6b0946e7"}, "author": "AnArchitect4u", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d188492-r468560199-Prince_de_Galles_Hotel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Everything You Would Want and More", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My husband and I have stayed here twice during October 2015 and 2016, respectively. With his SPG Platinum Ambassador status, we truly felt like royalty during our entire stay. Both times we enjoyed a city-side large suite overlooking George V. and particularly loved the in-room breakfast dining that they brought to the suite each morning (one of the welcome gift options for SPG Plat. members). The level of service was impeccable from the housekeeping staff to the concierge who helped book our dinners each night, and even the courtesy car we rode to one of our dinners in. Our 2015 stay was split between PDG and the Westin- Vendome, which was a mistake. The Westin -Vendome was complete disappointment on several fronts and would advise against that hotel if you're debating SPG properties. So much som that we decided for 2016 that it was worth spending the extra money to have a top-rate experience and know that the staff here are trained enough not to miss basic details and truly go the extra mile to ensure the happiness of their guests.\nThe location is fabulous - just a few minutes up to George V Metro stop, Champs- Elysee and Siene/Eiffel Tower in the other direction. We also appreciate that this hotel is off the beaten 'tourist path', so to speak. I'm an architect and appreciated their renovations to create an Art-Deco inspired space.\nTherefore, it is with confidence that I recommend the Prince de Galles for those wishing to make the most of their Paris experience while receiving 5 star treatment in the process!\nRoom Tip: Ask for a city view. See more room tips", "external_links": [], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-29T10:53:16.114+03:00", "highlightTitle": ""}