{"organizations": [], "uuid": "80c40f49c19a069cc8a16cd8e7ee63bef8285946", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/55/ae/de/park-lounge-bar.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93520-Reviews-or10-Park_Central_Hotel_New_York-New_York_City_New_York.html", "section_title": "Park Central Hotel New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93520-r469888968-Park_Central_Hotel_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Classy and Comfy at the Same Time!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Classy and Comfy at the Same Time! - Review of Park Central Hotel New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-24T03:00:00.000+03:00", "replies_count": 1, "uuid": "80c40f49c19a069cc8a16cd8e7ee63bef8285946"}, "author": "Geewhy7", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93520-r469888968-Park_Central_Hotel_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Classy and Comfy at the Same Time!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I joined my daughter's choral group on their trip to NYC to perform at Carnegie Hall. The Park Central was right across the street, and it was also extremely convenient to all of the sites that we were planning to visit. Between walking and reaching a subway, it was a perfect location.\nThe staff were quite professional and courteous. It's not always easy to host large groups, but they managed us without an issue. When I arrived, my suitcase vanished and they were quick to help me track it down; I knew it came in with the rest, and it turned out that a person in our group had taken it by mistake. I made sure to buy a green bandanna to ID it faster in the future!\nThe rooms themselves were spotless, the beds were very comfortable, and there was an ample supply of towels so that we didn't have to call for more. I appreciated the sleep timer on the tv remote control, something that sounds minor but these days is absent from most hotel rooms.\nThe security to get to the other floors was excellent, and though we were a little slow to find out that our key was required for the use of the elevator, it all worked out and this was great!\nOne thing that would have helped was a microwave/fridge in the room. Not sure if it's because it's an older hotel, but with all of the ample portions and treats we could access on our trip, we had to leave the leftovers behind due to a lack of storage. With prices a bit higher than at home, any special help with this would have been a budget-bonus. A fridge could be requested but being put on a waiting list didn't get it to us before the end of our stay.\nWhile we didn't use the bar services nor the small deli-type area, the waiting areas by both the bar as well as the lobby was very spacious, with many seating opportunities and outlets to recharge electronics (bar area).\nI'm not sure when I'll be able to return to NYC, but I would definitely look into the Park Central Hotel as my first choice of a place to call home for the time that I am there!\nRoom Tip: Our room had a view of apartment buildings and some construction but it was so interesting just the... See more room tips", "external_links": [], "published": "2017-03-24T03:00:00.000+03:00", "crawled": "2017-03-31T20:24:54.110+03:00", "highlightTitle": ""}