{"organizations": [], "uuid": "2ba45d3134b16fb02616c4aa536035b367fde3db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/7e/66/e8/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d587294-Reviews-or20-The_Westin_Paris_Vendome-Paris_Ile_de_France.html", "section_title": "The Westin Paris - Vendome - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d587294-r463558213-The_Westin_Paris_Vendome-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Great location, friendly staff, but some problems with thermodynamics", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Great location, friendly staff, but some problems with thermodynamics - Review of The Westin Paris - Vendome, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-28T02:00:00.000+02:00", "replies_count": 1, "uuid": "2ba45d3134b16fb02616c4aa536035b367fde3db"}, "author": "KevinE518", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d587294-r463558213-The_Westin_Paris_Vendome-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Great location, friendly staff, but some problems with thermodynamics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We paid for a suite here to enjoy our few days in Paris and get an included breakfast. The breakfast was ample and tasty and the breakfast staff work hard to make things comfortable and delicious. The hotel staff is also quite good but we did have a few gripes related to thermodynamics:\n(1) our shower could not properly maintain a desired temperature. I have never been to a hotel where the faucet temperature was fine and then when the water flow is diverted to the shower head, it comes out either ice cold or boiling hot. I wrestled with this for 1.5 days before asking the hotel for a new room. The hotel promptly and graciously set us up in a new room and the shower worked better there but it was still a strange ballet to get the water exactly right.\n(2) the room was also really hot. No amount of fussing with the thermostats could fix it so we slept with the windows open.\n(3) I wanted some ice to keep my beverage cold. This requires a bellhop. I really love self service ice.\nAs oft repeated here, the location is really convenient and walkable to everything. It does get a little quiet and sleepy after dark because of the high concentration of ridiculously exclusive shops and boutiques in the area. This isn't the neighborhood for the rowdy local bars or the all-night convenience stores. But if you want a pair of $4000 shoes, walk 50 paces in any direction from the lobby door.\nFinally, beware of the automatic minibar. It charged us for some orange juice when I looked around in there. The front desk happily removed the charge.\nRoom Tip: I would heartily endorse and outside facing room. In fact, I would strongly caution against a court... See more room tips", "external_links": [], "published": "2017-02-28T02:00:00.000+02:00", "crawled": "2017-03-27T13:19:24.754+03:00", "highlightTitle": ""}