{"organizations": [], "uuid": "14300cf59f7bb30011ebb066de798579ffaf7b5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/44/e5/34/room-mate-grace-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d518280-Reviews-or10-Room_Mate_Grace-New_York_City_New_York.html", "section_title": "Room Mate Grace - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d518280-r465142483-Room_Mate_Grace-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Wonderful time", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Wonderful time - Review of Room Mate Grace, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-06T02:00:00.000+02:00", "replies_count": 0, "uuid": "14300cf59f7bb30011ebb066de798579ffaf7b5c"}, "author": "BillAl1571", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d518280-r465142483-Room_Mate_Grace-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Wonderful time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I live in the NY area and we like to stay in the city once in a while. I'm always looking for a nice hotel near Times Square and the theaters and this one was one I hadn't seen before. I booked online and realized the date was wrong- i called the hotel immediately and spoke with Fransisco who was so helpful and professional. He helped me rebook the correct date and took my # to keep in touch as the price for that date was higher. He kept his word and called me back, not once but twice! It looks just like the pictures! It's very small and cozy. If you don't like darker spaces it might not be for you. Has almost a nightclub feel. The small indoor poor was lit in pink and blue lights. We didn't go in but it looked great. I've read that they do upgrades for a small fee and they did an upgrade from queen to King. The room was so pretty and small. But it's NYC thats what you expect. The bed was very very comfortable. The bathroom was large and the shower was great. Rainhead shower head was so nice and strong water pressure too. I forgot toothpaste and called the front desk. They delivered 2 kits with toothpaste and brushes in 5 mins!! Our heating system was stuck on high and I had to call for that and again someone was there in 5 mins and fixed it! I've never had such great Customer Service at any other hotel. We did the buffet in morning for and extra $11 and in NYC that is the best bargain. Fresh breads, pasteries, cereal, fruit, yogurt, eggs, sausages and cold meats and cheeses. More than plenty for breakfast. We cannot wait to go back!!", "external_links": [], "published": "2017-03-06T02:00:00.000+02:00", "crawled": "2017-03-30T17:16:09.400+03:00", "highlightTitle": ""}