{"organizations": [], "uuid": "d373040a89799554e9731df66b3bbe8d3c529cbd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/42/7f/4c/piscina.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d7976127-Reviews-A_Roma_Lifestyle_Hotel-Rome_Lazio.html", "section_title": "A.Roma Lifestyle Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d7976127-r471186462-A_Roma_Lifestyle_Hotel-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Wow! What a relaxing experience", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Wow! What a relaxing experience - Review of A.Roma Lifestyle Hotel, Rome, Italy - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "d373040a89799554e9731df66b3bbe8d3c529cbd"}, "author": "toetread", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d7976127-r471186462-A_Roma_Lifestyle_Hotel-Rome_Lazio.html", "ord_in_thread": 0, "title": "Wow! What a relaxing experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As soon as my wife and I walked through the door, we were greeted enthusiastically by the hotel staff who gave us a rundown of all of the hotel amenities and room details available to us (in a helpful way...not a pushy sales pitch). This hotel immediately felt different in every other way from most of the hotels we have stayed at in Europe. To be honest, it felt comfortable and polished. As many people have stated in earlier reviews, this is a hotel that appears to cater to the conference crowd, BUT that isn't a bad thing. I've been at some very nice boutique hotels in Europe, but many of the hotels in Europe are very underwhelming (despite their star level). Here are the things we liked:\n- We opened our room and were greated with air conditioning! Glorious air conditioning (something of a rarity in many European hotels)!\n- Next, the beds were COMFORTABLE (another surprise).\n- The minibar was stocked with a handful of snacks and drinks that were fully complimentary.\n- The TV was technologically friendly and could be hooked up to be compatible with your phone.\n- Comfortable bathtub.\n- The gym was nice.\n- The food at the bar was great (it was nice to have access to good food after a long day in the city). I highly recommend their pork sandwich.\n- The pizzas that were delivered to the room were tasty\n- We had an issue with noise in the room above us (people slamming stuff) and when I reported it, they immediately called security to look into the issue. The noise stopped within minutes later.\n- Best breakfast buffet I've experienced in Europe! Absolutely MASSIVE selection of food...and it tasted good.\nOverall, there was very little to complain about because we commented that we would have liked to stay in Rome just a little longer just to chill at the hotel. However, there are a couple of drawbacks listed below:\n- Shuttle pickup service is only free if you reserve your room through the hotel site...and even then it's available only up until a certain point in the evening. So, the taxi ride to the hotel was about $45-$50 from the airport...but that would also be the same regardless of most hotels you stay at in Rome. If you want a ride back to the airport, they do offer a 15 Euro per person ride every two hours in the morning (has to be reserved).\n- Some of the elements of the room needed some minor repair.\n- Room service charge. I ended up with a 15 Euro room service charge on my bill. We only ordered pizzas in the room (which made no mention of a room service charge), but the Room Service menu DOES mention the 15 Euro charge. Interestingly, we ordered pizzas twice, but were only charged once. This needs clarification on the pizza combo brochure advertised in the room.\n- It's a bit out of the center of Rome. They do offer shuttles into town to two different locations. Each of them run 2 Euros a person each way. One operates in the morning and the other in the evening. They alson have to be reserved ahead of time to ensure that you've got a ride...although the staff was incredibly flexible. If you don't grab the shuttle, you're looking at an approximately $20 cab ride both ways.\nI know that the above mentioned items sound significant, but they pale in comparison to the expierence that we enjoyed. Thanks and if we ever come back to Rome, A.Rome will be on our mind when booking.", "external_links": [], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T07:01:50.899+03:00", "highlightTitle": ""}