{"organizations": [], "uuid": "931a73631acd110de6f05960bf895bb1cab412f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/5f/05/37/images-the-montcalm-london.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d192069-Reviews-or20-The_Montcalm_London_Marble_Arch-London_England.html", "section_title": "The Montcalm London Marble Arch - UPDATED 2017 Hotel Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192069-r466586989-The_Montcalm_London_Marble_Arch-London_England.html", "country": "US", "domain_rank": 189, "title": "Expect to feel like Royalty!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Expect to feel like Royalty! - Review of The Montcalm London Marble Arch, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-12T02:00:00.000+02:00", "replies_count": 0, "uuid": "931a73631acd110de6f05960bf895bb1cab412f6"}, "author": "Fifitrixie22", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192069-r466586989-The_Montcalm_London_Marble_Arch-London_England.html", "ord_in_thread": 0, "title": "Expect to feel like Royalty!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Right from the moment we were contacted about our booking at The Montcalm we felt looked after and it was clear that the staff only wanted the best for us out of our stay. We were given options surrounding everything from the in-room-scent to the pillow choices and we had no worries at all about any aspect of our stay.\nWe arrived at The Montcalm a few hours prior to check in but were able to leave our bags safely with the team meaning we could go out and comfortably explore the vast sights and shops which are on the doorstep.\nWhen we came back later on, our bags had already been taken up to our room which we were personally shown to and given all the information we needed surrounding our stay such as wifi and the spa details etc.\nWe were greeted with fresh fruit and water as well as chocolates and wine which were very much welcomed after an afternoon on our feet! As was the comfy bed and clean and fresh bathroom facilities coupled with the quietness which really was a pleasant surprise seeing as we were so close to so many bustling streets in this area of London.\nThe turn down service was appreciated and as we were lucky enough to have been upgraded to a Suite (thank you!) we had access to the Club Lounge which had a good selection of complimentary drinks and offered a substantial continental breakfast in the morning. We felt thoroughly spoiled!\nOn checking out, the staff went out of their way to make us feel looked after and that our stay was appreciated by the team as they kindly offered us water or to book a taxi for our onward journey.\nWe had a first class experience at The Montcalm, right from clicking 'book' and would not hesitate to stay anywhere other than here when visiting London in the future.\n(We did not visit the spa on this visit but have done previously and it honestly ranks as one of the best facials/massages we have had anywhere. On a previous visit we also had afternoon tea and dinner at The Montcalm and the service and quality of food was outstanding)\nThank you Team Montcalm and especially Izabela, you are doing a great job!\nRoom Tip: Suites on Floor 6 are very well serviced and have access to Club Lounge See more room tips", "external_links": [], "published": "2017-03-12T02:00:00.000+02:00", "crawled": "2017-03-27T03:53:12.053+03:00", "highlightTitle": ""}