{"organizations": [], "uuid": "a87595f76e990e26b349fe96a9b92a4f5cb636c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/86/64/a5/hotel-eiffel-seine.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d572984-Reviews-Hotel_Eiffel_Seine-Paris_Ile_de_France.html", "section_title": "Hotel Eiffel Seine - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d572984-r468907250-Hotel_Eiffel_Seine-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Convenient and Comfortable Boutique Hotel -", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Convenient and Comfortable Boutique Hotel - Review of Hotel Eiffel Seine, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 1, "uuid": "a87595f76e990e26b349fe96a9b92a4f5cb636c2"}, "author": "AkulRastogi", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d572984-r468907250-Hotel_Eiffel_Seine-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Convenient and Comfortable Boutique Hotel -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Me and my family were visiting Paris for the first time and for us, this place was perfect. Clean and tidy rooms with good views.\nLocation is the prime benefit of this place. Airport taxis take a flat €55 charge and additional €1/luggage. Cabs and metro are available right in front of the hotel. Bus stops are just near the corner, 20 steps away. The Eiffel tower is just a straight 5 min beautiful walk along the river. For food, there is Subway, pizzerias, cafe and crepes just next to the hotel.\nI had booked 2 nights directly from the hotel's website as they were providing free breakfast. I opted for the bigger, front facing Club Rooms. The size of the rooms wasn't enough for opening more than one big suitcases at once. You get a view of the metro track and the River Seine on the right from a long two-gate window. Sunsets and sunrise were quite scenic.\nBreakfast is simple but good. Kettle is provided for tea/coffee with accompaniments. The TV has only 2/3 English channels. Toilets are roomy and equipped. Rooms are not adequately sound proofed. Noise from the metro, traffic and neighbouring rooms can be heard sometimes. But this bothered me rarely. Bed is comfortable and air conditioning makes the room warm and cosy in winters.\nRest the hotel is pretty small in size. Floor galleries are dark and they light up via motion detection sensors. Lobby and breakfast area are also small but enough for the capacity the hotel can accommodate. Staff was kind and helpful. Since it's a boutique hotel, there are no bellboys. We had to move our luggage ourselves. The lift is pretty small and only for 2-3 persons at max.\nThe hotel also provides an unlimited high speed 4G internet WiFi hotspot for just 1€/day. Speed was fantastic all over Paris. And also there are free toffees at the reception.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-27T15:46:21.485+03:00", "highlightTitle": ""}