{"organizations": [], "uuid": "1d18bd7a2a2bcdd16d60ed60a0c19f25dad4f249", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/bd/89/df/1-hotel-central-park.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d6883205-Reviews-1_Hotel_Central_Park-New_York_City_New_York.html", "section_title": "1 Hotel Central Park - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6883205-r469965349-1_Hotel_Central_Park-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "My Happy Place", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "My Happy Place - Review of 1 Hotel Central Park, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-24T03:00:00.000+03:00", "replies_count": 1, "uuid": "1d18bd7a2a2bcdd16d60ed60a0c19f25dad4f249"}, "author": "Tempest1226", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6883205-r469965349-1_Hotel_Central_Park-New_York_City_New_York.html", "ord_in_thread": 0, "title": "My Happy Place", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 Hotel is my new favorite brand, and it's so exciting to watch them grow. I stumbled curiously upon them, though staying at another hotel, while visiting Miami for the first time a couple of years ago. It definitely caught my interest as it was right up my alley. I love conscious and eco-friendly. It is what I strive for in my own life. I just love the simplicity, the tranquility, the clean lines...It all makes me happy. The 1 Hotel in Miami had JUST opened when discovered it, and although we didn't get to stay there, the brand was now on our radar.\nShorty after, back in NY, my husband somehow found out that they were opening a smaller boutique hotel in NYC. The new location just so happened to be along the express bus route he took home, so he wound up passing it every day. That winter, he surprised me with a nights stay. I was IN LOVE the moment I walked in. THIS was it. My happy place. My sanctuary from urban life (and my life). So all the way from Queens, it was our new \"staycation\" spot. We had been to other hotels, which were nice, but this was perfect.\nSince then, we have surprised each other back and forth with 1 Hotel Central Park staycations, for a total of 3 stays in the last year. Our most recent one being this past January. The rooms are tranquil and beautiful, the staff is wonderful and accommodating (always striving to personalize our stay and make it special) and the location is better than any hotel I have experienced in NYC. It is IN midtown, but away from all the crowds and just at the entrance of Central Park! It really doesn't get any better. It is an oasis in the middle of Manhattan.\nI dance in NYC and had early morning rehearsals last spring. I love 1 Hotels so much, that I would come into the city with my husband to grab breakfast at Jams some mornings, just to FEEL like I was on vacation, and breathe in the air/environment as I sipped my cappuccino (the homemade granola is awesome by the way) before we both to head off into the concrete jungle. *A note about the granola: I had just mentioned that I enjoyed it to someone during our first stay there, and guess what was in our room upon check-in 9 months later when we came back again...an entire bag of my granola waiting for me in my room!\nMy suggestions for a perfect romantic evening in NYC (and our favorite thing to do): Just get 2 seats at the bar at Marea (a two Michelin Star restaurant just a block away from the hotel) Share a couple of their amazing pasta dishes over a few glasses of wine (the deserts are amazing there as well!). Then, go for a romantic stroll through Central Park before heading back to the hotel for maybe a night cap at Jams. ALL within perfect walking distance. 1 Hotel is NOT in the middle of Times Square (thanks goodness) but close enough to walk (or a very short cab ride if your wearing heels, ladies), incase your catching a show.\nFYI: (if this helps in regards to general \"walking distance\"): just to the North you have all of Central Park; to the West is Columbus Circle (and a Whole Foods Market, incase anyone other than me cares about that); East of the hotel is the Plaza (plenty of horse and carriage rides lined up) across from the former FAO Shwartz and upscale 5th Avenue shopping etc.; AND as mentioned, just a bit South West is Times Square. You are also near the subway and buses, and can pretty much go anywhere from there (take if from a New Yorker). We even hopped over to Brooklyn for brunch one time while staying at 1 Hotel Central Park. It took us less than 20 minutes to get to Williamsburg (F to the L train and your there in no time).\nWe have stayed at quite a few places living just outside of NYC and both working in it most of our lives, and this hotel is definitely our favorite. It is also very reasonably priced for such a nice hotel in NYC, especially considering the location. We are so excited to experience their new property that just opened in Brooklyn!!!! I homeschool our 10 year old daughter, it's a lot of work. So when I found out they were opening a bigger/resort like hotel in Brooklyn (similar to Miami I assume), I announced that if I every go missing, it's probably because I kidnapped myself, and that is where I will probably be...but please don't come and find me.\nI really don't think NYC has ANYTHING like it. And I am actually excited because as it turns out, I don't have to kidnap myself after all. We will be staying there one night at the new 1 Hotel Brooklyn Bridge this weekend. I will report back. Keep a lookout ;)\nPS: All the rooms have a cushioned window nook where you can sip your coffee, read, people watch (I think the neighbors across the way know me already. It sounds creepy I know, but this is what we do in NYC, we watch each other, because we don't have wildlife). Anyway, I now know what it feels like to be a cat, as I could just sit there and gaze out the window all day :-)\nRoom Tip: Central Park View rooms are my favorite. The higher the floor the better of course. See more room tips", "external_links": [], "published": "2017-03-24T03:00:00.000+03:00", "crawled": "2017-03-30T01:11:34.464+03:00", "highlightTitle": ""}