{"organizations": [], "uuid": "315c21d641bc986b4b98c706345f5e57c784d759", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/d5/46/ca/guest-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d1236762-Reviews-Le_Metropolitan_a_Tribute_Portfolio_Hotel-Paris_Ile_de_France.html", "section_title": "Le Metropolitan, a Tribute Portfolio Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1236762-r465566063-Le_Metropolitan_a_Tribute_Portfolio_Hotel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Excellent Location with Friendly Staff", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Excellent Location with Friendly Staff - Review of Le Metropolitan, a Tribute Portfolio Hotel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-08T02:00:00.000+02:00", "replies_count": 1, "uuid": "315c21d641bc986b4b98c706345f5e57c784d759"}, "author": "Meeshy34", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d1236762-r465566063-Le_Metropolitan_a_Tribute_Portfolio_Hotel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Excellent Location with Friendly Staff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed here for a long weekend to celebrate our anniversary in Paris. We were arriving very early and I knew check in wasn't until 3pm. I notified the hotel ahead of time in case there was a chance we could check in early. When we arrived, we were warmly greeted by the front desk staff. They unfortunately didn't have a room ready. We were disappointed since we were exhausted from the red eye flight from NYC. My husband and I decided to see if we could pay for an upgrade. They had a room free and we were able to get it complimentary.\nThe room was a deluxe room on the 6th floor (no views - but that's ok). I knew European rooms were tiny, but I wasn't expecting it to be so small. The room was also too dimly lit for our taste. We found it strange that the toilet was in a separate room from the shower. It wasn't even next to each other; it was across the room. The bathroom also didn't have much lighting, so showering at night was near impossible. We took one of the lamps and moved it to the bathroom so we could see. The space is also miniscule. We couldn't keep anything in the bathroom and had to use the desk space in the room for our toiletries. We did appreciate the Korres toiletries provided.\nThere is 2 complimentary bottles of water provided each day and they also have a cell phone you can use throughout your stay. You can use it to make unlimited phone calls and to look up things even outside of the hotel. We didn't use it since we made arrangements ahead of time with our wireless carrier but it's great to know they have this for future stays. The only other complaint I had (other than the lighting) was the room was extremely warm at night. We let the front desk know and they tried to fix it, but it was still a little warm for our liking.\nWhat we loved was that the hotel was so close to many of the locations we were going to. It was a 20 minute walk to the Eiffel Tower, a 10 minute walk to Trocadero Metro station (even though we didn't use the metro) and a 15 minute cab ride every where else. The staff was lovely and always friendly to us. The servers at the bar were more than happy to assists us. My husband loved the madelines sent to our room as a welcome and they tried to get him some more - although the chef only makes them Tuesday - Saturday :(. They also have umbrellas if you need them at the front.\nOverall, we really enjoyed our stay and look forward to staying here again when in Paris.\nRoom Tip: Try to get a room with the view of the Eiffel Tower. See more room tips", "external_links": [], "published": "2017-03-08T02:00:00.000+02:00", "crawled": "2017-03-28T20:32:20.742+03:00", "highlightTitle": ""}