{"organizations": [], "uuid": "72203dd85a3680efe1535cbcbff416ef453cfddd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/af/67/a1/exterior-at-night.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d10723260-Reviews-The_Westbourne_Hyde_Park-London_England.html", "section_title": "The Westbourne Hyde Park - UPDATED 2017 Hotel Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d10723260-r471278803-The_Westbourne_Hyde_Park-London_England.html", "country": "US", "domain_rank": 189, "title": "Close to Paddington, Modern, Quiet, Cosy, Relaxing Studio Rooms", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Close to Paddington, Modern, Quiet, Cosy, Relaxing Studio Rooms - Review of The Westbourne Hyde Park, London, England - TripAdvisor", "spam_score": 0.96, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "72203dd85a3680efe1535cbcbff416ef453cfddd"}, "author": "MargaretPowell", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d10723260-r471278803-The_Westbourne_Hyde_Park-London_England.html", "ord_in_thread": 0, "title": "Close to Paddington, Modern, Quiet, Cosy, Relaxing Studio Rooms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fourth time in London, I was looking for more than a basic hotel room and found it here. This mini suite has a small bedroom, tiny bathroom and a combined living room, desk, wardrobe and kitchenette room. As a solo traveller, this allowed the preparation of light meals in the kitchen so I did not have to eat out alone.\nThis review would have been for 5 stars, and a few simple improvements would achieve this.\nThe Pros: An easy walk from Paddington and Heathrow Express of about 5 minutes even rolling 23kg of luggage. Room is superclean and modern, cosy decor. Kitchenette and Nescafe pod machine a huge bonus. Amazing dual fixture shower with rainfall and hand held. Great quality toiletries, comfy bed and pillows, bed linen and the fluffiest towels and robes I have had at a hotel in a while, Convenient kitchenette with bar sized fridge. Good free Wifi.\nThe Cons: Although kitchen is supplied, there is no dishtowel or soap or tray for draining dishes? This I do not understand. Had to use bathroom liquid soap to clean dishes. The bedroom and bathroom are tiny. Cannot open draw in bathroom if the door is open. Pity the door was not concealed slider in design. No door between living area and bedroom so if you have extra guests no privacy. Recommend this suite for 2 people only. Luggage must be kept in living area as there is no space in bedroom. This is why walls are badly scuffed. Housekeeping staff need to be equiped with the magic eraser ( like many hotel Housekeepers are) to remove the scuffs on walls and keep the paintwork looking fresh.Footsteps can be heard from upstairs rooms but no voices or sounds laterally. Windows pop open a little for fresh air. This hotel has no restaurant, room service, or mini bar either. Supermarkets and other shops near Paddington Station.\nEasy walk to Hyde Park, Marble Arch, V&A, Oxford St and Portobello Road if you like to walk. Great bus connections and tube at Paddington. Lancaster Gate station closed at present.\nOverall, with wall scuffs cleaned, some added kitchen necessities and attention to detail on maintenance going forward, this hotel could be a real find. To stay again, would need to check current reviews to see if the standard has been maintained.\nVerdict, on balance I really liked this hotel, my favourite in London so far and great value for what I paid.\nRoom Tip: My room faced the back and was super quiet ( except for stomping of guests in room above) See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T17:52:44.299+03:00", "highlightTitle": ""}