{"organizations": [], "uuid": "6bd5c252d5a8da82e01ce3c28b054d9923598b22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/5e/0e/52/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d595677-Reviews-Park_Plaza_Wangfujing-Beijing.html", "section_title": "Park Plaza Wangfujing - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Beijing, China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d595677-r465378780-Park_Plaza_Wangfujing-Beijing.html", "country": "US", "domain_rank": 189, "title": "Park Plaza Wangfujing", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Park Plaza Wangfujing - Review of Park Plaza Wangfujing, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-07T02:00:00.000+02:00", "replies_count": 0, "uuid": "6bd5c252d5a8da82e01ce3c28b054d9923598b22"}, "author": "roma47", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d595677-r465378780-Park_Plaza_Wangfujing-Beijing.html", "ord_in_thread": 0, "title": "Park Plaza Wangfujing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Park Plaza Beijing Wangfujing\nThe Park Plaza Beijing Wangfujing on Jinbao Street is centrally located in Beijing where location is important when consideration is given that Beijing encompasses an area larger than the state of Connecticut. Check in was efficient and included an upgrade to the Club floor. The buffet breakfast was included and as always in China, there were lots of choices. The hotel caters to all nationalities and the buffet reflected their eating habits, so there was no shortage of choice. Club facilities were useful particularly for translation of emails. The main attraction of the Park Plaza is their location in central Beijing where major sites are within walking distance from the Forbidden City to the very popular Wangfujing shopping street closed off to traffic and equivalent to Chicago’s Golden Mile. The Forbidden City was about 20 min walking distance. Bring your passport and senior rates apply. Closeby are cabs (inexpensive) to the Temple of Heaven, Drum Towers and Summer Place which are also easily accessible by their excellent subway system (necessary to move some twenty million people). By the way, air quality was good and “sun” sightings were common. Park Plaza is located near the 2nd Ring Road.\nAs for the hotel facilities, they were clean with usual extras like newspapers and maps were available. Across from the hotel was a Starbucks and a popular Cantonese restaurant was closeby, useful for snacks, dinners or lunches. The Chinese like warm rooms and the air-conditioning emitted warm air. A room tip is to turn-off the so-called air-conditioning and open the windows making the room more comfortable for Westerners.", "external_links": [], "published": "2017-03-07T02:00:00.000+02:00", "crawled": "2017-03-26T23:44:47.586+03:00", "highlightTitle": ""}