{"organizations": [], "uuid": "be96965baca3ecb6edf2588ed9aa006542e4c80b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/5d/ef/77/the-hotel--v5488252.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d265539-Reviews-or50-St_James_Court_A_Taj_Hotel-London_England.html", "section_title": "St. James' Court, A Taj Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d265539-r466295078-St_James_Court_A_Taj_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Wonderful Property, Location, and Amenities - but the best part is the People who work there!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Wonderful Property, Location, and Amenities - but the best part is the People who work there! - Review of St. James' Court, A Taj Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-11T02:00:00.000+02:00", "replies_count": 1, "uuid": "be96965baca3ecb6edf2588ed9aa006542e4c80b"}, "author": "C1JD", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d265539-r466295078-St_James_Court_A_Taj_Hotel-London_England.html", "ord_in_thread": 0, "title": "Wonderful Property, Location, and Amenities - but the best part is the People who work there!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Just got back from spending five nights at the St. James Court Hotel. My family and I simply cannot say enough good things about our stay. The hotel location is excellent and our 6th floor rooms (adjoining executive king room and family room with sitting area) were perfect for our family of 5 . . . large, quiet, completely updated, and sparkling clean. The breakfast buffet (included in our rate) was generous, delicious and served in a room surrounded by floor to ceiling windows in the middle of the gorgeous and colorful hotel courtyard. With interesting guests from all over the world the hotel has a very cosmopolitan feel which adds to the richness of the experience. In the end, though, what made the St. James Court truly special for us were the many, many members of the hotel's management and staff who routinely went out of their way to make sure we were comfortable and that they met all of our needs. This includes, but is not limited to: surprising us with two delicious and beautiful chocolate mousse cakes in celebration of my wife's birthday, being extra diligent in taking my son's food allergies into consideration and making sure that my son had plenty of safe choices (some specially prepared for us), sending first aid personnel and numerous ice packs to my room when they heard that I was injured aboard a tour bus, and then sending a bowl of fresh fruit to cheer me up and checking in on how I was feeling. I would highly recommend the St. James Court hotel to anyone planning to visit London.", "external_links": [], "published": "2017-03-11T02:00:00.000+02:00", "crawled": "2017-03-31T19:06:24.176+03:00", "highlightTitle": ""}