{"organizations": [], "uuid": "416ed787578526e2107b3d5b08dd254a571abc4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/a7/c7/d2/citizenm-new-york-times.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d6385164-Reviews-or10-CitizenM_New_York_Times_Square-New_York_City_New_York.html", "section_title": "citizenM New York Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6385164-r469053932-CitizenM_New_York_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great Centrally Located Hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great Centrally Located Hotel - Review of citizenM New York Times Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 0, "uuid": "416ed787578526e2107b3d5b08dd254a571abc4d"}, "author": "Fionn M", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d6385164-r469053932-CitizenM_New_York_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great Centrally Located Hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This hotel is very good and really central in NYC, highlights were the comfy bed and the rooftop bar.\nCheck-in was easy and self service it only took a second to do, we stayed in Room 1015, the view wasnt great mainly looking down on other buildings roofs but no biggie.\nThe room itself is standard with a massive bed against the window.. the downside being the person on the inside needed to clamber over the other person. Bed was comfy. The bathroom had frosted glass which was a little revealing if someone was in the shower... there is a net curtain in the room too but this didnt do a whole lot so you'd want to be comfortable with the person you are sharing with!\nThe room was controlled by an iPad Mini which was pretty nifty but also some times annoying... we never figured out how to turn on the toilet lights without turning on EVERY light.\nThe blind also if let go down completely was too long so would buckle, small thing but annoying just the same as you had to stop it when it got to the bottom.\nThe TV was well setup with plenty of channels and movies, what I really liked was the Airplay / Miracast options if you wanted to fling something to the TV... we were able to watch stuff off our home Plex server on the tv with no issue or also netflix.\nThe lobby is well setup with a bar and food, also handy is a selection of beers etc.. you can buy like a shop and take to the room.\nThe rooftop bar was also very nice and quiet with great views.\nThe location is brilliant right beside Times Square with plenty of subway options within seconds walk as well as a wallgreens / duane reed next door.\nOverall the hotel was great if a little bit on the pricey side.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-27T03:17:33.590+03:00", "highlightTitle": ""}