{"organizations": [], "uuid": "bdb09418f7ad412787afabc438d68715c753b7b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/0d/13/6c/hotel-exterior-at-night.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1456560-Reviews-or10-Kimpton_Hotel_Eventi-New_York_City_New_York.html", "section_title": "Kimpton Hotel Eventi - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1456560-r468827206-Kimpton_Hotel_Eventi-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Still the Best Hotel for Combining Business and Pleasure in NYC", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Still the Best Hotel for Combining Business and Pleasure in NYC - Review of Kimpton Hotel Eventi, New York City, NY - TripAdvisor", "spam_score": 0.083, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "bdb09418f7ad412787afabc438d68715c753b7b9"}, "author": "Warm Weather Traveler", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1456560-r468827206-Kimpton_Hotel_Eventi-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Still the Best Hotel for Combining Business and Pleasure in NYC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I first reviewed the Event in December of 2015, and said it had won my business away from another Kimpton, The 70 Park. Shortly thereafter, the 70 Park became an Iberostar property, so good for Kimpton that the management team of Eventi retained a Kimpton customer.\nThe Eventi is by far the best hotel in NYC for mixing business and pleasure. My wife sometimes accompanies me to business meetings in the city, and there is no place we'd rather stay. The Eventi combines the hip vibe of a Gansevoort, the bustling staff of a top Hilton, the white glove service of a 5 star hotel like the Waldorf or St. Regis, and accommodations which are large and plush by midtown NYC standards. The mattresses rival those in 5 star hotels like Le Sirenuse in Italy. You can tell you are in a great hotel when the hotel restaurants are packed with people not even staying at the hotel!\nFor us, though, the management team is what really makes the hotel special. Assistant Front Office Manager Dominique St. Paul regularly exceeds our expectations when we need anything at all, and it is refreshing to see a hotel that truly 'gets it' on customer service. When you step out for a quick bite and request turndown service, it is always done quickly and thoroughly, and as a Kimpton Level 3 member, they take care of me with beautiful upgrades whenever they can. Finally, there's the free happy hours for all guests every night for an hour that move to another cool room in the hotel, from the 3rd floor lounge to a rooftop area. Once when I slept through free coffee on a Sunday, the hip lobby restaurant comped me a cup for the inconvenience, not an inconsequential thing for a high end coffee bar.\nIf you are seeking a great stay in NYC and don't want to risk booking an iffy hotel, book a 5 star hotel at 4 star prices and check out the Eventi. You are conveniently located within walking distance or a quick Uber or subway from anywhere you want to go. You will not be disappointed, especially if Dominique has anything to say about it!\nRoom Tip: The Mini Suites with Jacuzzi tubs are fantastic. These suites have a living room with sofa and TV th... See more room tips", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-29T03:45:01.733+03:00", "highlightTitle": ""}