{"organizations": [], "uuid": "b524f0ef7ace476282a02ec263ba93a48f310355", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/20/07/ad/two-bedroom-deluxe-redesigned.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g196563-d483110-Reviews-Fraser_Suites_Harmonie_Paris_La_Defense-Courbevoie_La_Defense_Hauts_de_Seine_Ile_de_Fra.html", "section_title": "Fraser Suites Harmonie Paris La Defense - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Courbevoie, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g196563-d483110-r471174673-Fraser_Suites_Harmonie_Paris_La_Defense-Courbevoie_La_Defense_Hauts_de_Seine_Ile_.html", "country": "US", "domain_rank": 189, "title": "Modern apartment and exceptional service", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Modern apartment and exceptional service - Review of Fraser Suites Harmonie Paris La Defense, Courbevoie, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "b524f0ef7ace476282a02ec263ba93a48f310355"}, "author": "bazrunia", "url": "https://www.tripadvisor.com/ShowUserReviews-g196563-d483110-r471174673-Fraser_Suites_Harmonie_Paris_La_Defense-Courbevoie_La_Defense_Hauts_de_Seine_Ile_.html", "ord_in_thread": 0, "title": "Modern apartment and exceptional service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stay at the Fraser Suites Harmonie fairly often on business and I would highly recommend them. The apartments are modern and are kept clean to a good standard, they are also spacious. The staff are very friendly and helpful, my stay is always pleasant because of them. The security staff do a great job, even on one occasion escorting a Deliveroo delivery driver to my apartment door. The reception staff, all of which have been very welcoming and helpful, on one occasion helped me work the TV when I was accidentally using the wrong remote control (oops) and also resolving efficiently some issues I have had with the booking system my firm uses. In addition they always seem to be prepared with my check in before I arrive so it is a quick process to check in. Special mention to the cleaners for keeping everything to a good standard, I particulary appreciate this when I travel so often as it makes my stay much more comfortable. Another special mention to the breakfast buffet team, including Mariana and Neetha, who especially make my stay enjoyable with pleasant greetings each morning and great service! I always have a quick small breakfast and like to take a few crossiants with me for on the way to the office, Mariana remembers this and brings me a takeaway bag when I get ready to leave, it's the little touches like that which are really lovely and really make me feel comfortable at Fraser Suites. My only improvement comment would be that it would be nice to have more channels in English on the TV rather than mainly the news but this seems to be the same where ever I have stayed in Paris. Please pass my thanks to all the staff including Mariana and Neetha and see you at my next visit! Gemma.", "external_links": [], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T23:10:56.331+03:00", "highlightTitle": ""}