{"organizations": [], "uuid": "b2d7a3669b739694b6c24392b4fd375d747650a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/6a/1b/1e/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93352-Reviews-or30-DoubleTree_Suites_by_Hilton_Hotel_New_York_City_Times_Square-New_York_City_New_York.html", "section_title": "DoubleTree Suites by Hilton Hotel New York City - Times Square - UPDATED 2017 Reviews &amp; Price Comparison - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93352-r467019321-DoubleTree_Suites_by_Hilton_Hotel_New_York_City_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Be sure to eat at Ginger's Restaurant!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Be sure to eat at Ginger's Restaurant! - Review of DoubleTree Suites by Hilton Hotel New York City - Times Square, New York City, NY - TripAdvisor", "spam_score": 1.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 1, "uuid": "b2d7a3669b739694b6c24392b4fd375d747650a3"}, "author": "PopcornPerrier", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93352-r467019321-DoubleTree_Suites_by_Hilton_Hotel_New_York_City_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Be sure to eat at Ginger's Restaurant!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We had a beautifully situated two-room King Suite that overlooked Times Square. And, even though ALL the windows faced the lights and streets, the room was dark, dark, dark once the drapes were drawn and quiet, quiet, quiet! The Check-In experience was classic DoubleTree complete with fresh, warm, Chocolate Chip Cookies. The location is perfect in that EVERYTHING tourist-ey ... Broadway, Radio City Music Hall, Rockefeller Center, exclusive shopping on 5th and Madison, Central Park, etc., etc., is ALL within easy walking distance. Their crowning jewel is GINGER's Restaurant which serves a breakfast so delicious you'll stay at the DoubleTree just so you can enjoy it. Chef Steve Gbidi and his team create extraordinary dishes from everyday foods. I returned to the Omelet Chef and shared that my \"everything omelet\" he had prepped for me was undoubtedly one to THE BEST I've ever had. Chef Gbidi personally shared a fruit plate with our table that drew nothing but \"YUM!\" and \"This is SO good\" commentary. Chef Gbidi and his team are also ambassadors for IMPECCABLE service and KNOW how to create and spread an atmosphere that is welcoming and warm. My goodness ... I wish I had other words to talk about this Chef and his team. Since I don't - and it wouldn't matter if I did because they still would inadequately portray the extreme talent and professionalism that is GINGER's Restaurant, Chef Steve Gbidi, and his teammates. You'll just have to GO and enjoy for yourself!\nRoom Tip: Request a high floor and Times Square View...you won't regret it. See more room tips", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-29T06:38:22.255+03:00", "highlightTitle": ""}