{"organizations": [], "uuid": "a360a187af062a2a91aecee97705fa7a3986dda5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/be/c3/15/junior-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93477-Reviews-New_York_Marriott_Downtown-New_York_City_New_York.html", "section_title": "New York Marriott Downtown - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93477-r466515977-New_York_Marriott_Downtown-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "A Fantastic Base to Explore this Great City!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "A Fantastic Base to Explore this Great City! - Review of New York Marriott Downtown, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-12T02:00:00.000+02:00", "replies_count": 1, "uuid": "a360a187af062a2a91aecee97705fa7a3986dda5"}, "author": "TimJoandHenry", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93477-r466515977-New_York_Marriott_Downtown-New_York_City_New_York.html", "ord_in_thread": 0, "title": "A Fantastic Base to Explore this Great City!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed at The Marriott Downtown for the Marathon weekend, November 2016. From the moment of check in, the staff could not have been more friendly or helpful. I was allocated an lovely room on 15th floor.\nThe room was very spacious by NYC standards and well appointed throughout. The bed was very comfortable and the linens were lovely. The bathroom was spotless.\nI had an issue one evening with some young American guests being VERY noisy along the corridor, running from rom to room, shouting, crashing into walls, you get the picture. It was late in the evening,around 10pm; and with a marathon to run the next day i was keen for them to be quiet. I had a word myself, to no avail, so I contacted reception, who immediately sent security up. The problem was solved.\nI managed to carelessly leave an item of clothing behind on departure; and did not notice until I was back in the UK. No problem. I contacted the hotel, who informed me it had been found, photographed and labelled. They offered to ship it to me - fortunately I had a friend collect it. Again, could not have been more helpful.\nIts in a great location too, perfect for WTC and SI Ferry. Very well connected to the rest of Manhattan by several subway lines within an easy walk.\nStarbucks downstairs is also a great bonus.\nIn summary, i would not hesitate to recommend this well run, clean and comfortable hotel, with its friendly helpful staff; and I hope to be back soon.\nRoom Tip: High floors will give the best views See more room tips", "external_links": [], "published": "2017-03-12T02:00:00.000+02:00", "crawled": "2017-03-30T16:47:24.342+03:00", "highlightTitle": ""}