{"organizations": [], "uuid": "c5020ede88a33c0a993f4cd40a3d8f483a088c7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/2e/ce/e5/bedroom.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d6617874-Reviews-Hotel_Dupond_Smith-Paris_Ile_de_France.html", "section_title": "Hotel Dupond-Smith - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d6617874-r469052304-Hotel_Dupond_Smith-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Small, stylish boutique hotel with wonderful service in the beautiful Marais", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Small, stylish boutique hotel with wonderful service in the beautiful Marais - Review of Hotel Dupond-Smith, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 1, "uuid": "c5020ede88a33c0a993f4cd40a3d8f483a088c7b"}, "author": "Susan Z", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d6617874-r469052304-Hotel_Dupond_Smith-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Small, stylish boutique hotel with wonderful service in the beautiful Marais", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We spent 3 nights at Dupond-Smith in June 2016 in the Joseph L'Estrange room. The first thing that stands out is the incredibly attentive service - in particular, Silvio who helped us with some booking issues and amendments before we arrived. Nothing was too big or too small - the reception helped us with restaurant bookings, mail and recommendations - always with the utmost politeness.\nThe hotel is beautifully designed and well-appointed, as made clear from the photos (especially on their website). Every piece of furniture and appliance seems to have been carefully chosen, it's like walking into a upscale design boutique. We especially loved the Dipytque products in the bathroom and the Maison Margeila bathrobes (!). It's a small and private hotel with only 8 rooms and a small lobby.\nOur room, Joseph L'Estrange, was one of the 2 Alias rooms (the cheapest room type) which we requested for the Balcony overlooking the street (unfortunately, it rained most of the time so we were unable to enjoy it). As with most Paris hotel rooms, it's small (18m2) but absolutely fine for two, and had ample storage space and a (relatively) large and well-appointed bathroom.\nThe hotel is very well-located - right in the middle of the picturesque Marais district on a quiet-ish street. Our room rate did not include breakfast but it was easy to pop around the corner for delicious pastries.\nI'd really love to return to Dupond-Smith again, if I can. The calibre of the hotel is definitely reflected in the room prices, so sadly it'd have to be a special occasion or treat. I'd recommend it if you can afford it and you would like to stay in a small, luxurious and private boutique hotel. We found booking direct to be the cheapest option.\nRoom Tip: Joseph L'Estrange (Alias) has a small balcony overlooking the street. See website for photos and... See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-28T15:33:19.564+03:00", "highlightTitle": ""}