{"organizations": [], "uuid": "5e42f2b10028b361d6f6ab654edf70e3abac81f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/59/84/10/the-towers-at-the-new.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d4702789-Reviews-The_Towers_at_Lotte_New_York_Palace-New_York_City_New_York.html", "section_title": "The Towers at Lotte New York Palace - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d4702789-r471248626-The_Towers_at_Lotte_New_York_Palace-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Good alternative to other higher end options", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Good alternative to other higher end options - Review of The Towers at Lotte New York Palace, New York City, NY - TripAdvisor", "spam_score": 0.002, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "5e42f2b10028b361d6f6ab654edf70e3abac81f0"}, "author": "George J", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d4702789-r471248626-The_Towers_at_Lotte_New_York_Palace-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Good alternative to other higher end options", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I've stayed at the Mandarin, Park Hyatt, Ritz (Central Park), and a number of other more expensive NYC offerings, usually getting a suite in each case. I will say, for the value, this is a good option. A typical suite at the Mandarin (Central Park Suite) can run around $2,500 a night or more depending on the time of year. The corner suite here, can vary as well, but you can get for around $1,500. It's larger than the Mandarin suites. They also tend to offer a free or discounted night if you book 2 or 3 nights. Mandarin does that as well, but only in low peak periods. So value wise, if you're a suite person, it's a pretty good deal.\nThis is the towers, which is a section of the Palace, with a separate check in and elevators, so it's a bit less busy and hectic. The hotel itself doesn't seem to have a ton to offer, with the bar/restaurant (which technically seems to be part of the Palace, not Towers) is just average. The rooms appeared to have been remodeled and are fairly decent. Not as new, or high-tech as the Park Hyatt, but nice, roomy and comfortable. The views, if on the cathedral side, are excellent, one of the best in the city for hotels (Mandarin is nice also, if you don't mind the Trump building blocking much of the park).\nLocation is excellent, and unlike the nicer hotels by Central Park, from here you can actually walk to Broadway to see a show...a big plus. And the 5th avenue shopping is right there, so the location has a lot to offer. So if you want a large suite in NYC without paying the insane prices, this offers you a good option to consider. The prices might seem high, but they are low compared to suites at the MO, Ritz, Trump, Park Hyatt, etc.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T04:51:21.477+03:00", "highlightTitle": ""}