{"organizations": [], "uuid": "b05e6539c38b1016e66d3de1a2ef6681bc6fecaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/0e/8f/85/terrasse-exterieure-roof.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d198085-Reviews-Terrass_Hotel_by_MH-Paris_Ile_de_France.html", "section_title": "Terrass'' Hotel by MH - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d198085-r469590979-Terrass_Hotel_by_MH-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "FAB hotel in a great area.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "FAB hotel in a great area. - Review of Terrass'' Hotel by MH, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "b05e6539c38b1016e66d3de1a2ef6681bc6fecaa"}, "author": "Sharon171984", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d198085-r469590979-Terrass_Hotel_by_MH-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "FAB hotel in a great area.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We chose the Hotel Terrass primarily because our son and his girlfriend had recommended it, as they had enjoyed their visit there last year. We had never been to Paris before and both thought this would be the ideal place to celebrate our 33rd Wedding Anniversary, and we were not disappointed; and having beautiful weather in March helped!\nThis is a stylish, modern hotel with a great ambiance. The reception staff are professional, friendly and attentive and all speak very good English! A special mention must go to Miriam, for whom, nothing was too much trouble. The housekeeping staff are all very polite too. Surprisingly, our room was ready on our arrival, several hours before normal check in time. After an induction to the hotel facilities, we were given our room number and left to settle in. We had booked a Studio D’Artiste room, and was pleased to discover that these are corner rooms with Juliet balconies to the lounge and bathroom areas, with fantastic views across the Paris skyline, including the Eiffel Tower in the distance. We were blown away by our spacious, clean and bright room. The hotel is very chic, with excellent facilities, including a spa and gym and it pays much attention to detail with coffee machines, safe, phone and mini bars in each room. Our super king size bed and luxurious bathroom, complete with L’Occitane products and fluffy bathrobes, slippers and towels was extremely comfortable. A visit to the indoor/outdoor enchanting rooftop bar and restaurant is a must, as you are greeted with awesome panoramic views over Paris. The Terrass is in a great location, close by the quaint, artsy but hilly Montmartre area, and in walking distance to numerous bars, restaurants, buses and the metro system; which are easy to navigate if you want to discover what Paris has to offer.\nOverall we would highly recommend this hotel, it’s in a great location, and the service & atmosphere are excellent- à bientôt Terrass!\nRoom Tip: Corner Studio D'Artiste rooms have great views and are spacious and bright See more room tips", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-27T05:12:44.841+03:00", "highlightTitle": ""}