{"organizations": [], "uuid": "eeccafc097224cdbffa349ee7987d9cbc6c4f2cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/b3/f3/65/the-chatwal-exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1641016-Reviews-The_Chatwal_A_Luxury_Collection_Hotel_New_York-New_York_City_New_York.html", "section_title": "The Chatwal, A Luxury Collection Hotel, New York - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1641016-r468594250-The_Chatwal_A_Luxury_Collection_Hotel_New_York-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Lovely hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Lovely hotel - Review of The Chatwal, A Luxury Collection Hotel, New York, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "eeccafc097224cdbffa349ee7987d9cbc6c4f2cf"}, "author": "stevens397", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1641016-r468594250-The_Chatwal_A_Luxury_Collection_Hotel_New_York-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Lovely hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This is our first time here. My daughter and son-in-law have been there five times previously and we were there as she was running the half marathon today. Pluses- first and most important of all is the staff. Cannot possibly say enough. Everyone we interacted with was superb but the doormen and the Bellmen deserve special mention. Ali, who escorted us to our room, made it clear that he was there to help in any way. Everywhere you went you got smiles.\nThe room itself was lovely with only one shortcoming. We had a Junior Suite that I received as a Starwood Platinum - more on that later. It was roomy and the bathroom was incredible. Two downsides - we were on the street side on the 6th floor and it was still rather noisy - and the window itself was very cold. My daughter said they often ask to be placed on the other side of the hotel and it is much quieter. Second is the lighting - like many other hotels lately, I'm glad I have an iPad to read from because it would be difficult finding enough light anywhere to make reading easy - especially for a 69 year old!\nAll in all a lovely hotel with the feel of a boutique. We usually stay further away from the action, mostly the St Regis. There are certainly pluses and minuses for each location.\nThe only two issues I had were at check-in. I knew that the Starwood website had every type of room listed as still available for sale. As a Platinum (for 10 + years), I am entitled to a suite yet it was not offered. Some hotels honor the intent of the program and some don't and make you ask or push. Sure enough, she spoke to the manager who approved it but after all these years, there is simply no excuse for making someone go through hoops to get what they are entitled to. Worse, I was told the Junior Suite was not ready yet but if I wanted, I could occupy a larger suite immediately for a surcharge. When I asked what it would be, she told me $675! No thanks. Again, a bad taste.\nThe other issue was when my daughter and son-in-law checked in. If I was the owner of the hotel and I had a guest returning for the sixth time, I would be in shock if the front desk agent asked him if this was their first visit to the Chatwal?! That is not how you make people feel valued.\nAll that aside, very good chance we'll be back as the hotel was lovely and the staff was simply incredible.", "external_links": [], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-30T18:24:46.364+03:00", "highlightTitle": ""}