{"organizations": [], "uuid": "7e6e8874fc652b84dd576cb617b845942e4c668f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/8a/f0/71/lobby-main.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99766-Reviews-or60-The_Roosevelt_Hotel-New_York_City_New_York.html", "section_title": "The Roosevelt Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r466956478-The_Roosevelt_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "The atmosphere will touch you", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "The atmosphere will touch you - Review of The Roosevelt Hotel, New York City, NY - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "7e6e8874fc652b84dd576cb617b845942e4c668f"}, "author": "rencsi0611", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r466956478-The_Roosevelt_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "The atmosphere will touch you", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "First of all, this hotel has an excellent location and an outstanding exterior and unique interior appearance. It really did live up to our expectations. Being close to all the landmarks such as Central Park, the Chrysler Building, the Grand Central is quite a good thing and there is a Subway and a McDonald's within 5 minutes. At the entrance, music is always playing, and when you enter, the atmosphere with the incredibly soft dark red carpets, the amazing chandelier and the enchantment of the lobby grabs your attention and makes you feel special. Special, like someone who can walk on the stairs where once Michael Douglas or Ralph Fiennes could have appeared.\nFirst you need to go up the stairs, then go across the hall to the reception. The time we had to wait for check-in was little. Some of the elevators were being repaired, so getting up to the room was a bit slow and we had to wait a bit. Unfortunately there are guests who cannot walk 2 flights of stairs, so sometimes the elevator had to stop on a floor and go up or down only one floor, which prolonged our getting down to the lobby. Also, it would be a good idea to have some kind of sensor installed in the elevator that could sense the weight of the people inside and then it would not stop when there is no more space for other people to get in, because there were some occasions when the elevator stopped, the door opened, but people who were outside(or at times nobody was there) could not get in.\nNow, the room. Our room was fascinating. I couldn't have imagined a better room. Those comfy beds! My god! I really wanted to bring them home with me!\nThe heating was a bit loud, sometimes scary sounding, but all in all no problems, I had earplugs.\nThe maids cleaned and tidied our room impeccably every day without exception.\nIn the bathroom it was a littel uncomfortable that the shelf was over the toilet, because on some occasions my things fell into the toilet and the hair-drier was so far in the left corner that only a left-handed person could use it perfectly. Anyway, I was really grateful for a hair-drier in the room. In addition, we were also supplied with mini toiletries every day, which was great. You need to learn the use of the toilet, and then it won't block. Push it longer and softer. (advice for strong men).\nThe lock in the door always worked.\nThe rooftop bar was closed, maybe because we were out of season :( I really wanted to see the skyline form the bar. Next time....:) 'Coz I will surely return to this hotel.\nThe check-out couldn't have been quicker, friendlier and easier then the way it did. so all in all, our experience with his accommodation was just superb. We had been looking for an accommodation exactly like this, so it was just the job! We felt like we were part of the American Dream.\nRoom Tip: I guess the higher you have your room, the better the views are. See more room tips", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-31T21:25:25.775+03:00", "highlightTitle": ""}