{"organizations": [], "uuid": "19bcd6ccdcdb53766c36c739a6ba1b7adb282952", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/b0/d0/ac/hotel-daunou-opera.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d208099-Reviews-Hotel_Daunou_Opera-Paris_Ile_de_France.html", "section_title": "Hotel Daunou Opera - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d208099-r445791365-Hotel_Daunou_Opera-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Fantastisk hotel og personale!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Fantastisk hotel og personale! - Review of Hotel Daunou Opera, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 1, "uuid": "19bcd6ccdcdb53766c36c739a6ba1b7adb282952"}, "author": "Anders P", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d208099-r445791365-Hotel_Daunou_Opera-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Fantastisk hotel og personale!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "danish", "persons": [], "text": "Min kæreste og jeg havde 3 overnatninger på dette hotel, da vi var i Paris i begyndelsen af december. Hotellet og personalet var virkelig en positiv overraskelse. Hotellet ligger fantastisk, man får virkelig følelsen af at du bor midt i Paris. Metroen ligger kun 3 minutter væk på gåben, så det var selvfølgelig en kæmpe hjælp, når det meste af ferien står på sightseeing. Louvre museet kan man nemt gå til, det samme gælder operaen og Lafayette. Stilen på hotellet var moderne men også hyggelig og ren. Vores værelse lå ud til vejen, men vi blev ikke på noget tidspunkt generet af støj, på trods af at det var fredag-lørdag og der lå en bar lige ved siden af hotellet. Værelset var også rigtig behageligt at være i.\nPersonalet burde nærmest få deres eget afsnit. De var virkelig søde, imødekommende og hjælpsomme. De opbevarede vores bagage da vi kom og da vi tog afsted, da vores fly først gik sent om aftenen. De printede også vores boarding pass da vi skulle afsted, hvilket var virkelig sødt af dem. Vi vil til hver en tid anbefale alle der skal Paris at bo på dette hotel!\nIn english:\nMy girlfriend and i stayed at the hotel for 3 nights at the beginning of December. It was really a pleasant surprise. The location was fantastic, it felt like you were in the heart of Paris. The metro was only 3 minutes away, which was very convenient when you are spending most of your trip sightseeing. Musée du Louvre was within walking distance, and so was the opera and lafayette. The hotel was modern but also very warm, pleasant and clean. Our room faced the road in front of the hotel, but we were never bothered by any noise, even though it was friday-saturday and there was a bar just beside the hotel. Our room was very nice and comfortable.\nThe staff should almost be a chapter for itself. They were really kind, welcoming and helpful throughout all of our stay. They stored our luggage when we arrived early and when we left, because our plane was departing late at night. They were also kind enough to print our boarding passes. The service they provided was really excellent! We will definitely recommend this hotel to anyone who are going to Paris.", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-27T22:35:41.856+03:00", "highlightTitle": ""}