{"organizations": [], "uuid": "66b4447532e4b0954fff01ae47929985fbafd1ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/5d/a5/71/hotel-monge.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d10328342-Reviews-Hotel_Monge-Paris_Ile_de_France.html", "section_title": "Hotel Monge - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d10328342-r470329264-Hotel_Monge-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Perfect!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Perfect! - Review of Hotel Monge, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "66b4447532e4b0954fff01ae47929985fbafd1ad"}, "author": "IainCDBuckie", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d10328342-r470329264-Hotel_Monge-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Perfect!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hotel Monge proved the perfect base for our recent visit to Paris. It is a hugely stylish boutique hotel in a terrific location in the Latin Quarter. There are two metro stations within a few minutes walk, no.10 that will take you to sights along the left bank and no.7 that crosses the river to the Louvre, the Opera and beyond. The local area is very attractive and Notre Dame is a short walk away as are the Pantheon and Luxembourg Gardens. There are plenty of options for eating out nearby too. Our bedroom on the fifth floor was beautiful with a great shower, a little balcony (although too narrow to sit on) overlooking the street but crucially, once the windows were closed, no noise! It was compact but there was ample storage space and the bed was extremely comfortable. L'Occitane bathroom products replaced as necessary. Breakfast was also very good. There are a few cooked options but we tended to stick to the the bread and croissants which were excellent. Try and get a deal including breakfast if you can. After breakfast, this same space becomes a free tea and coffee lounge and in the evening there is also an honesty bar. The staff were, without exception, friendly and helpful. Personally, I thought it was also extremely good value for money and would have absolutely no hesitation in returning - and we certainly will because there is still so much of Paris that we have yet to see!\nRoom Tip: I think higher floors are probably better. There is a little noise from the metro though I doubt it... See more room tips", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-27T21:57:11.791+03:00", "highlightTitle": ""}