{"organizations": [], "uuid": "6b85b92393e9e2f571b0da280a6dc09fea979963", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/ee/b1/70/our-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1595302-Reviews-or10-Club_Quarters_Hotel_World_Trade_Center-New_York_City_New_York.html", "section_title": "Club Quarters Hotel, World Trade Center - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1595302-r465700920-Club_Quarters_Hotel_World_Trade_Center-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Home away from home", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Home away from home - Review of Club Quarters Hotel, World Trade Center, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "6b85b92393e9e2f571b0da280a6dc09fea979963"}, "author": "Maureen P", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1595302-r465700920-Club_Quarters_Hotel_World_Trade_Center-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Home away from home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed at Club Quarters for 16 nights after selling my apartment and waiting for my temporary sublet to be available and by the time I left, I felt as if I was leaving home. Accommodations were immaculate and up-to-date, service was excellent, and the amenities for a hotel in this price range were above average; fresh fruit, biscotti, and self-service lattes, espresso, and sparkling water on tap in the lobby, Many mornings I enjoyed my latte with the NYT, catching the news in the comfortable TV lounge. The complimentary laundry facilities were a real treat to me during my extended stay and I made frequent use of the gym.\nWe had booked a standard king which was on the 8th floor; when my husband complained about the A/C roof unit noise from across the street (not the hotel's fault) we were moved to a 14th floor room with a large terrace. Despite the cold, we still ventured out there to enjoy the city views of the Oculus and 9-11 Memorial.\nBeds were very comfortable and an ample supply of pillows as well as other amenities were available in a closet down the hall.\nDespite all the nearby restaurants in the area and the generally mediocre reputation of hotel restaurants, I ended up trying the rooftop restaurant one night after a stressful day at work. What a surprise! The spectacular view of the city, West Street, and the Hudson River was worth a visit by itself, but my sea bass cooked Asian-style in a broth, with tasty bread and a glass of wine, hit the spot. I ended up going back for happy hour one night (every evening 5-7) and dinner a couple of more times.\nThe location was perfect for me to get to work every day; only a couple of blocks from the 1 and R trains. Even though I am a New Yorker, there are still some sights I have yet to explore so I played tourist during the weekend - besides the Memorial there are still many things to see not far from the hotel.\nAll in all, I highly recommend this Club Quarters to anyone looking for a leisure weekend or business stay.\nRoom Tip: Some higher floors have terraces and views. See more room tips", "external_links": [], "published": "2017-03-08T02:00:00.000+02:00", "crawled": "2017-03-29T05:34:06.470+03:00", "highlightTitle": ""}