{"organizations": [], "uuid": "1525aff43791795e9cb7731047b2ee4081507094", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/04/87/01/7f/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d203130-Reviews-or5-Hotel_Canada_BW_Premier_Collection-Rome_Lazio.html", "section_title": "Hotel Canada, BW Premier Collection - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d203130-r464787892-Hotel_Canada_BW_Premier_Collection-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Hotel Canada", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Hotel Canada - Review of Hotel Canada, BW Premier Collection, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "1525aff43791795e9cb7731047b2ee4081507094"}, "author": "gayle2112", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d203130-r464787892-Hotel_Canada_BW_Premier_Collection-Rome_Lazio.html", "ord_in_thread": 0, "title": "Hotel Canada", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In September 2016 myself and my husband stayed at the Hotel Canada for our 4 night trip, Upon first arrival at the hotel we were met at the door by the hotel concierge who politely welcomed us and helped carry our cases to check in. The check in staff were very friendly and smiley which is always nice. They explained everything we needed to know and handed us our key. We were then escorted to our room and helped with our bags. The first impression of the hotel that it is clean, bright and in keeping with Renaissance decor. The room was bright, well decorated with en-suite bathroom and extra thick black out blinds and shutters. The bed linens were clean and soft, tea and coffee making facilities also available with 2 glasses for cold drinks. A safe in the wardrobe for added security. The hotel offered a nice bar which served hot and cold drinks, free snacks (very nice) and a nice patio area. The use of a computer, books and magazines also in the seating area. Photos on the wall tell the story of the location and the family which runs the hotel and has for many years. The staff are extremely helpful, after a day looking around in shops i found something i wanted to buy but didnt at the time, a couple days later i decided to go and get it but i couldn't find the shop. The staff spent ages online looking for the exact shop which i meant even though i didnt know the name or location and they were just as excited as me when i went and made my purchases. The hotel is close to local shops, bus terminus, train station and anything else you could need. I really hope we can return again in a few years when the kids are old enough to appreciate Rome.\nSee all photos", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-28T03:30:01.423+03:00", "highlightTitle": ""}