{"organizations": [], "uuid": "3898aaa43e48758d3f469372048a743d81941c7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/c4/04/40/classic-double-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d192122-Reviews-or10-Egerton_House_Hotel-London_England.html", "section_title": "Egerton House Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192122-r467110564-Egerton_House_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Outstanding Stay - The Best Hotel Experience I've Had!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Outstanding Stay - The Best Hotel Experience I've Had! - Review of Egerton House Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "3898aaa43e48758d3f469372048a743d81941c7b"}, "author": "kate_kougs", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192122-r467110564-Egerton_House_Hotel-London_England.html", "ord_in_thread": 0, "title": "Outstanding Stay - The Best Hotel Experience I've Had!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed here in August of 2015:\nThe Egerton House is by FAR the best hotel experience I've had to date-- the staff and the impeccable efforts to personalize your experience at the hotel is what makes it so truly special and worth the stay.\nWhat makes this place stand out from any other hotel is their attention to detail. For example: in each room, the staff includes a fruit plate full of 3 different fruits, which are changed out every day. After a couple days of offering a plate of two fruits (which I ate) and a fig (which I did not eat), the next day, the fruit plate had replaced the usual fig with another fruit. Yes-- they really do pay that much attention and make the effort to personalize your experience. This is just one example among many instances of impeccable attention to detail.\nThe staff also offered great advice on what to do in London, and offered help planning activities, routes, and more.\nThe rooms themselves are wonderful. As a boutique hotel, each room is different, but they are all lavishly decorated. The beds are insanely comfortable and clean. The housekeeping service is absolutely wonderful-- after leaving in the morning and coming back in the afternoon, we would find the room straightened up, beds made, and complimentary water bottles replaced. After leaving again in the afternoon and coming back in the evening, we found the beds turned down.\nEach room is also very well-equipped-- the closets are spacious, and each room includes a box of tea and water boiler.\nBreakfast at the Egerton House is truly an experience-- they include a wonderful continental selection with fresh pastries, breakfast meats, fruit, yogurt, and more. One of my favorite parts of the morning was the fresh mint tea-- which the staff began to anticipate every day.\nThe location of the hotel is also prime. It's only a 15 minute walk to Big Ben and the Eye, to Buckingham Palace and Hyde Park. It's also very close to major transportation stations.\nIf you're able, I highly recommend a stay here-- I'm sure you'll be just as wowed as I was!", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-26T21:43:22.937+03:00", "highlightTitle": ""}