{"organizations": [], "uuid": "74e6fab5b49b59261f77e7433f96f8fbf9e2cd8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/fb/27/72/arlo-nomad-king-skyview.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d10541730-Reviews-Arlo_NoMad-New_York_City_New_York.html", "section_title": "Arlo NoMad - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d10541730-r468833721-Arlo_NoMad-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "So good we stayed there twice!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "So good we stayed there twice! - Review of Arlo NoMad, New York City, NY - TripAdvisor", "spam_score": 0.002, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "74e6fab5b49b59261f77e7433f96f8fbf9e2cd8f"}, "author": "catherine7767", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d10541730-r468833721-Arlo_NoMad-New_York_City_New_York.html", "ord_in_thread": 0, "title": "So good we stayed there twice!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "So we have just returned from NYC and indeed our stay in the Arlo Nomad. On arrival we were greeted so kindly by one of the lobby hosts who gave us some great information about the hotel and the local area. We were given our room 2206, a sky view queen room. We walked in and could not believe our luck! It was simply beautiful, small but perfectly formed! Great use of space. Our view of the Empire State Building was a hell of a welcome to the city!\nWe travelled as a couple, thank goodness we were comfortable with each other as the bathroom door was made of glass not an issue for us but worth bearing in mind for others who may not wish to be quite so intimate.\nThe bed was very comfortable, high enough that most suitcases would fit underneath to allow more room. The safe is also located in a drawer underneath the bed. Pillows are very very soft, I had a problem with these but my partner thought they were the most comfortable he had slept on, so as usual it is different strokes for different folks and you just can't please everyone.\nThe room also came equipped with a mini fridge, a steamer, a hairdryer, great products by a brand called blind barber.\nWe loved the hotel so much we wanted to continue our stay there when we returned from a short break to Boston. On check in for the second time, we were given the same warm welcome despite the lateness of our check in (we were delayed by the snow storm). We were allocated room 2408 this time, a king size sky room. The lay out of this room was very different, you could not walk around the bed as it was up against the two floor to ceiling windows. The bathroom door was glass with a gap at the top, a bit too personal even for us. And no desk. The space under the bed for suitcases was even more limited. To add to all this the bed creaked and crunched every time you moved in it, which 24 floors up and against a window was not conducive to the most comfortable of nights sleep. We asked the lobby if there were any other rooms available and they were incredibly helpful allowing us a room down on the 6th floor with a layout more like our original layout and a much more comfortable, less noisy bed. We asked to remain in this room and the staff gave us two free breakfasts to make up for the issue, totally unnecessary as it was our problem not theirs but very kind none the less and appreciated given the current exchange rate.\nI cannot fault this hotel, they are friendly warm and welcoming. The location is amazing, we absolutely loved it. We would stay here again in a heartbeat. Thanks again Arlo for making our first time in New York so special", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-29T03:38:05.593+03:00", "highlightTitle": ""}