{"organizations": [], "uuid": "67e07a588c99595a7ff35b6591265944b147122d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/90/4d/da/queen-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d192157-Reviews-or10-Ashburn_Hotel-London_England.html", "section_title": "Ashburn Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192157-r447497811-Ashburn_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "A Gem of a Hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "A Gem of a Hotel - Review of Ashburn Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-07T02:00:00.000+02:00", "replies_count": 1, "uuid": "67e07a588c99595a7ff35b6591265944b147122d"}, "author": "Gerard_Glasgow", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d192157-r447497811-Ashburn_Hotel-London_England.html", "ord_in_thread": 0, "title": "A Gem of a Hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As part of our annual city break to London, I stayed at this hotel with my brother from 14-16 Dec-16. I booked the hotel through Booking.com which offered a very attractive rate.\n** Room **\nOur twin bed room (R401) was of a good size, well maintained and spotlessly clean. The maid did a thorough job each day keeping the room nice and tidy. The bathroom was more than enough for our needs. The shower was excellent, unlike countless showers I've used in many other hotels. The bath was of a good size too. Outside noise? We didn't hear a thing! A nice touch was the delivery of a daily newspaper outside our room each morning (The Times on weekdays and The Independent at the weekend).\n** Staff **\nAll staff were very professional, courteous and friendly. Nothing was ever too much trouble for any of them. Truly service with a smile. For me, the Ashburn's biggest asset is undoubtedly its staff.\n** Food **\nWe had breakfast on both mornings of our stay. It was a nice continental breakfast with plenty to choose from. The girl who supervised the breakfast area was very nice, always making sure everyone was satisfied. Yes, we really did enjoy breakfast, a good experience.\n** Service **\nFirst class always by all members of staff.\n** Location **\nA real selling point, only a couple of minutes’ walk to Gloucester Road Tube Station which we used on each day of our stay. Earls Court is also nearby, about a 15-20 minute walk the other way.\n** Summary **\nI give the Ashburn Hotel 5 stars, the same rating I gave for our previous visit to the hotel in early Feb-15. For us, it is very clear that high standards continue to be delivered and maintained by the hotel's management and staff. This place truly offers value for money. In view of all this, I wouldn't hesitate in recommending the Ashburn to other prospective tourists to London.\nLater in 2017, we will return to the Ashburn, which we now call our \"basecamp\".\nGo for it! You won't be disappointed.", "external_links": [], "published": "2017-03-07T02:00:00.000+02:00", "crawled": "2017-03-31T16:16:48.768+03:00", "highlightTitle": ""}