{"organizations": [], "uuid": "bb4c9d1e65e9b79a2a771c0a6ad3e515ade5587e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/2c/ea/1c/bathroom.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d232552-Reviews-La_Maison_Favart-Paris_Ile_de_France.html", "section_title": "La Maison Favart - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d232552-r468603641-La_Maison_Favart-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Visit to Paris", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Visit to Paris - Review of La Maison Favart, Paris, France - TripAdvisor", "spam_score": 0.002, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "bb4c9d1e65e9b79a2a771c0a6ad3e515ade5587e"}, "author": "DWishnew", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d232552-r468603641-La_Maison_Favart-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Visit to Paris", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We just returned from a week in Paris. During that time, we spent the nights in La Maison Favart. This was a fabulous choice.\nThe hotel is a smaller, boutique style hotel juxtaposed to the Opera Comique on Rue du Marivaux. There was construction going on, so the small square facing the hotel was quite noisy at times. This was the only downside to our stay.\nWe were greeted warmly by the personnel when we arrived and we were shown several rooms, from which we made our choice. The rooms are extremely comfortable although a bit lacking in closet space. Bed was quite large and comfy. Pillows comfy as well. Nespresso machine and fridge in room. Bathroom was elegant, with all expected amenities.\nThe common areas were comfortable. Breakfast was in a good sized, elegant dining area and the breakfast was excellent and abundant. The dining room staff kept the place clean and well stocked. Throughout the day, coffee and tea was available. There was an honor system for wine and alcohol.\nThe personnel was wonderful. The concierges were immensely helpful and very reliable. Everyone spoke English which was nice but unnecessary for us. Clientele was from all over Europe and North America.\nThe hotel is located just off Blvd des Italiens, which led to the Opera. Multiple metro lines in that area, as were bus tours. Quite a few Bistros in the area, so choosing the right place to eat/drink was not too difficult.\nAll in all, this is a superb boutique hotel that welcomes business travelers, singles, couples, and families. The quality of our stay there was excellent and we would return in a heartbeat.\nIf you're going to Paris, you can't do much better", "external_links": [], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-26T19:33:35.793+03:00", "highlightTitle": ""}