{"organizations": [], "uuid": "545e59c84e1491cd4c84f2fb53dcde220e895119", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/85/44/bb/studio.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d596437-Reviews-or30-The_Inn_At_The_Roman_Forum-Rome_Lazio.html", "section_title": "The Inn At The Roman Forum - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d596437-r458442392-The_Inn_At_The_Roman_Forum-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Perfect hideaway", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Perfect hideaway - Review of The Inn At The Roman Forum, Rome, Italy - TripAdvisor", "spam_score": 0.042, "site_type": "discussions", "published": "2017-03-16T02:00:00.000+02:00", "replies_count": 1, "uuid": "545e59c84e1491cd4c84f2fb53dcde220e895119"}, "author": "Oldkerf", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d596437-r458442392-The_Inn_At_The_Roman_Forum-Rome_Lazio.html", "ord_in_thread": 0, "title": "Perfect hideaway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed a week at The Inn At The Roman Forum and loved every minute.\nIt's a perfectly placed little hideaway for all of ancient Rome's remarkable ruins, a short stroll from the Forum, the Colosseum, Pantheon, Trajan's column etc and easily walkable from other sights like the Piazza Navona, Piazza del Popolo, Spanish Steps, Trevi Fountain and the like. The Vatican is about a half hours walk. You are also surrounded by lovely narrow little streets in which to find some excellent little bars and restaurants and quaint squares.\nWe had room 303 in the main building. Other rooms are in an annexe just a few steps away. We preferred the main building rooms as they are more convenient for the top floor bar and lounge and outside terraces.\nThe rooms are all a decent size and lavishly furnished\nin a different style and have all the amenities one could want, including robes and slippers, safe, TV with Sky, hairdryer, iPod docking station and plenty of good toiletries in the en-suite bathroom which had a jacuzzi bath with rainfall shower over.\nThe rooms and bathroom were spotlessly clean and maintained to a very high standard every day.\nThere is free wi-fi on every floor and a computer and printers in reception.\nBut the charm of the hotel lies in its staff. The front desk team are endlessly friendly and helpful, the bell boys indefatigable and the stars of the show are Barbara and Valentina who conjure up fantastic breakfasts in a little kitchen off the lounge.\nBreakfast is eaten here and on the terrace, weather permitting, and the range of food is superb. Choose from cold cuts of meats and cheeses, small pastries or go the whole hog and have eggs freshly cooked to order with sausages, bacon et al. Barbara is also an ace baker and always brings you little treats specially baked for the guests - her raisin cookies deserve special mention!\nIn the evening the lounge doubles as a quiet little bar. Francesco seems to be the main man here, an extremely personable young man who tirelessly attends to the guests. From 5 pm until 8 pm there is also a free buffet (once you've ordered a drink) from which to nibble while you plan dinner!\nIt is a perfect little hideaway, tucked away from the hustle and bustle of the crowds yet with something eye-popping just round the corner - highly recommended.", "external_links": [], "published": "2017-03-16T02:00:00.000+02:00", "crawled": "2017-03-31T19:32:09.531+03:00", "highlightTitle": ""}