{"organizations": [], "uuid": "0f6eb785bc05db6319609933b3a7547352f96506", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/56/c9/44/casablanca-hotel-times.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d113317-Reviews-Casablanca_Hotel_by_Library_Hotel_Collection-New_York_City_New_York.html", "section_title": "Casablanca Hotel by Library Hotel Collection - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d113317-r469733030-Casablanca_Hotel_by_Library_Hotel_Collection-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "This hotel met all our expectations!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "This hotel met all our expectations! - Review of Casablanca Hotel by Library Hotel Collection, New York City, NY - TripAdvisor", "spam_score": 0.004, "site_type": "discussions", "published": "2017-03-23T02:00:00.000+02:00", "replies_count": 0, "uuid": "0f6eb785bc05db6319609933b3a7547352f96506"}, "author": "Terri H", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d113317-r469733030-Casablanca_Hotel_by_Library_Hotel_Collection-New_York_City_New_York.html", "ord_in_thread": 0, "title": "This hotel met all our expectations!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We spent 6 nights at the Casablanca Hotel earlier this month. The reviews on this website and others make it seem too good to be true! However, taking into consideration our list of must-haves, I have come to believe that I could not have chosen a more perfect place to stay!\nWe arrived around 2pm, and had to drop off our luggage and then return our rental car. The hotel helped gather our bags and hung onto them for us until we returned. We were able to park briefly in front of the hotel, and the doorman was most gracious helping us unload. The person at the desk was willing to check us in immediately, but we asked him to just hang onto our bags and stated we would be back in about an hour.\nWhen we arrived back, we were able to check in. Our room was not quite ready, so we had a seat in Rick's Café, enjoying a hot coffee and some cookies. The front desk gave us a map, and we were able to plan our route for the following day. We also decided on having dinner in the Hell's Kitchen area, which was only about a 10-15 minute walk from the hotel.\nOnce our room was ready, the manager brought us our keys to the room, and met us upstairs with our luggage. We had the 5th floor suite with two beds, and absolutely loved the space! Some of our criteria for selecting a hotel was to have somewhere that was within walking distance to many of the areas we wanted to visit, easy access to the Subway, near the theaters, not crowded, and that provided a quiet place to relax after a busy day of touring. This hotel met all those needs, and consistently added personal touches which made our stay even more special!\nWe were able to get a pass to the New York Sports Club each day from the front desk. It was about a 5-7 minute walk from the hotel, depending on whether we had to wait for the traffic lights. On one of our first days, we used the last two passes, and I was afraid they would not have had a chance to replenish their supply by the next day....but sure enough, they always had them available for us!\nI also had to keep up with work every day, and the internet and business center computers worked very well! We had asked for a refrigerator and make up mirror in our room, and those were there when we arrived. The housekeeping staff made sure we always had bottled water available in the room, which we took with us when we left the hotel in the morning and enjoyed after working out! There was also a welcome basket with a bottle of red wine to celebrate my husband's birthday! The rooms came with bathrobes and slippers and the bath products were very nice!\nWe had breakfast most mornings in Rick's Café. The hostesses would offer to toast our bagels and then deliver them to our table. We enjoyed the fresh fruit, and after seeing the Broadway play \"The Price\", we had to have a hard boiled egg in honor of Danny DeVito! We also appreciated the evening reception in Rick's café. It was a great way to have a pre-theater snack (wine, cheese, veggies and dip, fresh fruit, crackers, olives, cookies, etc.) prior to heading out to our evening plans. On one rainy night, we ended up playing board games in the area. There was a pianist playing, and he came over and visited with us a few times while we were there! He is quite talented, and had a warm reception by everyone gathered in the area.\nI have been back home for two weeks, and have nothing but fond memories for our stay. New York City is a crazy, hectic, exciting place to visit. Being able to walk into the Casablanca Hotel and be immediately surrounded by peace and serenity and a warm greeting was so appreciated! I have already referred a number of my friends to this hotel, and hope they end up staying here during their future travels to New York City!. The staff treated us like family! Thank you for such a perfect stay!\nRoom Tip: The King Suites are at the front of the hotel, the two bed suites are at the back. The back is defi... See more room tips", "external_links": [], "published": "2017-03-23T02:00:00.000+02:00", "crawled": "2017-03-26T21:50:32.864+03:00", "highlightTitle": ""}