{"organizations": [], "uuid": "0e46758bbf0d1710d85939d292504f81c303196f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/c0/2c/b7/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d299851-Reviews-Novotel_Xinqiao_Beijing-Beijing.html", "section_title": "Novotel Xinqiao Beijing - UPDATED 2017 Hotel Reviews &amp; Price Comparison (China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d299851-r470096927-Novotel_Xinqiao_Beijing-Beijing.html", "country": "US", "domain_rank": 189, "title": "Staff are excellent", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Staff are excellent - Review of Novotel Xinqiao Beijing, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-25T03:00:00.000+03:00", "replies_count": 1, "uuid": "0e46758bbf0d1710d85939d292504f81c303196f"}, "author": "Katie M", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d299851-r470096927-Novotel_Xinqiao_Beijing-Beijing.html", "ord_in_thread": 0, "title": "Staff are excellent", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed at the Xinqiao Beijing Novotel hotel for 4 nights whilst on a short holiday to Beijing. The hotel is in a great central location, right next to Chongwenmen subway station and in walking distance to The Temple of Heaven, Tiananmen Square and the Forbidden City.\nThe rooms were nice and clean although the beds were a little hard. When we first checked in we had an economical room which didn't have a window. We weren't too worried about not having a window as we were out all day anyway so spent very little time at the hotel anyway. Saying that, we did have a problem with our room on the second day and the staff were extremely helpful and changed our room immediately and moved us to a superior room, which did have a window and was a lot more spacious than the economic room.\nThe staff are extremely helpful and will go above and beyond to help you. Julian, a member on the front desk and lobby staff in particular. He helped us hugely on our last day in Beijing when we realised we had been victims of a scam near The Forbidden City. To cut a long story short, don't trust anyone who says they are learning English and want to practice their English over tea or coffee in a bar. This is a massive scam where they work with a bar or tea house, get you to go there, order drinks and then charge you a fortune for the drinks that obviously don't cost that much but once your're there, they make you pay.\nWe realised we had been scammed and went and asked the hotel staff what we could do and if they could give us any advice. Julian and another manager, Stella, were extremely helpful. They phoned the police and Julian even went out of his way to come with us at the police station to translate from Chinese to English. Without his help, we would have never have got all our money back, 1800RMB in total (that's £210 that they charged us for a tea and a beer!!) from the bar.\nWe really couldn't thank Julian and the rest of the hotel staff enough, they really are excellent!\nWe ate in the hotel restaurant Citrus once. The food was good and reasonably priced. Obviously it's a bit more expensive than the restaurants and food outlets near by but not ridiculous (equivalent to roughly £35 for 2 main meals and 2 drinks, so not bad).\nThe concierge desk were very good as well, they also have staff outside to hail taxis for you when needed. The taxis around Beijing aren't expensive either, they may take longer than the subway though, or even walking, due to the amount of traffic at peak rush hour times.\nOverall, the hotel is nice, clean and modern but the staff definitely made the stay better.\nRoom Tip: Ask for a room with a window if possible. See more room tips", "external_links": [], "published": "2017-03-25T03:00:00.000+03:00", "crawled": "2017-03-28T04:48:09.364+03:00", "highlightTitle": ""}