{"organizations": [], "uuid": "59d37f20ad12dd0dadc6217995e58b6ad61403af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/daodao/photo-s/07/84/7e/12/caption.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d7098769-Reviews-Renaissance_Beijing_Wangfujing_Hotel-Beijing.html", "section_title": "Renaissance Beijing Wangfujing Hotel - UPDATED 2017 Reviews &amp; Price Comparison (China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d7098769-r468224372-Renaissance_Beijing_Wangfujing_Hotel-Beijing.html", "country": "US", "domain_rank": 189, "title": "Amazing stay!! - Review", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Amazing stay!! - Review of Renaissance Beijing Wangfujing Hotel, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "59d37f20ad12dd0dadc6217995e58b6ad61403af"}, "author": "Andres B", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d7098769-r468224372-Renaissance_Beijing_Wangfujing_Hotel-Beijing.html", "ord_in_thread": 0, "title": "Amazing stay!! - Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My wife and I just got back from a trip around China. We stayed in this hotel at the beginning of March, and it was amazing. It was our first time in China and after a 16 hours journey from Miami, I wanted to ensure that the first hotel would be a good one. After going through reviews I booked this hotel, and I am so glad I did. This hotel is five stars across the board from the attention of the staff, the hotel manager to the concierge I cannot say enough. The location of this hotel is great close to shopping in wanfujin road. You can even walk to the forbidden city or a short cab ride. We walked at one point and it was 15 min and it gives you a gr at glimpse at city life etc. our first night we did the club level breakfast and drinks and it was great ! You can serve your our drinks etc. the other days we did the regular breakfast at the lower level which was amazing . So much food and a great variety. I didn't want to book the breakfast package because I said to myself I'll eat breakfast outside. But after I tried their breakfast I said forget it I'll eat here every morning super fabulous. They have all kinds of food items from Chinese breakfast like dim sum etc to western food like omelettes station, bacon pastries etc. the rooms were big and always clean with waters in room etc. it felt really good walking in the hotel after a day around the city. The hotel has a great gym, small but has everything you need, I used the gym almost everyday. I will for sure stay at this hotel in Beijing. This hotel will not disappoint I am so glad I booked it.", "external_links": [], "published": "2017-03-18T02:00:00.000+02:00", "crawled": "2017-03-26T23:22:01.241+03:00", "highlightTitle": ""}