{"organizations": [], "uuid": "e438592675d4e20ebaf3ff32bac39aa5a2778aa4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/d0/8c/55/mercure-paris-opera-garnier.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d256389-Reviews-Mercure_Paris_Opera_Garnier-Paris_Ile_de_France.html", "section_title": "Mercure Paris Opera Garnier - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d256389-r470353209-Mercure_Paris_Opera_Garnier-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "wonderful little hotel, ideal location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "wonderful little hotel, ideal location - Review of Mercure Paris Opera Garnier, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 1, "uuid": "e438592675d4e20ebaf3ff32bac39aa5a2778aa4"}, "author": "Alison L", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d256389-r470353209-Mercure_Paris_Opera_Garnier-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "wonderful little hotel, ideal location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "my husband and i booked our paris trip through a package with gate1 travel and upgraded our hotel to the mercure paris opera garnier. the experience was wonderful.\ni've been to paris the previous year and stayed near the tuileries at the westin vendome. it was a lovely experience, being not only in a beautiful hotel with views of historic paris, but it's also tourist central and the closest metros are a 15 minute walk in either direction. i had remembered liking the opera neighborhood during my last visit, which is why we chose the hotel mercure garnier. in terms of convenience and location, it couldn't have been better! we were a 2-3 minute walk from two major metro stops (havre-caumartin and saint-lazare) which literally connect to any other metro line in the city. that, and we also felt immersed in the city, amongst the locals in this area. loved that aspect.\nwe had read the hotel was going through some renovations at the time, and witnessed that a bit, but it wasn't intrusive at all. the staff was wonderful - friendly and patient. they truly went out of their way to make our stay comfortable as possible. two examples: the morning we checked in they apologized profusely for the renovations, which as i mentioned were hardly noticeable, and gave us a free bottle of champagne that evening for any inconvenience. also, the morning we left, we had a super early start and got downstairs for 6am (when we thought breakfast started, to get a quick bite before our car came to pick us up for the airport). we were sad to learn breakfast didn't begin until 6:30. the front desk staff and the cafe staff worked quickly to get everything set up so we were able to eat breakfast early, around ten after 6. we couldn't thank them enough!\nin terms of the hotel itself, the renovated areas are beautiful and modern (and the non-renovated sections of the hotel are lovely, too). with the package deal through gate1, we were given vouchers for free breakfast every morning. (not sure if all guests get this convenience, but even if you have to pay, i would say it's worth it.) the spread was huge - fresh fruit, yogurt, cereal, every bread you can imagine, croissants, pain au chocolat, eggs, bacon and sausage - and fresh squeezed orange juice, coffee, and tea. definitely worth the stay at the hotel in and of itself because we didn't have to eat out every morning!\nreally the only downside to our stay (if you could call it that) was that our room was #624, but was really on the 5th floor, down a hallway and up a short stairwell. it was just a little inconvenient with our luggage going up and down the steps, but the front desk staff put us in a newly remodeled room, which we appreciated so we couldn't really complain.\nall in all, a wonderful stay. we would (and may!) definitely return! :)\nGreen Features: we loved the keycard electricity switch, and other measures the hotel went to to be environmentally-friendly so we weren't using more than we needed.", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-29T13:43:41.719+03:00", "highlightTitle": ""}