{"organizations": [], "uuid": "3166588c452b222d9850cfbb8984bd1f0f17ad23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/5d/a5/71/hotel-monge.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d10328342-Reviews-Hotel_Monge-Paris_Ile_de_France.html", "section_title": "Hotel Monge - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d10328342-r470430035-Hotel_Monge-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Parisian Charm, Convenience & Luxury", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Parisian Charm, Convenience & Luxury - Review of Hotel Monge, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "3166588c452b222d9850cfbb8984bd1f0f17ad23"}, "author": "bossfan59", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d10328342-r470430035-Hotel_Monge-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Parisian Charm, Convenience & Luxury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thanks to TA, we found this wonderful hotel for our first stay in Paris. The location, just around the corner from the Rue Navarre entrance to the Place Monge Metro stop, and a few minutes walk to the Cardinal Lemoine stop was excellent; it made traveling all over Paris on the Metro very easy and convenient.\nOur first impression was very positive, as we were greeted warmly by the concierge who stored our luggage and gave us helpful directions. We arrived mid-morning so did not expect our room to be ready but we were able to enjoy a lovely 15 minute walk to experience Notre Dame and the Seine in the spring sunshine. After a marvelous lunch at Les Papilles, we returned to Hotel Monge to find out luggage had already been placed in our deluxe double room on the 3rd floor for us; how delightful and considerate! Our room was utterly charming, modern and spotlessly clean. We loved that the windows opened onto Rue Monge, but really appreciated the triple glazing that completely shut out the noise of that busy street. The bathroom was wonderful, featuring amazing water pressure and instantaneous hot water, something I always appreciate. The L'Occitane toiletries were a wonderful touch too. The room also featured a mini bar with very reasonable prices, only 3 euros each for sodas, waters and more. The bed was very comfortable and featured an abundance of pillows. My only complaint was that it was quite warm in the room (due to the heat being on in the building) and I found the duvet rather heavy, though others may enjoy this.\nWe had a room rate that included breakfast which was a delight! The small breakfast room adjacent to the elegant living room area accommodated hotel patrons without a wait, with the exception of Sunday morning when there was a large number of people dining. The breakfast buffet was very well stocked, and a carb lovers delight. It features a wide array of breads (croissants, rolls, baguettes, pain de chocolate, etc.) but also had protein items such as eggs, delicious ham, a typical European cold cut tray, yogurt and more... Beverage choices included OJ & grapefruit juice and a coffee machine that made espresso drinks!\nAll employees we interacted with were very friendly and polite (as was everyone we encountered in Paris really). We ordered a taxi on our last evening to take us to the train station and it arrived the next morning right on time.\nI would unreservedly recommend this lovely jewel of a hotel to anyone looking for Parisian charm, excellent service and a very comfortable stay.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-27T21:57:15.063+03:00", "highlightTitle": ""}