{"organizations": [], "uuid": "a93d5f3cd7261d45783fa890544c6e6a830c763f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/7e/96/4d/hotel-manfredi-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d456489-Reviews-Hotel_Manfredi_Suite_in_Rome-Rome_Lazio.html", "section_title": "Hotel Manfredi Suite in Rome - UPDATED 2017 Reviews &amp; Price Comparison (Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d456489-r471030759-Hotel_Manfredi_Suite_in_Rome-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Fabulous Boutique Hotel, with perfect Location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Fabulous Boutique Hotel, with perfect Location - Review of Hotel Manfredi Suite in Rome, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "a93d5f3cd7261d45783fa890544c6e6a830c763f"}, "author": "ladylala1973abc", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d456489-r471030759-Hotel_Manfredi_Suite_in_Rome-Rome_Lazio.html", "ord_in_thread": 0, "title": "Fabulous Boutique Hotel, with perfect Location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed at Hotel Manfredi in March 2017 for 2 nights; booked with them directly and via email correspondence, they kindly booked us a Limo to collect us from the airport, the driver was there to meet us and he was very informative to point out key buildings etc on route to the hotel, such a nice way to arrive (if only we had booked this on the return to the airport).\nWe were a little confused entering the hotel as there was not a reception on ground floor. However we were told by a passer-by to go to the 3rd floor. We loved the beautiful old lift, it’s a wonderful feature. We checked in and a lovely lady on reception was very instructive, gave us a map, told us about the taxes we need to pay etc and showed us to our room 202 on 2nd floor superior double.\nThe room was lovely, the bed was firm and I was worried as I have osteoarthritis; however I had 2 fab nights’ sleep. Lovely toiletries lay on the bed and a bottle of wine and happy anniversary bottle of red awaited us which was such a lovely surprise. The bathroom door is the only thing I didn’t like as I was glass and there’s not much privacy when on the toilets as the door didn’t seal closed. Lots of room in the wardrobe and extra pillows / blanket if needed too. It was very hot when we were there so we had the window open all night, it wasn’t too noisy.\nLocation is marvellous, so close to the Spanish Steps and Trevi Fountain is a short walk away too. We used Taxis to all our trips and reception were helpfully in booking these for us each time, taxi arrived within a few minutes. The road parallel has all the designer shops, art galleries and trendy bars etc. you feel safe walking here at night.\nWe needed an iron for my husband’s shirt, so we asked at reception and they had it ironed for him!\nBreakfast was great lots of choice; the homemade yogurt was delicious, lots of tea to choose from and my husband said the coffee was good too. Cereals, Fresh fruit, Homemade fruit salad, muffin, plum cakes, pies, biscuits, cookies, cheese cake, Croissant and mini Croissant, Eggs boiled, Eggs soft boiled and Eggs scrambled, Bacon and hot dogs, ham, parma ham, salami, turkey, Cheese, cakes, Homemade yogurts and Fresh fruit juice. (do try the chocolate cake it’s unreal)\nEmmanuel recommended a lovely restaurant to eat in called Ristorante Dillà, a few roads away. It was fantastic great décor, reasonably priced and the food was very good too.\nOur return flight wasn’t until the evening so they kindly let us leave our suitcases there while we went off for the day and when we got back and we had a few drinks in the bar and they called us a taxi to the airport (which was the most terrifying journey ever as threes a set rate ALL the taxis drive as quickly as possible to get there) as I mentioned next time we’ll use the hotel limo service both ways!\nTo sum up the hotel is in a fantastic location, lovely boutique hotel with great staff and lovely rooms, we were superbly taken care of by the Hotel's manager Emmanuel and his team they make you feel so welcome! Highly recommend Hotel Manfredi for a truly perfect Rome break. We will be back!", "external_links": [], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T05:09:46.841+03:00", "highlightTitle": ""}