{"organizations": [], "uuid": "dcdf73ff2fa443e60f8f08d9d6e72a356f2d5e06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/80/99/2b/hudson-studio.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1218720-Reviews-or20-The_Standard_High_Line-New_York_City_New_York.html", "section_title": "The Standard, High Line - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1218720-r465622974-The_Standard_High_Line-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "BEST HOTEL, LOVE THIS PLACE MORE THAN I CAN SAY", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "BEST HOTEL, LOVE THIS PLACE MORE THAN I CAN SAY - Review of The Standard, High Line, New York City, NY - TripAdvisor", "spam_score": 0.217, "site_type": "discussions", "published": "2017-03-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "dcdf73ff2fa443e60f8f08d9d6e72a356f2d5e06"}, "author": "789carmela", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1218720-r465622974-The_Standard_High_Line-New_York_City_New_York.html", "ord_in_thread": 0, "title": "BEST HOTEL, LOVE THIS PLACE MORE THAN I CAN SAY", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I think some people might have certain preconceived notions of the Standard, and what it's like to stay there (e.g., form over function, inattentive service, noise, etc.). As a guest who has stayed there *dozens* of times, in various kinds of rooms, I can say that while the hotel itself is gorgeous--I love the aesthetic and design--what keeps me coming back is the staff. Unbeatable!\nSamantha, the front office manager, goes *way* beyond every time, exceeding expectations and welcoming me like an old pal. She's always attentive to a guest's needs and makes sure that the stay is perfect (which it always is). She's friendly, helpful, responsive, and above all, truly makes me feel like the Standard is a home away from home. She's just great at her job and understands the importance of building guest loyalty.\nThe rest of the staff I've gotten to know--Monique, Nico, and others--are also warm, professional, and wonderful to talk to. Don't be intimidated by the Standard as a \"hip\" hotel. Yes, it's a cool place to stay, but it's more than that.\nIf anything is ever not to your liking, the staff is quick to address an issue and make sure you're happy. They seem to adore kids and pets. (My dog Freddy always receives an exuberant, royal welcome and lots of treats.) And the front desk staff seems genuinely glad to see you when you walk through the door. I just can't say enough great things about this hotel--and I won't stay anywhere else now. And yes, the rooms are quiet. I always get a great night's sleep here.\nThe rates are already pretty reasonable for what you get: spectacular views, beautiful rooms, a fitness center with stunning views, and one of my favorite restaurants in New York, the Standard Grill--but even if another hotel had lower rates, I would still choose the Standard every time, no question.\nThank you so much to Samantha and everyone else at the Standard. You guys are the best and I will be returning with my family again next week. Can't wait!!\nSome neighborhood recommendations: The Whitney, The High Line, Gansevoort Market, Myers of Keswick, Chelsea Market, Jack's Coffee at Rag & Bone, Sweetgreen, and HIIT classes at Kore New York.\nRoom Tip: Corner rooms are great, and high-floor rooms, and the Hudson Suite is gorgeous. But really, anywhere... See more room tips", "external_links": [], "published": "2017-03-08T02:00:00.000+02:00", "crawled": "2017-03-30T23:49:51.189+03:00", "highlightTitle": ""}