{"organizations": [], "uuid": "123da3107c4dc7944cc3d6e8a2777a1540eecdf3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/9d/a3/dc/hotel-fabric.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d4340356-Reviews-or10-Hotel_Fabric-Paris_Ile_de_France.html", "section_title": "Hotel Fabric - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d4340356-r461167102-Hotel_Fabric-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Delightful boutique hotel in the 11th district", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Delightful boutique hotel in the 11th district - Review of Hotel Fabric, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "123da3107c4dc7944cc3d6e8a2777a1540eecdf3"}, "author": "cvp28", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d4340356-r461167102-Hotel_Fabric-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Delightful boutique hotel in the 11th district", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I felt compelled to write my first review following an excellent 2 night stay at Hotel Fabric with my partner.\nWe booked this hotel after discovering it was a TripAdvisor 'Travellers' Choice 2017' winner and after reading the multiple positive reviews on TripAdvisor. We also felt the Special Offer 'Package Deal' (advertised on TripAdvisor) which included 25% off the room rate, complimentary buffet breakfast and an alcoholic beverage per person, offered great value for money, particularly in comparison to other top-rated hotels in Paris.\nOberkampf is the nearest Metro to the hotel (circa 10 minutes walk), only 4 stops on the orange line from Gare Du Nord, and equally very accessible to Paris' many offerings. We bought a carnet of tickets which made for cheaper travelling.\nWe arrived at the hotel around 1.30pm and were warmly greeted by Cecilia, who told us everything we needed to know (and more!) We were very pleased when she made our room available, earlier than we anticipated, and she was similarly very helpful with her many recommendations for eateries and things to do. Merci beaucoup Cecilia!\nOur double room was quite small but was very comfortable and clean. The bathroom, particularly the monsoon shower was wonderful, a real treat in fact! The L'Occitane products were also a nice touch.\nThe breakfast offering was more than we anticipated. There were plentiful continental options, as well as some hot choices, plus teas, coffee, fruit juice etc. We definitely left the hotel feeling fully stocked ahead of our busy days exploring Paris!\nTea, coffee and bottled water is available throughout the day, and the Honesty Bar is set up for the evening. We had an aperitif, or two each night from the bar before going out which was very enjoyable.\nWe very much hope to return in the near future and/or visit Hotel Fabric's sister hotel Hotel Monge.\nRoom Tip: We wanted a quiet room as requested this with our booking, we stayed on the 4th (top)floor which was... See more room tips", "external_links": [], "published": "2017-02-25T02:00:00.000+02:00", "crawled": "2017-03-27T11:23:55.744+03:00", "highlightTitle": ""}