{"organizations": [], "uuid": "2206023b2857015285cb78c0b7a4de71543bf531", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/cf/93/9c/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g196574-d3509474-Reviews-Mercure_Paris_Levallois_Perret-Levallois_Perret_Hauts_de_Seine_Ile_de_France.html", "section_title": "Mercure Paris Levallois Perret - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Levallois-Perret, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g196574-d3509474-r453974011-Mercure_Paris_Levallois_Perret-Levallois_Perret_Hauts_de_Seine_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Paris/Porte de Champerret and close to a fantastic Shopping mall with a Shuttle", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Paris/Porte de Champerret and close to a fantastic Shopping mall with a Shuttle - Review of Mercure Paris Levallois Perret, Levallois-Perret, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-06T02:00:00.000+02:00", "replies_count": 1, "uuid": "2206023b2857015285cb78c0b7a4de71543bf531"}, "author": "criticonline", "url": "https://www.tripadvisor.com/ShowUserReviews-g196574-d3509474-r453974011-Mercure_Paris_Levallois_Perret-Levallois_Perret_Hauts_de_Seine_Ile_de_France.html", "ord_in_thread": 0, "title": "Paris/Porte de Champerret and close to a fantastic Shopping mall with a Shuttle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I am not sure I will have enough space to write all my compliments to this hotel...!\nSearching for a hotel in Paris with a real and large accessible/handicapped room for me and my father, and willing to remain in Paris, with a reasonnable price, I finally found this fabulous Mercure Hotel Accessible room (there are 2 in fact located on the 1st Floor...) in Levallois-Perret, which is a village located outside of Paris limit BUT a walking distance from the Porte de Champerret in Paris.\nAll transportation are available from Metro, Bus, and a Village Shuttle takes you around for free around the village and drops you right at an international shopping mall (who by the way has a Mark's & Spencer!), called \"So Ouest\" with fashion boutiques, restaurants and even a movie theater! Fantastic village especially for families with children, because in the center of the village there is a park, and you can have a walk to the Seine river, where you can have a fantastic brunch on Sunday on an immense barge restaurant, next to a play ground...Wow!\nI made a reservation for 2 weeks at he Mercure hoping my father would get out from the hospital nearby, but I ended staying a month in the hotel because my father never got out form the hospital and then we moved back in another area of Paris...\nMy stay in this hotel, with breakfast included was really like in a B&B, with very nice and courteous people, and every morning breakfast was serve in the lobby or outside in the courtyard, with several tables, chairs and even a sofa. Breakfast has everything you like or you can ask for and automatic coffee machine has an an excellent coffee!\nManager, Receptionists, Room Attendants, Waitresses and Waiters, everybody... are absolutely polite, helpful, attentive, and professional. I loved every one in this hotel, especially the Manager Maria! I was also a silver member at the Accor Hotels chain and now I am a gold member, so that helps too... Good to make yourself a member!\nThe room has a big screen TV and a gigantic bathroom for wheelchairs. Two reasons for the choice of this hotel, and I did not write a review because if I knew that after my review these rooms will never be empty in the future, and I could not get this room again easily... Lol... Paris is a disaster for handicapped clients and accessible room due to the hotel located in old buildings and are not approved by the Paris administration. But they said they are improving this... When? Nobody knows...\nFinally, the transportation is perfect and bus is located at a few minutes walk from the hotel and some buses take you directly the center of Paris, whatever your directions is! Porte de Champerret is directing you anywhere in Paris by Bus, and from Paris you can arrive in the heart of Levallois-Perret by Metro! and then take the bus to the hotel or simply walk or take the free shuttle (plan is available).\nA plus: if you like Suchi, French, Thai, restaurants they are in the same street!\nConclusion: if you are in a hurry to make a reservation during a busy time, don't bother research, get here immediately. I spent a lot of time researching already...\nEnjoy and hoping the best for the hotel staff that I thank a lot!\nRoom Tip: 2 Fabulous accessible rooms on the first floor and breakfast in the lobby. See more room tips", "external_links": [], "published": "2017-03-06T02:00:00.000+02:00", "crawled": "2017-03-29T12:56:52.615+03:00", "highlightTitle": ""}