{"organizations": [], "uuid": "297650105643f446d5957b1c23be38819dedb31b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/70/aa/ff/night-view-exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d289306-Reviews-or10-DoubleTree_by_Hilton_Hotel_London_ExCel-London_England.html", "section_title": "DoubleTree by Hilton Hotel London ExCel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d289306-r468467358-DoubleTree_by_Hilton_Hotel_London_ExCel-London_England.html", "country": "US", "domain_rank": 189, "title": "Good but does not ExCel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Good but does not ExCel - Review of DoubleTree by Hilton Hotel London ExCel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "297650105643f446d5957b1c23be38819dedb31b"}, "author": "Ajayloulou", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d289306-r468467358-DoubleTree_by_Hilton_Hotel_London_ExCel-London_England.html", "ord_in_thread": 0, "title": "Good but does not ExCel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed at the Double Tree by Hilton for work. I was working on a stand at the ExCel exhhibition Centre and the Hilton was excellent for Value and Location. This is very much a business hotel with a lot of traffic from the City Airport Close by.\nthe hotel is easy to locate a short taxi ride from the airport and a ten minute walk from the connecting Docklands Light Railway service. There is limited free parking at the front of the hotel and I was very fortunate to find a space. There is other chargeable parking close by and it did not get full during the time of my stay.\nReception big bright airy. Staff very welcoming, and very helpful. I had arranged for some leaflets to come to the hotel and the receptionist had everything ready for me.\nMy room was clean, well appointed with a view out to the river. Sadly the doors were locked to the French Windows so I could not step out onto the balcony. This is probably due to health and safety issues. But I did not confirm. There is free WiFi, but this does close down of an evening around 11.00pm. I also found that whilst I received some e-mails nothing would send out. So you may have to upgrade to a premium service, or use another location if you need to work.\nShower room, very clean well appointed. My personal preference would have been to include a bath. I know not everyone's taste. But having been on my feet all day at an exhibition I really missed my soak.\nRestaurant, menu Okay. Restaurant itself well presented, and food very well cooked. It came under pressure at Breakfast time because of its size and there were some issues with queuing, but a little forethought can overcome the pressure times. Staff a little mixed, two really good waiters, who got used to me and my preferences. Waitresses a little more perfunctory, but perhaps they had trouble with single male travellers in the past. There was normally a routine of being shown to your table but from time to time you were just waved through to hunt down a table and hope for service.\nBar. That was my personal gripe. Nice bar area, pleasant surroundings, not big enough to accomodate the guests especially at exhibition times. A few times I entered the bar and there was no one behind the counter to server. This is no way a criticism of the bar staff. They were busy, but there is just not enough staff for that area particularly of an evening.\nOne thing to remember this hotel is close to the City airport it is in the flight path of aircraft taking off, there is noise protection, but your room will not be silent and you will get aircraft noise and there is nothing anyone can do about that.\nOne thing you must do, whilst in this area is to ride the Emirates Cable car across the river. I did this at night and the views were terrific. If you don't like heights do not ride, the car will sway.\nOverall a good service hotel, and I will probably be back next year if the company commits to exhibiting there again.", "external_links": [], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-31T22:15:16.352+03:00", "highlightTitle": ""}