{"organizations": [], "uuid": "596e9c901a99343378cfea09096d53cf31d90174", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/3d/be/2e/gardens-nyc-an-affinia.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93467-Reviews-Gardens_NYC_an_Affinia_hotel-New_York_City_New_York.html", "section_title": "Gardens NYC-an Affinia hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93467-r470698800-Gardens_NYC_an_Affinia_hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Excellent location, spacious rooms and friendly staff", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Excellent location, spacious rooms and friendly staff - Review of Gardens NYC-an Affinia hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "596e9c901a99343378cfea09096d53cf31d90174"}, "author": "anniefish", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93467-r470698800-Gardens_NYC_an_Affinia_hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Excellent location, spacious rooms and friendly staff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A belated review for our stay over New Years 2016/17. We really loved our stay here - there are wonderful restaurants and diners nearby as well as the subway for getting around. The doormen both really added a lovely touch to the atmosphere and we loved Happy Hour in the lobby. We had some issues with our reservation which were annoying but I can't be sure whether it was the hotel or our travel agent who was to blame. We booked a one bedroom suite but were initially given a standard double/double room. When we pointed this out we were advised that we needed to pay extra for the larger room, even though our booking clearly stated that we had already paid for a one bedroom suite. We moved rooms and the travel agent paid the difference. But then when we checked out, our travel (debit) card was charged for the full amount of our stay, even though we only provided this for incidentals and hadn't authorised the room to be charged on this card as we had already paid the travel agent. Apparently it was because our travel agent hadn't paid on time. But I still feel that we should have been advised of this as it took over a week to obtain the refund to a card that was the only card that we had in USD for spending money. Having said all that and with the defence that it may have been an issue with the travel agent that caused the initial problem, I can definitely recommend Affinia Gardens. The size of the one bedroom suite was just wonderful for a family of four with all our baggage.\nRoom Tip: One bedroom suite on the higher floors for space and noise. See more room tips", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-29T06:56:14.255+03:00", "highlightTitle": ""}