{"organizations": [], "uuid": "52a2f534526734f9f2fe805b571a9c1e52f841ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/84/14/af/cultural-preformances.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d1837034-Reviews-Red_Wall_Garden_Hotel-Beijing.html", "section_title": "Red Wall Garden Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Beijing, China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d1837034-r468695953-Red_Wall_Garden_Hotel-Beijing.html", "country": "US", "domain_rank": 189, "title": "Just perfect", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Just perfect - Review of Red Wall Garden Hotel, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 0, "uuid": "52a2f534526734f9f2fe805b571a9c1e52f841ed"}, "author": "milburnski", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d1837034-r468695953-Red_Wall_Garden_Hotel-Beijing.html", "ord_in_thread": 0, "title": "Just perfect", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I spent a few days at the Red Wall Garden Hotel on business in Beijing recently. It looked pretty good on Trip Advisor, but seeing is believing. One of the most pleasant hotel experiences I've had anywhere in the world. From the check-in, to the beautiful upstairs lobby, to my well appointed room with its little balcony, it was just delightful.\nThe reception staff spoke excellent English, the restaurant was very good, and the little bar a real treat. The decor is China Modern, a skillful blend of old and new so seamless that it was easy to imagine you were living in a museum, or maybe some billionaire's pied-à-terre.\nAnd the neighborhood, Shija Hutong, is a treat all by itself, a piece of old Beijing just a few blocks from the glitzy high rise hotels. Be sure to check out the little museum about a block down the road towards the Metro station that explains the area and it's history. Way better than the Forbidden City, which is more of a bucket list item to be endured than enjoyed.\nSpeaking of the Forbidden City, you might be tempted by the maps to think it's nearby. It is, in the sense that Germany is close to France, but the sheer scale of Beijing is difficult to comprehend until you've been there. Fortunately, taxis are cheap and the Metro station nearby. The hotel is great at arranging outbound taxi trips, and don't forget the card (in Chinese) that tells taxi drivers where to take you home, but I strongly recommend a smartphone with a Metro and Chinese translation apps.\nMy work takes me all over the world, and I've already spent more than a lifetime's worth of nights in expensive, generic, global name brand rooms. I'm not easily impressed. The Red Wall impressed me.\nRoom Tip: I had a second floor room in the main building above the restaurant with a balcony overlooking the c... See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-26T23:28:50.302+03:00", "highlightTitle": ""}