{"organizations": [], "uuid": "deeed0439c309598b99b5237a91ac00be10f8ef2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/03/53/74/hotel-eiffel-segur.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d248399-Reviews-Hotel_Eiffel_Segur-Paris_Ile_de_France.html", "section_title": "Hotel Eiffel Segur - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d248399-r465579984-Hotel_Eiffel_Segur-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Weekend Stay - LGBT Friendly", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Weekend Stay - LGBT Friendly - Review of Hotel Eiffel Segur, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-08T02:00:00.000+02:00", "replies_count": 1, "uuid": "deeed0439c309598b99b5237a91ac00be10f8ef2"}, "author": "LJSok", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d248399-r465579984-Hotel_Eiffel_Segur-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Weekend Stay - LGBT Friendly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Date: 17th February - 20th February 2017.\nI stayed here with my wife and read a lot of reviews before staying. I could not find anything on how LGBT this hotel was however we had absolutely no issues at all so all you LGBT people, you have nil to worry about.\nThis hotel is a lovely and modern place to stay in Paris. The best part of the hotel is the staff members as they are very helpful and speak brilliant English for those of you who don't speak any French.\nWe got a return shuttle from Charles De Gaulle Airport to the Hotel via Expedia for £58 which was really easy to arrange and quick so i would recommend using them!\nWe arrived in the afternoon at the hotel and check in was very easy. I was aware i had to pay city tax of approximately 10 euros however i did not pay this until check out and you can only pay this by CASH so make sure you have some cash left over if you owe city tax charges. (I booked through Expedia and it states this at the booking).\nWe were given a map of the city by the staff and we were given advice to use the street opposite (Avenue De Segur) the hotel in order to get to the majority of sites as walking to the rear of the hotel was more of a Parisian residential area.\nThere is a lift and also stairs available within the hotel.\nThere is also breakfast available however this is an extra charge.\nWe stayed on the top floor. The room was nice and clean. I noticed a lot of people stating the rooms are tiny and no space however the room we had on the top floor was absolute fine. The bathroom was very compact but you don't exactly spend your whole time in the bathroom on your holiday, likewise with you hotel room.\nView was good of the Eiffel Tower and every hour at night time from about 6 or 7pm the tower sparkles up until about midnight or 1am.\nThe bed was comfy and there are tea and coffee making facilities within the room. There is also a safe and a fridge.\nThe only negative i would have to say about the hotel is the walls are very thin but again, if you are only staying a couple of nights then its bearable. You can hear other peoples conversations so if you are away for a romantic getaway and embarrassed by showing your enjoyment with you partner then thats the only reason i wouldn't stay here again lol!\nMetro is right outside the hotel as well so its great if you don't enjoy walking for miles and miles! There are local places to eat and plenty of shops to enjoy wandering around.\nEiffel Tower is about a 20 minute walk.\nArc De Triumph is about a 40 minute walk.\nWe walked from the Eiffel Tower to the Arc De Triumph down to Louvre and then Notre Dame. This was about 12 miles but it was a very enjoyable walk if you wear comfortable shoes!\nI would stay at this hotel again! :)", "external_links": [], "published": "2017-03-08T02:00:00.000+02:00", "crawled": "2017-03-31T05:33:31.637+03:00", "highlightTitle": ""}