{"organizations": [], "uuid": "bd699ec85ff3d987c657f94ddaa16ebc6a765c19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/97/b2/0e/bedroom.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d262402-Reviews-Grange_Wellington_Hotel-London_England.html", "section_title": "Grange Wellington Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d262402-r464768048-Grange_Wellington_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Pure luxury at reasonable London prices! Well recommended", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Pure luxury at reasonable London prices! Well recommended - Review of Grange Wellington Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 1, "uuid": "bd699ec85ff3d987c657f94ddaa16ebc6a765c19"}, "author": "susanaholguin1961", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d262402-r464768048-Grange_Wellington_Hotel-London_England.html", "ord_in_thread": 0, "title": "Pure luxury at reasonable London prices! Well recommended", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed here two nights as I was attending a self development workshop on the Saturday which was held in this hotel. Aside from serious faced staff, although polite, this hotel was amazing and I loved it. I had a single room on the first floor. It had a large single bed (possibly a small double) sumptuous curtains, a mini bar, luxurious bathroom with toiletries, complimentary slippers, large tv, dressing table and chair. The shower was a bit tricky to fathom out and because the shower screen was partially fixed, getting out of the bath wasn't easy. I had room service while I was there - excellent! Very quickly delivered and breakfast was on time too (ordered the night before) The bar food menu is a bit limited but the prices are pretty good, generous portions, tasty and well presented food. I wasn't shown where the restaurant was but I don't like dining alone so was happy to eat in my room and I had lunch with people from the workshop, in the bar. Lovely comfy posh sofas in the bar to sit and read etc. Close to Victoria station and Westminster. I shall stay again when I have time for sightseeing. The weekend was purely about the workshop. Close to Tate Britain too and London Eye, so perfect for lots of touristy things. Good value for money. Even the mini bar prices didn't shock! Ok £2.50 for a can of diet coke but that's no more than bar prices and worth paying for the convenience. They did only supply one mug and one spoon which is surprising but it didn't spoil things. Bit noisy because my room overlooked the kitchen extractor fans, and also lots of cooking smells but with the windows shut, it wasn't an issue. I'd ask for a room away from that next time. All in all, a well deserved treat and I loved it. Just smile more, fellas! Oh so serious! Lol.\nRoom Tip: Ask for a room not by the kitchen fans! Some rooms are near reception so you'd get disturbed a l... See more room tips", "external_links": [], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-31T18:40:38.522+03:00", "highlightTitle": ""}