{"organizations": [], "uuid": "d4fb981fdc74e231672e4075bc823cbc6af2db82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/fc/0e/c2/w-new-york-union-square.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d220243-Reviews-W_New_York_Union_Square-New_York_City_New_York.html", "section_title": "W New York - Union Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d220243-r469395928-W_New_York_Union_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Cool Corner Suite at the W!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Cool Corner Suite at the W! - Review of W New York - Union Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-22T02:00:00.000+02:00", "replies_count": 1, "uuid": "d4fb981fdc74e231672e4075bc823cbc6af2db82"}, "author": "lnette17", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d220243-r469395928-W_New_York_Union_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Cool Corner Suite at the W!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This is our 3rd time staying at the W. We are SPG preferred and gold members. The first 2 times we stayed we were upgraded to the Spectacular room and this time, the ABSOLUTELY AMAZING front desk upgraded us to a cool corner suite. Check in was a breeze - the front desk staff is extremely friendly and accommodating - please know, if they CAN, they will. Especially if you are Starwood. We had booked 2 rooms because we were bringing another couple who's was celebrating a birthday. Not only did the front desk upgrade one of our rooms to the cool corner suite, they gave us another upgraded room directly next to the suite so we could all be together and free drink cards because of the birthday! The area around Union Square is great - we were in the mood for sushi and went to Haru (across the street) which never disappointments. Easy access to the subway and the overall Union Square area is really lovely - Lots of great bars and speakeasys and restaurants and vibe.. Highly recommended area of NY. OK, the corner suite was AMAZING. The pictures on the W website of the suite really are on point. As soon as you walk in there is a closet and a mini bar with lots of snacks and drinks (pay as you go) and a great room that easily was large enough to entertain all 4 of us. The bedroom was down a small hallway and open (no door) - The bed (as always) was super comfy and I had a great nights sleep. The bathroom was in the hallway area and was very large with a standard shower, bathtub and nice big vanity with a big mirror. The bedroom was large and we had a great view of Union Square - they had put (from what i gathered) a small stool to stand up on and see over the ledge (since the windows were fairly high) The staff was attentive to our every need in a very timely manner and overall we have 0 negative things to say about this hotel. Another bonus to this hotel is there is a 12pm checkout! We asked for a later one and they had no problem accommodating us -- as stated above, if they can, they will - the front desk staff is really amazing. We will stay there every time we plan on visiting Union Square. The overall atmosphere of the entire hotel is great. contemporary mixed with vintage - The Irvington bar/lounge connected to the hotel was GREAT. the bartenders there are TOP NOTCH and the atmosphere was wonderful. we stopped there before brunch on our way out and were NOT disappointed. We look forward to our next stay!", "external_links": [], "published": "2017-03-22T02:00:00.000+02:00", "crawled": "2017-03-30T22:52:18.360+03:00", "highlightTitle": ""}