{"organizations": [], "uuid": "4c635a64d82b177ed372baefbc746acec6fe56f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/4a/2e/71/pullman-paris-centre.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d207838-Reviews-Pullman_Paris_Centre_Bercy-Paris_Ile_de_France.html", "section_title": "Pullman Paris Centre - Bercy - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207838-r467837511-Pullman_Paris_Centre_Bercy-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Perfect nights sleep", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Perfect nights sleep - Review of Pullman Paris Centre - Bercy, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-16T02:00:00.000+02:00", "replies_count": 1, "uuid": "4c635a64d82b177ed372baefbc746acec6fe56f9"}, "author": "Pro-Travel-Buyer", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d207838-r467837511-Pullman_Paris_Centre_Bercy-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Perfect nights sleep", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I've stayed in the Pullman Bercy twice over the past 12 months, on both occasions for business but this hotel I would also gladly stay for a city break holiday or leisure weekend. Try to book to include the Thursday night as the hotel has a ´afterwork' event open to all guests, there is a DJ and different things, on this occasion a nail bar free for the ladies (and men) , a pop up barbershop to trim your beard, old style shoe shine and a dim sum cart supplying free finger food to accompany the cocktails you can order at the bar.\nLast night I stayed in the Junior suite room, 720 on the 7th floor overlooking the seine river. I enjoyed using the separate work area of the junior suite to catch up on emails before going out to my works evening , leaving my partner to order room service (didn't want to use the great restaurant on her own) . Apparently the burger was very good with side of salad and chips.\nI came back late and experienced a perfect nights sleep in the king size bed, they are just like the sofitel my beds. Rain shower in the large bathroom in the morning , gets you ready for the day.\nBreakfast according to TripAdvisor was voted the best in Europe, it was very good with a large selection of breads, pâtisseries, crêpes, pikelets, cheeses, cold meats, hot food etc, excellent warm service from the waiting staff. They even have a juice extractor to make your own juice, I failed on this task and should have asked for help.\nDefinitely this hotel should be on your top priority lists to book when in Paris, the automatic metro line 14 is 2 mins walk away (stop cours st emilion) so no strikes on this one!!", "external_links": [], "published": "2017-03-16T02:00:00.000+02:00", "crawled": "2017-03-29T20:13:55.389+03:00", "highlightTitle": ""}