{"organizations": [], "uuid": "aa09aa47cef1eca6056a11bdfacc70bcb1c26fad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/05/b3/b1/c3/mercure-paris-cusset.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197472-Reviews-Mercure_Paris_Opera_Louvre-Paris_Ile_de_France.html", "section_title": "Mercure Paris Opera Louvre - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197472-r466729519-Mercure_Paris_Opera_Louvre-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Great location; handicapped room?", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great location; handicapped room? - Review of Mercure Paris Opera Louvre, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "aa09aa47cef1eca6056a11bdfacc70bcb1c26fad"}, "author": "ImaTropicalTraveler", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197472-r466729519-Mercure_Paris_Opera_Louvre-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Great location; handicapped room?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The good: Let me start by saying that the location of this hotel was excellent. A 20 minute walk to the Louvre, another 10 to Notre Dame or Musee d'Orsay. Longer of a walk to the Eiffel Tower, Champs Elysees and Arc de Triomph, but doable. Plenty of restaurants in the area and the metro is right around the corner. Both the room and bath were spotless and much larger than anticipated and the receptionists were pleasant. The mattress, although firm, was not uncomfortable.\nThe not so good: We requested a \"deluxe\" room (queen bed), but what we got was a handicapped accessible room. Sure enough, there was a queen bed, but the room was directly across from the elevator and stairs, so we constantly heard people clomping up and down the stairs day and night. The elevator is slightly bigger than a phone booth, although I have found this to be true in European cities I have visited before. The bathroom, although large, lacked any shelf space other than the tiny area surrounding the sink. No facecloths were provided - only hand a bath towels. No bath amenities other than shampoo and tiny (1\" x 2\") bars of soap. No fan in bathroom and our bathroom outlet did not work. No shower curtain or shower door, so the entire bathroom floor was soaked when taking a shower. Also, the toilet was higher than normal (which confirmed my handicapped room theory). There is no clock in the room whatsoever, and at 20 euros, we passed on breakfast. However, I'll finish by saying that none of these things would keep me from staying here again; I would just be more prepared next time.\nRoom Tip: Request that room not be near the stairs. See more room tips", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-29T14:50:29.658+03:00", "highlightTitle": ""}