{"organizations": [], "uuid": "6932e7de8a5b00738880b3a968193d53c955da50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/0a/ba/72/pullman-paris-tour-eiffel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197985-Reviews-Pullman_Paris_Tour_Eiffel-Paris_Ile_de_France.html", "section_title": "Pullman Paris Tour Eiffel - UPDATED 2017 Hotel Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197985-r469925259-Pullman_Paris_Tour_Eiffel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "No place better!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "No place better! - Review of Pullman Paris Tour Eiffel, Paris, France - TripAdvisor", "spam_score": 0.01, "site_type": "discussions", "published": "2017-03-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "6932e7de8a5b00738880b3a968193d53c955da50"}, "author": "Asha M", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197985-r469925259-Pullman_Paris_Tour_Eiffel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "No place better!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The reviews of this hotel do not do it justice! The location of the hotel is absolutely superb, and if you book a room with a view, even better! We stayed at the pullman paris tour eiffel just before the Euros started in 2016. The view of the eiffel tower was perfect because it was lit up in France colours, and every time they tested the different colours out we got quite a show from our room! The proximity to the eiffel tower, trocadero and other main sites was perfect. We even managed to get in to the David Guetta concert and with the close proximity to our hotel, staying out late was no problem!\nRoom:\nThe room was spacious with great amenities. The wifi worked with no problems! The bed was extremely comfortable. The balcony was a great size and the view like I said, AMAZING!\nBathroom:\nEverything was clean and modern. The water pressure in the shower was amazing and we never ran out of hot water!\nMy only negative about this hotel, and it's a pretty big one. The first night my sister and I arrived via taxi to the hotel, we had just flown in from Rome. Two young indian girls arriving at the hotel with our luggage, and when we walked in the lobby, nobody acknowledged us until eventually one hotel employee came over and asked what we were doing here. I was completely taken by surprise. What were we doing there? We paid good money to stay in the hotel and it was EXTREMELY insulting, and it seemed like they were stereotyping us. I was absolutely not impressed by that. For the duration of the stay I will say that I did not find the staff particularly polite.\nOverall, the hotel is a 10/10, the staff is about a 5/10, definitely needs work.\nRoom Tip: We stayed in room 811 I believe, this review is a little late, but it is worth paying the extra for... See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-24T03:00:00.000+03:00", "crawled": "2017-03-27T11:58:50.718+03:00", "highlightTitle": ""}