{"organizations": [], "uuid": "3cc534a1a1e27575e4f3a01d105dbd3fcff54fe3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/b8/46/6a/exterior-at-royal-garden.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d193123-Reviews-Royal_Garden_Hotel-London_England.html", "section_title": "Royal Garden Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193123-r470807051-Royal_Garden_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "A cash cow", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "A cash cow - Review of Royal Garden Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-28T03:00:00.000+03:00", "replies_count": 1, "uuid": "3cc534a1a1e27575e4f3a01d105dbd3fcff54fe3"}, "author": "Ele931", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193123-r470807051-Royal_Garden_Hotel-London_England.html", "ord_in_thread": 0, "title": "A cash cow", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An overwhelming advantage of this hotel relative to many other properties in London is its location: across the road from Whole Foods, steps from Kensington Gardens, a few minutes walk from High Street Kensington tube station. Two other benefits are friendly and attentive stuff and an amazing Chinese restaurant Min Jiang on the top floor with breathtaking views of Hyde Park and London's skyline behind the park. We dined twice at Min Jiang and both times the food was exquisite, especially dim sum and crab dumplings with bouillon inside. The restaurant was also full of Chinese patrons, which is always a good sign.\nOn the negative side, our executive room was dated and in need of upgrading. The door of the bar fridge was misaligned and required a certain effort to close it. The room was large but the sitting area was not separated from the sleeping area, which would be preferable for families with little kids (executive rooms are advertised as family rooms). Internet connection was sporadic. I had to constantly reconnect/ relogin to access Internet. Finally, the heating system in the rooms is through an air conditioner, meaning that somewhere in the ceiling there is a device that is pushing hot or cold air (depending on what you want) into the room. As a result, if you want to warm up or cool down the room, you will get a steady draft in the room, which exacerbates such condition as sinusitis. Heated floors would be much better. Therefore, my impression was that the owners of the hotel are simply milking the property for its superb location and it would be nice if they could invest some of their profits into the property upgrade.", "external_links": [], "published": "2017-03-28T03:00:00.000+03:00", "crawled": "2017-03-31T16:36:08.537+03:00", "highlightTitle": ""}