{"organizations": [], "uuid": "7aa31a34e98cbe609af3d801d62f3c27597cbbeb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/a3/b0/6c/espace-bien-etre-wellbeing.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d10350792-Reviews-Hotel_Square_Louvois-Paris_Ile_de_France.html", "section_title": "Hotel Square Louvois - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d10350792-r470782892-Hotel_Square_Louvois-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Beautiful Boutique Stay in Paris!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Beautiful Boutique Stay in Paris! - Review of Hotel Square Louvois, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "7aa31a34e98cbe609af3d801d62f3c27597cbbeb"}, "author": "Jason D", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d10350792-r470782892-Hotel_Square_Louvois-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Beautiful Boutique Stay in Paris!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed at Hotel Square Louvois for 4 nights/5 days and is nothing short of 5 star accommodation at this beautiful boutique hotel. The hotel has been open for approx. 9 months, while somethings need a little bit of tweaking and refinement, the overall experience was fantastic!\nRoom: We upgraded to a Deluxe Room on the 2nd floor, fantastic size room with 2 extra large single beds, large couch, mini bar, TV etc... with a huge bathroom with a seperate shower with 3 different water functions (ceiling, side and hand held water functions) and a separate bath tub with a shower in it as well, with a TV in the bathroom too, and heated towel racks. The use of space was very welcoming, lots of storage space, massive floor to ceiling windows which open up to look onto the street below, just lovely to soak up the Parisian life down below. The room was lovely, fresh, clean, lots of light. Bed was very comfortable, like you were sleeping on air, pillows great.\nHotel: Downstairs / foyer has a lounge to relax in, tables, etc... We had the buffet breakfast included which was delicious, lots to choose from with different breads, cereals, muesli, yoghurt and cold meets, hot eggs, bacon, sausages, and cheeses, sweets, fruits, juice, coffee, you name it. The staff in the hotel were absolutely lovely, special thanks to Ksenija for helping us with a lot of things during our stay and so nice to have a chat with. There isn't a bar at the hotel, just the lounge where food is served, however they are working on a bar area we were told. There was also a complimentary afternoon tea and drinks from 4-6 which was nice as well. On the basement level was a pool and wellness area. This was by far, one of the best pools / areas I've been to for a boutique hotel, just look at the photos!\nLocation: Located in the 2nd arrondissement, which is central to everything, walking distance to cafes and restaurants, bars, shopping, safe neighbourhood, metro only 10 minute walk away as well.\nIf you're looking for 5 star luxury and service I highly recommend Hotel Square Louvois. It is a fantastic boutique hotel and I'm sure once the bar comes into the hotel it will make the atmosphere energetic there! Thanks again!\nRoom Tip: Upgrade to a room with a street view See more room tips See all photos", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-28T03:00:00.000+03:00", "crawled": "2017-03-31T04:42:01.255+03:00", "highlightTitle": ""}