{"organizations": [], "uuid": "56fd24ef90a6c8cca602e2637da96e002b687ecb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/bd/4b/46/guest-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93516-Reviews-or30-Novotel_New_York_Times_Square-New_York_City_New_York.html", "section_title": "Novotel New York Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93516-r464376337-Novotel_New_York_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Second visit, still amazing!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Second visit, still amazing! - Review of Novotel New York Times Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "56fd24ef90a6c8cca602e2637da96e002b687ecb"}, "author": "Krugsy", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93516-r464376337-Novotel_New_York_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Second visit, still amazing!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This is the second time that I've stayed at Novotel Times Square, and this visit was just as good as the first,\nWe booked a high floor Times Square view room and it was worth every penny for the spectacular view of one of the most famous locations in the world. The entire hotel felt clean (with the lobby even having a faint smell of perfume) and this was exemplified in the room we stayed in which was pristine and kept well maintained by housekeeping throughout our stay.\nThe room itself was a bit on the smaller side, but this is a common issue among NYC hotels, but it still felt big enough to be comfortable. Like last time, the bed was extremely comfortable.\nEveryone we met from the front-desk to the housekeeping were friendly and polite, and tried accommodating our every need. Another bonus was that the front desk made sure we were aware of all charges and didn't try to hide anything - unlike some other places we stayed at,\nLocation is key here and you can't get much better than Novotel. It's only a couple minutes walking distance to all the main attractions of the theater district and there is a subway stop basically across the road. Nowhere in NYC is too inconvenient to get to from here. Uber and Taxi's are also easy to get here as the street out front is relatively quiet meaning no awkward moments of holding up busy traffic. The hotel also offers hotel transportation if you speak to the concierge,\nAs a side note, our last day there was during a major snow storm and the staff at the front desk did a great job keeping us informed on what was happening with transport and the airlines. They also made sure we understood that there was a place to stay if our flights were delayed.\nOnce again, my stay was fantastic and I have no reservations recommending this place to anyone,", "external_links": [], "published": "2017-03-03T02:00:00.000+02:00", "crawled": "2017-03-29T14:10:36.986+03:00", "highlightTitle": ""}