{"organizations": [], "uuid": "2ac7ff91a0ae809ce8b145a00bb8f2b5690fe4d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/f7/ca/e4/suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d305850-Reviews-Hotel_de_Sers-Paris_Ile_de_France.html", "section_title": "Hotel de Sers - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d305850-r463747613-Hotel_de_Sers-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "WHAT A FANTASTIC HOTEL!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "WHAT A FANTASTIC HOTEL! - Review of Hotel de Sers, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-01T02:00:00.000+02:00", "replies_count": 0, "uuid": "2ac7ff91a0ae809ce8b145a00bb8f2b5690fe4d2"}, "author": "Beachy1997", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d305850-r463747613-Hotel_de_Sers-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "WHAT A FANTASTIC HOTEL!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We have just returned from a weekend at this wonderful hotel. We cannot fault the hotel in any way. As for the previous comments regarding the size of the rooms, we have to say that having booked a Deluxe Room we were not disappointed in any way. The room was easily large enough, beautifully decorated with large double doors leading to a luxurious bathroom with a separate shower cubicle, separate WC and a roll top bath with french windows (toiletries replenished every day). We had a really nice bar in the room (not the \"usual\" minibar fridge) with everything you could need. Our bedroom area had french windows leading onto a balcony from which we had a partial view of the Eiffel Tower - what more could you ask? As we had previously advised them it was our Wedding Anniversary, when we arrived they had left rose petals in the shape of a heart on our bed! What a lovely welcome. We cannot begin to tell you how lovely the staff are - they are totally professional without being \"stuffy\" and were there for everything you could possibly want (and always with a huge smile). The breakfast was included in our rate (Continental) and this was more than enough (fruit juice, fruit salad, yoghurt, pastries, bread, jams, coffee, tea) and all served by a waiter rather than a buffet, which seems to be the norm these days in lots of other hotels. If you want more, there are lots of other choices for breakfast for an additional cost, although we never found it necessary to order extra! The hotel itself is beautifully decorated with a perfect combination of traditional/modern and is immaculately clean. The bar area has a couple of lounges which are very comfortable with sofas etc. and a good bar service. Housekeeping was extremely efficient - we went to breakfast at 9 and by the time we got back at 10 the room was already cleaned and finished! We have been to 5 star hotels where the room isn't cleaned until about 2pm sometimes! On the occasions we needed a taxi, it was called for us and was there in no more than 5 minutes and usually sooner. We were then directed to the taxi by the lovely doorman who also gave the details of where we wanted to go (for us non-French speaking guests!) to the driver. We cannot fault this hotel in any way and we will definitely go back - there is no way we would stay anywhere else!\nWe cannot comment on dinner at the hotel because, unfortunately, we did not have enough time to experience it.\nThis, in our opinion, is a truly 5* Boutique Hotel in a great position for the Champs Elyses/Arc de Triomphe (5 min. walk), Eiffel Tower (10-15 min. walk) and so close to the Metro for all other sightseeing.\nWe cannot single out any particular member of staff for praise because in our opinion, every single staff member we encountered was top class! Thank you for a magical stay in Paris and we will return!\nRoom Tip: Some Deluxe Rooms have Eiffel Tower views/partial views - just ask and IF they can help you, they wi... See more room tips", "external_links": [], "published": "2017-03-01T02:00:00.000+02:00", "crawled": "2017-03-30T22:27:50.365+03:00", "highlightTitle": ""}