{"organizations": [], "uuid": "532931de3d7c0dce8c4a1af35234dad82dceaaea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/7d/02/28/guest-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d260834-Reviews-Hotel_Saint_Jacques-Paris_Ile_de_France.html", "section_title": "Hotel Saint-Jacques - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d260834-r470454001-Hotel_Saint_Jacques-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Nice little hotel in a great location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Nice little hotel in a great location - Review of Hotel Saint-Jacques, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "532931de3d7c0dce8c4a1af35234dad82dceaaea"}, "author": "tony2k1w", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d260834-r470454001-Hotel_Saint_Jacques-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Nice little hotel in a great location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We stayed here on a quick get away for a few days during the kid's Thanksgiving break from school. Everything about the hotel was pleasant and in order. We rented three rooms on the top floor and had the whole floor pretty much to ourselves.\nWe very much liked the location since it is just a few blocks to the river and attractions there, but the hotel itself sits in a very non touristy neighborhood. That was nice because we mostly ate at local restaurants near by, which is always so much nicer of an experience than tourist restaurants. Also there is a market area about a block away down Rue des Ecoles at Place Paul Langevin. That served as a good place to grab a quick breakfast and buy some pastries to eat while exploring the city. There were also a couple of street venders making crepes in that same area, which was a pretty big hit with our youngest. Speaking of younger kids, it requires a lot of walking to see Paris, which is really pleasant until the kids tire out. A trick we have used several times in European cities is to make a scavenger hunt for the kids where they got a certain number of points for each sight/attraction they see. At the end of the trip, the greater the points, the bigger the prize. Nothing like good ol' greed to keep the kids wanting to see one more thing so as to earn more points. In Paris we also awarded points for simple things such as seeing a gargoyle on a building, seeing a dog in a restaurant, a man with a beret, someone carrying a baguette, etc.\nAnyway, the staff at the hotel was very helpful, and accommodating to let us leave our luggage there for a few hours after checking out and the housekeeping was good.\nIf you feel like taking a walk at night, the area just uphill from the hotel toward the Pantheon is quaint and non touristy.", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-31T02:28:25.743+03:00", "highlightTitle": ""}