{"organizations": [], "uuid": "04e88c1f4ddf6e37d86f2c06a83272d6a1ec97c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/7b/93/78/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d224224-Reviews-The_Ritz_Carlton_New_York_Central_Park-New_York_City_New_York.html", "section_title": "The Ritz-Carlton New York, Central Park - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d224224-r471383654-The_Ritz_Carlton_New_York_Central_Park-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Springtime on Central Park", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Springtime on Central Park - Review of The Ritz-Carlton New York, Central Park, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "04e88c1f4ddf6e37d86f2c06a83272d6a1ec97c0"}, "author": "JimWPPA", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d224224-r471383654-The_Ritz_Carlton_New_York_Central_Park-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Springtime on Central Park", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An extended stay (4 nights) for the NCAA East Regional Men Basketball Tournament. I have stayed in many Ritz Carlton's (Aruba, New Orleans, NYC - Battery Park, Philadelphia, Atlanta, Washington DC, Toronto). This was my first trip to NYC - Central Park. This was Reward Travel as well, we were upgraded to a Deluxe Room, with Park view for a small fee on top of the Ritz Carlton reward points. Even though the room was not booked with American Express Reward Points, we were extended a few of the Centurion benefits as if it were.\nI was traveling with my sons 7 & 9. It was a basketball weekend in the city.\nService, as always, was exemplary, but even more so at this location. I was greeted by name at check in, my children were greeted and introduced to several members of the staff, each of these staff members remembered their names throughout the stay. The children were given plush horses as a gift and invited to some Ritz Kids events that they passed on, excepting the feeding of the horses at noon. My youngest really enjoyed that every day of our stay.\nOur room was very nice, clean and comfortable. The mechanics on the windows did not operate properly and engineering came up to assist, and got them closed tight, but advised against operating them as the mechanics were stripped. Some of the upholstery on the chairs and stools were worn. The desk was perplexing as there were no receptacles for laptops, chargers or anything easily accessible.\nFREE (with Marriott elite status) WiFi was very fast. It was quite pricey $20 a day, if you had to pay for it though. I had to use the business center to print some show tickets, I found the need to use a credit card and the ridiculous $3 fee to use the internet in the business center a bit disparaging, but everything there worked perfectly.\nThe bathroom, was elegant, and my only issue was with the makeup mirror, the light did not work. I needed it to put in my contacts, not a big deal, but it should work. The kids loved the deep soaking tub and the shower that provided great pressure. Extra towels and toiletries were made available daily just as we requested. Ice was also provided daily for a cooler we had brought, for kid stuff.\nWe ate breakfast in the restaurant Auden, the breakfast was very pricey and just ok. Pancakes were served cold, eggs were cold, toast was cold. Bacon was delicious. Total for 1 adult, 2 kids - $100. Service was a bit over the top, but quite friendly.\nThe concierge was knowledgeable and quite helpful on several occasions. Front desk was attentive to our concerns. The bellman and doorman seem a bit perturbed by guests using Uber & Lyft, to arrange transportation, but I have found that the norm in city hotels these days. They were in no way rude about it, just could tell they feel like they are being squeezed out of a job a bit.\nThe Detroit Pistons were in town staying at the hotel, several team members and coaches were very nice to the kids. They seemed to appreciate the accommodations and remarked to me that they enjoy the hotel on their trips to NY.\nAll in all a very nice stay. I wouldn't say the hotel physically, is as nice as some other properties, I would say that you are paying mostly for location here. The staff is top notch though and while some things are a bit dated, service never goes out of style and that is why I stay at Ritz properties.\nRoom Tip: High Floors, with a Park View are worth the $$$ and much quieter See more room tips", "external_links": [], "published": "2017-03-30T03:00:00.000+03:00", "crawled": "2017-03-31T22:32:39.733+03:00", "highlightTitle": ""}