{"organizations": [], "uuid": "e43b7a41811c04c4df6652cbcc52ea7c1b9b2595", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/d2/17/9b/single-small-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1913413-Reviews-The_Jewel_facing_Rockefeller_Center-New_York_City_New_York.html", "section_title": "The Jewel facing Rockefeller Center - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1913413-r467676254-The_Jewel_facing_Rockefeller_Center-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Typically boutique done well.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Typically boutique done well. - Review of The Jewel facing Rockefeller Center, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "e43b7a41811c04c4df6652cbcc52ea7c1b9b2595"}, "author": "hoohoolian", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1913413-r467676254-The_Jewel_facing_Rockefeller_Center-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Typically boutique done well.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boutique: as in you might walk right past it. But also boutique in that the people are very friendly in a personal way. What appeared to me at first to be a pretentiously long name, was actually kind of efficient. “The jewel” being small might not be well-known. But no driver needs to ask where is “The Jewel Facing Rockefeller Center” on 51st?\nThe front desk/entry was basically just a hallway with two high desks. And a couple of small divans. Check-in was quick and I immediately came back down to ask about getting some “New York” local’s food. I got a quick response and directions, but not what I would consider a ‘good’ response considering my background. The next morning I was given and excellent recommendation for bagels, but the person mispronounced the name.\nThe room was small, but the bathroom was larger than a first glance at the room might indicate. The only flaw in the room that I will point out is that the switch for the bed light is4 feet above the bed, requiring enough effort to reach that will wake you up. However, there was a great bedside table that not only has standard American outlets to plug into; there was also a USB port. Every hotel room (and car) should have USB ports.\nThe bathroom (particularly the shower) was large enough to accommodate XXL people, even if they are not fully able physically. This was definitely not the case in my previous night’s hotel in Copenhagen. The towels were of good quality and soft. There were nice soaps and shampoo.\nThe view from the room window was industrial/back-buildings. The décor was warm and modern. The bed was firm but not hard. There is filtered water and screw-top bottles next to the elevator. Nice, that. There was a nice business center I was able to use to repack my bag. The bellman (probably not really a “bellman:) who checked my bag for post-check out pick up and returned it refused my tip. This was a good value for $160.", "external_links": [], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-30T02:30:47.747+03:00", "highlightTitle": ""}