{"organizations": [], "uuid": "d868707a6e0b407fae1a910ebb125076c3c38f08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/75/d4/f1/atrium.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d8615610-Reviews-The_Beekman_A_Thompson_Hotel-New_York_City_New_York.html", "section_title": "The Beekman, A Thompson Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d8615610-r467724137-The_Beekman_A_Thompson_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "The Only Hotel in Which We Will Stay in NYC", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "The Only Hotel in Which We Will Stay in NYC - Review of The Beekman, A Thompson Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-15T02:00:00.000+02:00", "replies_count": 0, "uuid": "d868707a6e0b407fae1a910ebb125076c3c38f08"}, "author": "Gregory R", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d8615610-r467724137-The_Beekman_A_Thompson_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "The Only Hotel in Which We Will Stay in NYC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We (my S.O. And I) recently visited NYC for one of our usual getaway weekends and there are a myriad of places at which we will stay while in town. This time around though, we opted for the Beekman. It was one of the best stays we have ever had in NYC and is now our \"go to\" destination for the foreseeable future.\nThe ambience is an eclectic mix of old world and new, from a time passed by yet with all the creature comforts one could ever need. Embossed leather lines the elevators, along with the headboards, and the entire layout oozes style and decor only dreamt of by other hotels. We opted for a superior King suite, more than sufficient for a couple, and we ended up on the 8th floor. Whether looking down into the bar from the top of the foyer or looking up at One World Trade Center - the view was utterly spectacular.\nThe gem of course was the room itself - a mix of old wooden floors and one of the most comfortable beds we have ever enjoyed. With built in USB ports in the wall, seating, a beautiful armoire and the rest of the amenities (not to mention the sunflower shower surrounded by marble throughout the bathroom), this has to be easily be one of the most comfortable rooms in which I have stayed.\nI travel a lot for business and have had presidential suites at the Mirage, various Marriotts, the Ritz Carton, and many other hotels. Although those suites were \"bigger,\" they pale in comparison to the sheer luxury afforded by the Beekman. If you go here - you must sip cocktails in the bar - it's an experience that harkens back to days gone by when style mattered and surroundings made for an enriching and enlightening experience. Either of the hotel restaurants are superb - we have other places we like in the city as well and are easily accessible with access to NYC subway system. There are a myriad of restaurants and things to do in and around the hotel - you could easily stay downtown without skipping a beat, but the Beacon Theater was a short 20 min train ride on the No. 2 train. If needed a 24-hour pharmacy is on the block.\nLike most hotels in NYC, valet is park it and leave it, so be prepared for using cabs or the subway system. This is the point of being in the city - why drive when trains are quicker - but anything is within reach with access to multiple stations into all the boroughs.\nIt's rare I rave this much about a hotel - in the end it's a place to hang your hat and sleep while visiting somewhere, but this is one of those rare exceptions where the hotel IS the destination. Make it a point to stay at the Beekman and you won't be disappointed. From your first \"welcome\" to the final \"we look forward to your next visit,\" you'll feel at home. And this is our new home from now on when we visit the city.", "external_links": [], "published": "2017-03-15T02:00:00.000+02:00", "crawled": "2017-03-26T22:00:46.054+03:00", "highlightTitle": ""}