{"organizations": [], "uuid": "b108874d3a32d22f54af2756e2eb6a184c7937b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/2b/21/8e/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d497689-Reviews-The_Soho_Hotel-London_England.html", "section_title": "The Soho Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d497689-r470448620-The_Soho_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Love this hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Love this hotel - Review of The Soho Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "b108874d3a32d22f54af2756e2eb6a184c7937b7"}, "author": "singapore_expats", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d497689-r470448620-The_Soho_Hotel-London_England.html", "ord_in_thread": 0, "title": "Love this hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As reported by other reviewers, this is a really lovely hotel. Fantastic - actually outstanding - service from the moment of arrival to the second we sadly left. Nothing was too much trouble and we were made to feel extremely special. I believe this is how they treat all their guests. A beautiful platter of goodies together with champagne was provided on the evening of my husband's birthday. The decor - stunning - warmly contemporary and uniquely Kit Kemp. Our suite was bright and very spacious for London (401). It was located directly opposite the lift and, at first, I was a bit worried it would be noisy. Not so. Totally silent - we never heard a soul. It overlooked the roof terrace of a building next door and we watched a fashion shoot there one afternoon - what a treat! The room was spotless - probably the cleanest hotel room I have ever stayed in. Attention to detail is something that the staff excel at. I was even provided with a heat protection mat for my hair straighteners without having to ask. Bathroom amenities were of very high quality with a lovely lavender and eucalyptus fragrance (suitable for men and women) and replenished generously. Breakfast - plentiful with many special and interesting items. Muesli choices were especially delicious. Cocktail bar is buzzing every night - again, great service and great cocktails. The location is spot on - we walked everywhere and there are multiple tube stations nearby. I could go on and on but suffice it to say, this was a wonderful experience and I wouldn't hesitate to stay here again.", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-28T02:26:29.288+03:00", "highlightTitle": ""}