{"organizations": [], "uuid": "32886c3e906366d46f1baa47fca8f38ee778de7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/02/52/88/59/millwood-inn-suites.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g32715-d80693-Reviews-Millwood_Inn_Suites-Millbrae_California.html", "section_title": "Millwood Inn &amp; Suites - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Millbrae, CA) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g32715-d80693-r465359478-Millwood_Inn_Suites-Millbrae_California.html", "country": "ZA", "domain_rank": 189, "title": "Details Matter", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Details Matter - Review of Millwood Inn & Suites, Millbrae, CA - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-07T02:00:00.000+02:00", "replies_count": 0, "uuid": "32886c3e906366d46f1baa47fca8f38ee778de7b"}, "author": "Galeda", "url": "https://www.tripadvisor.com/ShowUserReviews-g32715-d80693-r465359478-Millwood_Inn_Suites-Millbrae_California.html", "ord_in_thread": 0, "title": "Details Matter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My brother and I had the pleasure of staying at the Millwood Inn and Suites before heading to the airport. From our very first impression we were struck by the lavish attention to detail.\nThe hotel is in a courtyard configuration, and while it sits on a busy street, one never feels rushed or harried. There are glass sound barriers (with etched rose buds) inset into the arches all along the first-floor walkway with curtains draped at each end. The courtyard is paved in cobblestones and lined with potted plants, so the traveller feels as if they have entered a Moorish palace.\nCleanliness is obviously important to the innkeepers. The courtyard and front office were impeccable; our room was incredibly tidy (even the corners in the bathroom had been swept and mopped) and was very well-appointed. We had booked the king-size bed suite so that we would each have a sleeping area, and we both had all the necessary accoutrements. There was a closet, ample seating, electric outlets, TV (with DVD player), and even a thermostat in each room. We had a coffeemaker, fridge, iron and ironing board, and room safe as well; they had truly thought of everything. The quality of the furniture and fixtures was evident in everything from the digital media entertainment center to the pants press (!) to the solid wood door.\nWe felt quite pampered---the towels were luxuriously soft, and both beds (even the sofa bed) were extremely comfortable. It was very quiet (surprisingly so, given the proximity of the street) and we both slept soundly.\nThe breakfast (which is included) was varied and had an abundance of choices: bacon, eggs, sausage, cereals, yogurt, pastries, waffles, fresh fruit, and of course coffee and tea. The breakfast room was sunny and bright with plenty of seating.\nWe found our expectations not only met but exceeded. The Millwood was an oasis of calm which pampered and rejuvenated us, leaving us refreshed and ready for the next leg of our journey.\nRoom Tip: our second-floor king-bed suite was lovely! See more room tips Green Features: they have a recycling bin in every room; they have glass cups instead of disposable ones; and the plates and silverware in the breakfast room are washed rather than thrown away.", "external_links": [], "published": "2017-03-07T02:00:00.000+02:00", "crawled": "2017-03-26T18:32:52.907+03:00", "highlightTitle": ""}