{"organizations": [], "uuid": "9f66b3f62c61e7a505debf2577083e38f32297e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/77/68/be/timhotel-montmartre.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d229623-Reviews-Timhotel_Montmartre-Paris_Ile_de_France.html", "section_title": "Timhotel Montmartre - UPDATED 2017 Hotel Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d229623-r463414908-Timhotel_Montmartre-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Excellent Third Stay", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Excellent Third Stay - Review of Timhotel Montmartre, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-28T02:00:00.000+02:00", "replies_count": 1, "uuid": "9f66b3f62c61e7a505debf2577083e38f32297e7"}, "author": "VincentSR596", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d229623-r463414908-Timhotel_Montmartre-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Excellent Third Stay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A visit to Montmartre fills a continuous desire to big cities and select quaint, historic, yet accessible areas to enjoy. Although costly and crowded, Paris (and France) always offers us something new to enjoy and appreciate. While we love new adventures, we also prefer exploring at our own pace, albeit self-guided literature à la Rick Steves. Staying in Montmartre, at Timhotel, exceeds our expectations and is the perfect hotel for easy-going and moderately budgeted travelers.\nTimhotel isn't a lavish hotel with frills nor is it a discount boutique hotel. It is exactly what they advertise as a three-star establishment. We appreciate amenities commensurate with like-minded three star hotels and customers - WiFi, decent breakfast spread, maid service, access to experiences and sites, and an overall positive and easy lodging stay. Timhotel always exceeds this preference and is why we chose it for our third stay.\nThe only critique I have is in their advertising and room selection. We seem to always land a smaller room than what is depicted in their photos. Even after shelling out extra for their \"Triple Room\", it pales in comparison to the lavish, modern room in the photos. Still, we were happy with our stay and know how better to manage expectations.\nConsider staying at Timhotel Montmartre if you desire a quaint yet reasonably priced stay accessible to the historic parts of Paris and in proximity to many great restaurants and experiences. Although the daytime crowds outside that gather in the courtyard are temporary, you'll hardly notice them when tucked inside this comfortable facility. Enjoy your visit to Montmartre and all the fine, culinary and historic experiences it has to offer.\nRoom Tip: Great views See more room tips", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-02-28T02:00:00.000+02:00", "crawled": "2017-03-28T10:38:40.348+03:00", "highlightTitle": ""}