{"organizations": [], "uuid": "fc55cac64071593a46d8c471b929d2328bb96015", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/8c/5a/c5/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d188961-Reviews-Hotel_41-London_England.html", "section_title": "Hotel 41 - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r470151162-Hotel_41-London_England.html", "country": "US", "domain_rank": 189, "title": "This Place Will Ruin You", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "This Place Will Ruin You - Review of Hotel 41, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "fc55cac64071593a46d8c471b929d2328bb96015"}, "author": "krismcdavid4", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r470151162-Hotel_41-London_England.html", "ord_in_thread": 0, "title": "This Place Will Ruin You", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I booked this hotel because it looked cool in a picture, seriously, it's not the smartest way to book a hotel. I probably did look at its ratings but I didn't put much thought into it. Wow, did I luck out! We arrived 3 hours before check in to a champagne toast in a lounge after we were escorted in by the lobby manager. The Lounge is set up like a library in a beautiful mansion with tables and settees that are set with beautiful linens. It boasts a snack area that is stocked 24x7 with chips, ice cream, beverages, and snacks. At night they provide \"light\" fare but you probably could call it a light dinner and not go out. The morning breakfast is in the same room and all service is impeccable and formal without being stuffy. We came to our room the first night after dinner to find candles and rose petals throughout the room, slippers by the bed, a Quote: of the day and suggestions on what to do in the morning. There was even a lavender spray for the pillow and water on each nightstand. I should have had a clue when the day before my stay they gave me a list of potential items i could request free of charge for my room which included a humidifier, neck pillows, an exercise bike, yoga mat, and more. There is also an espresso machine on the desk, two showers, toothbrushes in the bathroom, a whatever/whenever button on the phone. The owner of this hotel has a mantra she runs her hotels by, \"No request is too large, no detail is too small.\". This is evident in the way every single person treats their guests. Come her, you will never regret it.", "external_links": [], "published": "2017-03-25T03:00:00.000+03:00", "crawled": "2017-03-27T02:38:44.384+03:00", "highlightTitle": ""}