{"organizations": [], "uuid": "61d0a62c9f614d38e8303f3062646c595c74e64f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/ee/b1/70/our-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1595302-Reviews-Club_Quarters_Hotel_World_Trade_Center-New_York_City_New_York.html", "section_title": "Club Quarters Hotel, World Trade Center - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1595302-r467421142-Club_Quarters_Hotel_World_Trade_Center-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "JUDGE made the difference during our stay!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "JUDGE made the difference during our stay! - Review of Club Quarters Hotel, World Trade Center, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "61d0a62c9f614d38e8303f3062646c595c74e64f"}, "author": "hkvenus888", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1595302-r467421142-Club_Quarters_Hotel_World_Trade_Center-New_York_City_New_York.html", "ord_in_thread": 0, "title": "JUDGE made the difference during our stay!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed here with a friend and her daughter a few days ago for a quick holiday in New York. The best part of our stay is the excellent service we received firom the front desk staff who checked us in. His name is JUDGE. Judge was extremely nice and accomodating. He was so sweet and always warm & caring. Judge always have that happy face all the time. I love his charming smile! Surely brightens your day!\nThe great service started when we arrived the hotel at around 10am. Our room was not ready yet so Judge gave us an option of another room available at that time if we would prefer an early check iin but it turned out to be not to our liking. Also, we requested for a room with two double beds for the 3 of us and Judge happily arranged for us to have that. Since our room was not ready yet, Judge asked us to come back around 2pm which we did. When we returned at 2pm,, our suitcases were already sent to our room! This small gesture really touched our hearts! We approached Judge a few more times to ask questions and he was always happy to answer our queries and help us with any of our needs. Truly a lovely person!\nThe hotel is small and basic but with special perks. There is a water dispenser on every floor with empty bootle water containers. Complimentary snacks are provided on the ground floor lounge area of the Club Quarter Hotel side. A restaurant on the top floor has excellent view of the financial district and the freedom tower. Hotel is very close & walking distance to the 9/11 memorial and the Observatory. Area is not so busy but accessible to other attractions in Manhattan.\nWe really enjoyed our short stay. Nothing to complain about. Everything was perfect for the things that we need to do in NY for that 3 nights!\nWill we go back to this hotel? Of course! Especially if we know that Judge will be there to take care of us!", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-29T05:30:45.182+03:00", "highlightTitle": ""}