{"organizations": [], "uuid": "4f3cb090ebe7e26322f9baad50d18eda4eabbd2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/aa/f7/39/hotel-mela-times-square.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d612263-Reviews-Hotel_Mela-New_York_City_New_York.html", "section_title": "Hotel Mela - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d612263-r466548896-Hotel_Mela-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "TINY rooms but 10/10 for location !!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "TINY rooms but 10/10 for location !! - Review of Hotel Mela, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-12T02:00:00.000+02:00", "replies_count": 1, "uuid": "4f3cb090ebe7e26322f9baad50d18eda4eabbd2a"}, "author": "Jo D", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d612263-r466548896-Hotel_Mela-New_York_City_New_York.html", "ord_in_thread": 0, "title": "TINY rooms but 10/10 for location !!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My husband booked a trip to New York to celebrate my birthday and he booked this hotel as it was recommended to him Where to start.... well, if you're looking for spacious rooms, this isn't the hotel for you, the room was exceptionally tiny and we'd upgraded the room so we were a little shocked! We actually checked with reception that this room was the one we'd booked, they said yes but we'll try and move you to a larger room in a couple of days... we didn't bother going back, to be honest you spend so little time in the hotel, it quickly became less of an issue for us!\nThe rooms are basic, very clean with a decent shower and hairdryer, clearly my main concerns! The bed was very comfortable too and we slept really well.\nThe best feature of hotel Mela is the location, you are literally less than a minute from Times Square and the Good Morning America studios are on the corner of West 44th too so first thing in the morning there's lots going on, it's really a great location, we were thrilled!\nWe were at the back of the hotel, bit disappointed with this when we arrived but it was super quiet so this aided a restful sleep which was definitely needed after long days of sightseeing!\nThere's no restaurant on site here but there are plenty of places to eat on the doorstep and you can order breakfast to your room if you'd like, we tended to have a coffee in our room then grab some food on the hop.\nYour room has a great charging deck for your phone, this is great as it charges your phone fast.\nOverall, we really enjoyed our stay here. Prepare yourself for how small this hotel is, but location is everything in this city and for that alone it's worth the 4 rating I've given it. If the wifi was any good I'd have given this hotel a full rating but it's atrocious, waste of time.", "external_links": [], "published": "2017-03-12T02:00:00.000+02:00", "crawled": "2017-03-30T17:14:01.696+03:00", "highlightTitle": ""}