{"organizations": [], "uuid": "bab176bde7b91c7490aeb7b32db7d5269646dbf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/0d/13/6c/hotel-exterior-at-night.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1456560-Reviews-or20-Kimpton_Hotel_Eventi-New_York_City_New_York.html", "section_title": "Kimpton Hotel Eventi - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1456560-r464892354-Kimpton_Hotel_Eventi-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Fantastic building, spotty service...", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Fantastic building, spotty service... - Review of Kimpton Hotel Eventi, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 1, "uuid": "bab176bde7b91c7490aeb7b32db7d5269646dbf1"}, "author": "Shadow5820", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1456560-r464892354-Kimpton_Hotel_Eventi-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Fantastic building, spotty service...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Recently stayed at this Kimpton for a long overdue getaway. A very nice property indeed. The rooms are spacious (for NYC) and the views from the building are impressive. Bed was luxuriously comfy and the rain shower bath was sweet. For comfort and appearance, the Kimpton should earn five stars.\nUnfortunately, this hotel falls short of the same five stars for service. The place was staffed entirely by hipsters. And all of them were too \"interesting\" to be hotel employees. As such, many of them couldn't be bothered to see their roles through to an appreciable degree of closure.\nAs an example, I tried to check-in early. No rooms were available at the time, however. (Not a problem in and of itself) When I asked if they could call/text me when my room was ready, they scornfully told me that they \"don't do that\" and that I'd need to check back at periodic intervals.\nTo kill time, I figured I'd cool my heels in the hotel bar. Despite not being very busy, it took 6 minutes for a waiter to come greet me at my table and an additional 5 minutes for him to bring me the beer that I watched sit on the bar for 4 minutes. The timing here really wasn't the issue, what I found frustrating was that the bar was plainly awash in employees. There was just no reason for them to be so inattentive (save for the fact that they were too busy; engaged in their own private conversations with one another).\nTo their credit, the employees were all polite and ingratiating (when they engaged me). The problem was that far too often they were preoccupied in some other personal interest and failed to provide consistent, attentive service.\nLong story short, this hotel will do far better for itself if it installs a few \"grown ups\" to supervise its otherwise immature service team.\nToo bad, really, it's a nice looking place. But a frustrating stay...", "external_links": [], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-29T03:45:54.932+03:00", "highlightTitle": ""}