{"organizations": [], "uuid": "eb8dd366f8c9e7a762be745deabe2972fec72d1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/09/2a/33/41/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d3683180-Reviews-Hotel_De_Nell-Paris_Ile_de_France.html", "section_title": "Hotel De Nell - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d3683180-r468122186-Hotel_De_Nell-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "The Belle(s) of Paris", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "The Belle(s) of Paris - Review of Hotel De Nell, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-17T02:00:00.000+02:00", "replies_count": 1, "uuid": "eb8dd366f8c9e7a762be745deabe2972fec72d1b"}, "author": "Emmaannaatkinson", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d3683180-r468122186-Hotel_De_Nell-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "The Belle(s) of Paris", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "My second work trip to this very modern example of a Paris Hotel. Almost exactly a year apart, although sadly this time our 5 strong party weren't fortunate enough to get upgrades to the quite incredible superior rooms that we all luxuriated in this time last year. Still; the standard rooms are twice the size of anything traditional you would normally get in Paris and the beautiful balconies open onto a view of a stunning church with the most delightful bells imaginable. The hotel itself is the absolute definition of understated style. Never ostentatious or showy just clever and ultimately feels really special. There is no tiny detail that has been overlooked.\nA huge mention has to go to the Tom Ford level stylish / groomed to perfection guys that are front of house. These boys all have the most utterly perfect manners that would put Kingsman to shame ( random movie reference) and their service is impeccable.\nHowever on the downside - I have a real bug bear with the uncomfortably pompous attitude of the restaurant. I understand that it is a destination eatery in its own right but for goodness sake it's got to be crucial to look after your paying guests. A simple easy healthy breakfast without an uncalled for side of scorn and distain would be much appreciated. I am here to work not to play and I appreciate business like service without attitude.\nMost importantly the amazingly beautiful designer bathrooms are gorgeous but no good to man or beast if the hot and cold control has no point between polar vortex or scorching every single inch of skin off the body. It took me 45 mins of wasted time every morning to find a safe temperature to step into.", "external_links": [], "published": "2017-03-17T02:00:00.000+02:00", "crawled": "2017-03-28T21:00:49.720+03:00", "highlightTitle": ""}