{"organizations": [], "uuid": "0502430f174fafc50a385664e0ba094adac8c49f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/de/97/ad/entrance.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d203086-Reviews-Hotel_Morgana-Rome_Lazio.html", "section_title": "Hotel Morgana - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d203086-r467886989-Hotel_Morgana-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Perfect base for city break", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Perfect base for city break - Review of Hotel Morgana, Rome, Italy - TripAdvisor", "spam_score": 0.001, "site_type": "discussions", "published": "2017-03-16T02:00:00.000+02:00", "replies_count": 0, "uuid": "0502430f174fafc50a385664e0ba094adac8c49f"}, "author": "helbeluk", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d203086-r467886989-Hotel_Morgana-Rome_Lazio.html", "ord_in_thread": 0, "title": "Perfect base for city break", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Booked the Morgana as part of a British Airways holiday. Chose it because of location near Termini station for straightforward train transfer to airport and ease of getting to centre/Vatican by metro or bus. On checkout we left the hotel at 08:55 and made the 09:05 Leonardo Express with time to spare - amazing! But it turned out to be a lot better than just a convenient lodging. Room was spacious and quiet (ours didn't look on to street), with a lovely large bed, decent sized bathroom, big fluffy towels and a travel cot for our 10-month-old. There was a TV but we didn't use it. Plus a secure safe and an empty fridge - perfect for storing baby milk and food! Buffet breakfast was plentiful if a little unexciting and offered at leisurable hours (until 10.30 or even 11.00 on Sundays), plus they had high chairs. Staff were friendly and helpful and room was always cleaned when we were out after 11am - no maids barging in unannounced in the mornings like in some hotels. Trattoria Giovanni opposite is delightfully authentic for an evening meal - full of Italians, not tourists!\nOnly three 'negatives' - 1) the area around Termini is not the most salubrious so beware pickpockets and take main streets at night ; 2) the hotel is a converted townhouse and not designed with accessibility in mind. The two lifts are tiny - we could just about fit the pushchair in one. So if you are a wheelchair user, do enquire before booking how you can be accommodated - perhaps they have ground floor rooms? 3) Be aware of the city tax payable at checkout - it is 5€ per day per person but the hotel charges 6€ and only take cash (yes, go figure!) so make sure you have enough cash on your last day. For two adults staying 3 nights (4 days) that's nearly 48€ so not cheap. But these are fairly minor things, all in all I would thoroughly recommend this hotel.", "external_links": [], "published": "2017-03-16T02:00:00.000+02:00", "crawled": "2017-03-29T14:27:40.194+03:00", "highlightTitle": ""}