{"organizations": [], "uuid": "064e857437380498a9806564caac12742640bca6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/d5/45/47/guest-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d197455-Reviews-or10-Le_Dokhan_s_a_Tribute_Portfolio_Hotel-Paris_Ile_de_France.html", "section_title": "Le Dokhan’s, a Tribute Portfolio Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197455-r462874472-Le_Dokhan_s_a_Tribute_Portfolio_Hotel-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Beautiful Boutique, good sleep and very helpful", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Beautiful Boutique, good sleep and very helpful - Review of Le Dokhan’s, a Tribute Portfolio Hotel, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-26T02:00:00.000+02:00", "replies_count": 1, "uuid": "064e857437380498a9806564caac12742640bca6"}, "author": "Peter R", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d197455-r462874472-Le_Dokhan_s_a_Tribute_Portfolio_Hotel-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Beautiful Boutique, good sleep and very helpful", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Top line is great nights sleep, nicely furnished rooms, although a bit small, very helpful staff.\nMy wife and I visited mid January to celebrate my 67th birthday and picked this hotel combined with a great Eurostar offer. Our visit to the hotel was made great by the very helpful staff - especially Charles on reception for whom nothing was too much trouble. My wife is coeliac but he made sure that the hotel had gluten free goods available for breakfast and in case we came in for lunch. He also researched the best recommended gluten free bakeries in Paris and showed us where they were.\nThis is an old but beautifully kept hotel with a warm welcoming lounge, a dining room which transforms into a well known champagne bar in the evening and rooms which going on ours had immaculate housekeeping.\nThis kept it looking great with the most comfortable bed we have slept in for a long time. The room was a little small and its biggest drawback was storage space. However, we only stayed for a long weekend so this wasn't an insurmountable problem.\nThe management saw from our registration that it was my birthday that weekend and gave us free champagne which enticed us into the champagne bar. The hotel offered a very good breakfast and a snack lunch only. Although a very limited lunch menu the staff tried very hard to accommodate my coeliac wife but in practice whilst the staff were lovely for meals other than breakfast we looked elsewhere like the wonderful Victor restaurant nearby.\nThe hotel is located near Trocadero and the Eiffel Tower and with a 20 min walk we were able to get to Champs Elysee, via the wonderful Hugo patisserie on the Victor Hugo, and the Bateaux tours along the Seine. The hotel has a number of nearby restaurants and bars of all types but if you just want some peace and quiet a nice roaring log fire in the lounge fit the bill on a cold January day.\nWe would certainly visit again to experience the care Le Dokhan's showed to two visitors to Paris.", "external_links": [], "published": "2017-02-26T02:00:00.000+02:00", "crawled": "2017-03-28T20:29:58.314+03:00", "highlightTitle": ""}