{"organizations": [], "uuid": "1407021ae907af8cc4d1d33299607ba54a82a19b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/9a/82/88/barocco-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d203175-Reviews-Barocco_Hotel-Rome_Lazio.html", "section_title": "Barocco Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d203175-r470326931-Barocco_Hotel-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Great hotel. Central and beautiful.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great hotel. Central and beautiful. - Review of Barocco Hotel, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "1407021ae907af8cc4d1d33299607ba54a82a19b"}, "author": "Clare F", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d203175-r470326931-Barocco_Hotel-Rome_Lazio.html", "ord_in_thread": 0, "title": "Great hotel. Central and beautiful.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The hotel was lovely inside. Was on a side road, off the square, so a bit nervous when we didn't find it straight away. Should have a sign on the main road (I may have just missed the sign).\nThe decor was stunning and it was a lovely small boutique hotel. Reception was very helpful and gave us a map! Really lovely staff - all of them. Very polite and friendly.\nRoom was beautiful. Slightly smaller than I expected but I may have chosen a standard room by mistake. The bed was the most comfortable bed I have ever slept in! Seriously - the mattress was memory foam I think - and I am totally going to one for myself now! Bathroom was also lovely and a really powerful shower.\nHouse keeping was excellent and pristine.\nBreakfast was amazing! So much food - lots of cheese and meats, breads. You can order eggs but I didn't bother. The green apple juice is AMAZING. Also they make lovely coffees. High standards.\nI had no problems with this hotel. I did consider asking to move rooms - because it was quite noisy (Room 46) at night. We were above a bottle bin and refuse bins, so when they were cleaning up in the coffee shops down on the main street it was very noisy/ There was a particular noisy side street to be honest. But think that was just the bit we were in. The hotel in itself is not near clubs or anything so not noisy very late at night.\nLocation is amazing. Quality hotel - deserving of 4 stars and in central safe location. Walking in minutes to Spanish steps and shopping centres, and the Trevi fountain. Right next a metro to take you around the city but we walked everywhere. Local restaurants and bars. The coffee shop right underneath was a bit expensive and we ended up paying 10euro for 2 tiny coffees but lots of others to choose from.\nHighly recommended.", "external_links": [], "published": "2017-03-26T03:00:00.000+03:00", "crawled": "2017-03-28T03:35:10.167+03:00", "highlightTitle": ""}