{"organizations": [], "uuid": "5e4fe79083cec97dca15236380c2cfde37b1c9a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/8a/f0/71/lobby-main.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99766-Reviews-or40-The_Roosevelt_Hotel-New_York_City_New_York.html", "section_title": "The Roosevelt Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r467886266-The_Roosevelt_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Excellent location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Excellent location - Review of The Roosevelt Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-16T02:00:00.000+02:00", "replies_count": 0, "uuid": "5e4fe79083cec97dca15236380c2cfde37b1c9a5"}, "author": "Zanna H", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r467886266-The_Roosevelt_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Excellent location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed at The Roosevelt last week with my mom. Overall, it's a nice hotel in an excellent location. The lobby and bar are both very impressive and inviting, and the spa, gift shop (more of a convenience store), and stores downstairs are a nice bonus. We didn't eat at the restaurant, so I can't say anything about the food, but I flipped through the room service menu and thought the selection seemed good, and the prices were high but not outrageous for New York standards. Echoing what other reviewers have said- you'll probably have to wait for the elevators. One morning our elevator inexplicably stopped on every single floor going down from the 15th even though no buttons were pushed (I saw workers repairing it the next day), but most of the time the wait was no big deal- it just takes time for it to get to your floor. The room itself was nice and clean, it was small but there was plenty of room for my mom and I to share and the closet was very spacious for a hotel closet. Yes, it's an old hotel, and you can see where the multiple layers of paint are chipping off of the woodwork, but it adds charm. I think the addition of an extra or larger table in the room would be nice, as well as an extra shelf or two in the bathroom (the toilet tank is sloped, so you can't rest your toiletries there while you're getting ready, there is no counter around the sink, and the existing shelf is super tiny) and the decor could use a bit up an update (I would much rather see all of the original details of the building- it looked like there were transom windows that were being covered by boards). Our Wifi was included with the package that we booked, and i'm glad it was free because it didn't work all the time- in the morning it was ok but at night it constantly dropped out. The front desk was very accommodating to our request for a coffee maker in the room, and brought it up within minutes of us checking in. The housekeeping staff was super friendly- every morning they asked how we were and if we needed anything. The concierge was hit or miss- when we were checking in we asked them where the front desk was (its tucked around the corner and we had been traveling for 14 hours so we didn't notice it) the two staff members were looking at photos on each others phones and asked us to hold on a minute until they finished before they could help us. The other time that we used the concierge, it was great and the man working there was very helpful, so I guess it just depends on who is working. The location of the hotel is very convenient- within walking distance of Grand Central, Rockefeller Center, Times Square, and lots of great restaurants and stores. We had a great experience staying at The Roosevelt and I look forward to staying here again.", "external_links": [], "published": "2017-03-16T02:00:00.000+02:00", "crawled": "2017-03-31T18:40:24.263+03:00", "highlightTitle": ""}