{"organizations": [], "uuid": "d338ec49cec4436ba0c4b4b45c70481c73c61073", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/c0/2c/b7/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d299851-Reviews-or5-Novotel_Xinqiao_Beijing-Beijing.html", "section_title": "Novotel Xinqiao Beijing - UPDATED 2017 Hotel Reviews &amp; Price Comparison (China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d299851-r469087100-Novotel_Xinqiao_Beijing-Beijing.html", "country": "US", "domain_rank": 189, "title": "Great Location, Good Hotel", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Great Location, Good Hotel - Review of Novotel Xinqiao Beijing, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 1, "uuid": "d338ec49cec4436ba0c4b4b45c70481c73c61073"}, "author": "KSOFCAL", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d299851-r469087100-Novotel_Xinqiao_Beijing-Beijing.html", "ord_in_thread": 0, "title": "Great Location, Good Hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed at the Novatel Xinqiao Beijing at the start of our China trip for 3 nights. The room was clean, adequate size (we also had a rollaway bed for 13 year old), with nice amenities. There is a safe in the room as well. The only negative was that the room had a strong smoke smell. While we requested a non-smoking room, it was clear that at some point it had been a smoking room. We were too tired to change rooms and were gone for most of the days so it wasn't that huge of a problem. Had we been spending more time in the room, I would have changed. The window did open a small bit and that helped. The beds were comfortable enough (more on the firm side if you like firm). Even though we faced the street side and with the window open, it was quiet. For a large city, I was surprised how quiet the streets were at night (compared to NYC). The location is right at a subway stop (subway is very easy to use) and there are numerous restaurants and shops within close walking distance. The breakfast buffet had more than enough choices to please all international and local tastes. The restaurant for the breakfast buffet (which was included in our room rate) was large and spacious enough to handle a good size crowd. We did try a different restaurant one night on the 4th floor for Peking Duck. The duck was good but the service was terrible. We waited a very long time for anyone to even come over to our table. There were several people running around - several with 'trainee' on their name badges. Unfortunately, there was not anyone that spoke good enough English to assist us and it was very frustrating trying to ask questions and get information about the food. While I understand that we are in a foreign country with a different language, I would think that a hotel catering to international travelers would at least have someone that had adequate enough English to assist. This wasn't an isolated case with just this hotel, there really aren't that many English speakers at most places in China. We got through it however and did enjoy our 1/2 duck. There was free wifi in the hotel and it worked great. I also used a VPN to access Facebook and Google which China blocks. Overall, we enjoyed our stay at the hotel and would return in the future.", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-28T04:48:39.650+03:00", "highlightTitle": ""}