{"organizations": [], "uuid": "92f54b3b6d46430b5b05e29fb07e2a5e2fb186a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/8c/5a/c5/lobby.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d188961-Reviews-Hotel_41-London_England.html", "section_title": "Hotel 41 - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r466368993-Hotel_41-London_England.html", "country": "US", "domain_rank": 189, "title": "By Far the Best Boutique Experience in the World!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "By Far the Best Boutique Experience in the World! - Review of Hotel 41, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-11T02:00:00.000+02:00", "replies_count": 0, "uuid": "92f54b3b6d46430b5b05e29fb07e2a5e2fb186a3"}, "author": "TexasWorldtraveler", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d188961-r466368993-Hotel_41-London_England.html", "ord_in_thread": 0, "title": "By Far the Best Boutique Experience in the World!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you are looking for out of this world personalized service, it does not get better than this. My husband and I travel all over the world for work and pleasure. We decided on Hotel 41 for a personal trip to London over Spring Break after reading excellent Trip Advisor reviews. The reviews don't even come close to how magnificent this place is. Before we arrived in London, the hotel sent us a special list of \"wish\" items to fill out so that they could properly prepare our room for our arrival. No detail is too small. We alerted them that our 11 year old daughter was coming with us on the trip. When we arrived, every member of the staff knew our name and greeted our daughter like a true VIP. We had champagne waiting and ice cream for our daughter. They made up a special bed for her with her own private robe and slippers. This is a very small hotel, so it is not like anything we are used to as we typically stay in large resort-like hotels with many amenities. We arrived to be seated at a personal desk to check in. They have a beautiful lounge where every night one can \"raid the pantry\" for free snacks, can have any drink of choice, and relax by the fireplace. Every member of the staff personally greeted us by name each time and knew what room we were staying in. We never had to ask for anything as our needs were already anticipated, from turn down service to breakfast, to tea and pastries. We had a plate of fresh fruit in our room each day and each day we were given water and snacks to go on our excursions. Andrew on staff chatted with our daughter about FC Barcelona futbol matches and was helpful with dinner recommendations and directions. The service simply is out of this world. Even at the finest hotels we have not experienced the personalized service we did here. Simply impressive. I didn't mention the room, but it was perfect. We had a two level suite with plenty of privacy and every amenity imagined. I know whenever I'm in London we will stay here. Superb! If you are looking for a very intimate luxury experience, this is definitely it.\nRoom Tip: Definitely ask for the two level jr suite. You will not be disappointed. See more room tips", "external_links": [], "published": "2017-03-11T02:00:00.000+02:00", "crawled": "2017-03-27T02:39:13.069+03:00", "highlightTitle": ""}