{"organizations": [], "uuid": "50bb6675e9615cae1b3bb95c9a8afc32986991ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/7e/96/4d/hotel-manfredi-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d456489-Reviews-Hotel_Manfredi_Suite_in_Rome-Rome_Lazio.html", "section_title": "Hotel Manfredi Suite in Rome - UPDATED 2017 Reviews &amp; Price Comparison (Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d456489-r468997857-Hotel_Manfredi_Suite_in_Rome-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Excellent Experience!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Excellent Experience! - Review of Hotel Manfredi Suite in Rome, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 1, "uuid": "50bb6675e9615cae1b3bb95c9a8afc32986991ba"}, "author": "katewhitton", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d456489-r468997857-Hotel_Manfredi_Suite_in_Rome-Rome_Lazio.html", "ord_in_thread": 0, "title": "Excellent Experience!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed here for three nights by myself after having gone to a business trip in another part of the country. I researched the hotel and emailed them a few times to which they were very cooperative and helpful – I had a lot of questions since I was staying alone and have never been to Rome before. The hotel itself is very nice, it's a boutique hotel but with all the amenities and expectations of a chain hotel – I felt very safe there and the room was very clean and quiet! There was a key card entry into the wing of the area of rooms that I stayed in and there was a receptionist on duty 24 hours. Everyone, day or night, was extremely helpful in making sure that I knew exactly where I was going and ensuring that I had the best experience. Location of the hotel was absolutely terrific – it's in the heart of the Spanish steps but is right around the corner from one of the main roads so it is quiet enough and safe enough to have the best of both worlds. There were markets and plenty of restaurants and shops to go to right in the neighborhood. All of the major attractions were within walking distance, just make sure that you have comfortable shoes! I definitely recommend this hotel, and would absolutely only consider this one to stay in again. The drinks at the hotel bar were a little pricey, but the bartender and the snacks were very good! I'd like to give an extra thanks to the staff for helping me book my tickets to the Vatican and Colosseum! Truly great service, I couldn't of asked for anything more – they've set a very high expectation! If you're looking for great service and location, look no further – this hotel meets every expectation!!", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-28T15:13:11.036+03:00", "highlightTitle": ""}