{"organizations": [], "uuid": "fc61ad91ec47fd745125dc028506d2b98acc3a67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/06/1b/42/king-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g33010-d225821-Reviews-Days_Inn_San_Francisco_International_Airport_West-San_Bruno_California.html", "section_title": "Days Inn San Francisco International Airport West - UPDATED 2017 Hotel Reviews &amp; Price Comparison (San Bruno, CA) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g33010-d225821-r463600942-Days_Inn_San_Francisco_International_Airport_West-San_Bruno_California.html", "country": "US", "domain_rank": 189, "title": "Friendly and near to airport", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Friendly and near to airport - Review of Days Inn San Francisco International Airport West, San Bruno, CA - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-02-28T02:00:00.000+02:00", "replies_count": 0, "uuid": "fc61ad91ec47fd745125dc028506d2b98acc3a67"}, "author": "Trish R", "url": "https://www.tripadvisor.com/ShowUserReviews-g33010-d225821-r463600942-Days_Inn_San_Francisco_International_Airport_West-San_Bruno_California.html", "ord_in_thread": 0, "title": "Friendly and near to airport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Booked this hotel weeks in advance and requested (like I always do) a room away from the front desk or elevators. A week Prior to arrival I call the hotel to remind them of this request and to tell them I have two envelopes being delivered there and to mark it on my reservation and let staff know. I do this often when traveling. At that point I should have know there would have been trouble. The woman on the other end of the phone could barley understand me (English) and thought I wanted to cancel my reservation. After 37 minutes long distance she finally figured it out. I did call again to check and make sure that their was an actual note on the reservation and was told everything was \"very good\". So when we arrived at the hotel....one envelope was missing and our room was the first room after the front desk and elevator!!!! They said the hotel was full and they could not move us. I checked on my tracking # for the 2nd package and it said it had been delivered at the location and even gave me the date and time. I asked them to look for it and they told me all mail goes into a box and its not there. I suggested that perhaps it might have fallen behind the desk, or could they call the person who was working on Tuesday at 1:37pm in the afternoon. They said they would talk to her the next day. I was leaving at 3:30AM so I asked them to call her now....they said NO...Show me the signature. I explained that USPS doesn't make it a habit of showing peoples signatures online. Well without seeing a signature they would not help me. Their protocol is to look for the name on a reservation and then sign for it, so it must be USPS fault. By this time it was 10:00pm and I could see I was not going to get any help from this guy. I then asked for a 3:00am wake up call....that ended up coming in at 3:15am. Also on another note...there was not hot water to shower or take a bath. We were told to wait a bit. I also had to listen to people talking at the front desk until I went out at 12:45am to see two of his taxi driver friends just drinking coffee and talking....they weren't even staying at the hotel. At which point I asked them nicely (honestly) to please keep down a bit. Long story short when I got back to Canada I called USPS and found out that the hotel refused to sign for the envelope and it had been sent back to the shipper. When I called the hotel they offered no apology and just said there was a lack of communication between staff. So much for all my babysitting of the situation and their so called staff protocol.\nAs for the hotel itself....it is close to the airport and I am sure that is the only reason it is making money. Even take away the problem with the shipment and the ignoring my room request and the staff is just plain rude. They had an excuse for every problem. I do realize that this is just one persons experience. The bed was okay and the room was clean...but still no hot water. For me it is the staff that make the experience good or bad and it is the staff that this review is based upon.\nRoom Tip: Call ahead of time to make sure you are getting the price and room you requested or booked on line See more room tips", "external_links": [], "published": "2017-02-28T02:00:00.000+02:00", "crawled": "2017-03-26T16:22:34.099+03:00", "highlightTitle": ""}