{"organizations": [], "uuid": "cefe38d6132e736c026e0b48815503b2e5a8d190", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/04/af/19/7e/the-benjamin.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d217626-Reviews-or10-The_Benjamin-New_York_City_New_York.html", "section_title": "The Benjamin - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d217626-r465039549-The_Benjamin-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Outstanding service", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Outstanding service - Review of The Benjamin, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-06T02:00:00.000+02:00", "replies_count": 1, "uuid": "cefe38d6132e736c026e0b48815503b2e5a8d190"}, "author": "kingdavid192017", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d217626-r465039549-The_Benjamin-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Outstanding service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I'll try and keep this short but it's quite a long story. Last October I was travelling with my wife on a short trip that included Wilmington, Philadelphia and New York. Stupidly I left my glasses and glasses case in the Amtrak lounge in Philadelphia station. They weren't expensive glasses but my daughter had been out of her way to buy me the leather case when she visited Verona in Italy and I had a sentimental attachment to it. I realised what I'd done as soon as I boarded the train. The helpful conductor phoned back to the lounge and said that the case had been found, gave me a number and said that I could retrieve it from 'Lost and Found' in Penn Street station. A couple of days later I went to 'Lost and Found' but the assistant couldn't find them and wasn't a lot of help.\nI'd almost given up the search but on my return to the UK decided to contact The Benjamin to see whether they could help. The very helpful Concierge at the Benjamin, Gina Bianco, not only phoned Philadelphia but also traced the case to Pennn Station and had a tracking number for me.\nThe same daughter who bought me the case was due to visit New York the following month with her students and I asked her to try 'Lost and Found' again. She did this on two occasions but with no success, being told that the tracking number did not tally.\nI e-mailed the amazing Gina Bianca again, told her that my daughter had not been successful in retrieving the glasses, thanked Gina for help and told her that the story was at an end. 'Do not give up hope' came her reply I am going to go to Penn station myself!! This she did and soon had the glasses in her possession.\nThis amazing employee checked where to send them, checked with the ultra generous Benjamin management whether she could send them complimentary and today they have arrived at my home near Manchester UK.\nIt is difficult to find words to describe this outstanding level of service. May I thank again the Benjamin management and, once again, the totally committed Gina Bianco, at the Benjamin Concierge, who went so far beyond the call of duty.", "external_links": [], "published": "2017-03-06T02:00:00.000+02:00", "crawled": "2017-03-29T15:38:01.912+03:00", "highlightTitle": ""}