{"organizations": [], "uuid": "cfc45dbcb6db41634bc36be83632042adb2587ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/01/fc/1a/f0/the-separate-guest-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g293841-d505188-Reviews-Urban_by_CityBlue_Kampala_Uganda-Kampala_Central_Region.html", "section_title": "Urban by CityBlue Kampala, Uganda - UPDATED 2017 Hotel Reviews &amp; Price Comparison - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g293841-d505188-r463679714-Urban_by_CityBlue_Kampala_Uganda-Kampala_Central_Region.html", "country": "US", "domain_rank": 189, "title": "Nice hotel, good food and service", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Nice hotel, good food and service - Review of Urban by CityBlue Kampala, Uganda, Kampala, Uganda - TripAdvisor", "spam_score": 0.058, "site_type": "discussions", "published": "2017-03-01T02:00:00.000+02:00", "replies_count": 0, "uuid": "cfc45dbcb6db41634bc36be83632042adb2587ce"}, "author": "FFF86", "url": "https://www.tripadvisor.com/ShowUserReviews-g293841-d505188-r463679714-Urban_by_CityBlue_Kampala_Uganda-Kampala_Central_Region.html", "ord_in_thread": 0, "title": "Nice hotel, good food and service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I have stayed at this Hotel several nights, first at the club room, and then at the doubleroom. I will give review to the different areas.\n1. Restaurant\nFor breakfast they have better selection of food then other hotels I have stayed in Kampala, but I miss some more choices of order to have on the bread, like ham and cheese etc. But it is very good with the chef making omelette, sausages and bacon. In general Im satisfied with the breakfast. They also have nice fruit. The restaurant menu is good, and the food is tasteful. They also have good service and the food is delivered within reasonable time after order. I usually never eat as much at the hotel restaurant as I did here, which is a feedback in itself.\n2. Hotel:\nThe reception is nice and the staff are friendly. It is good internet connection all over the area. The location is ok, not too far to anything, but it is not very central either. It is a 10 min walk to nearest supermarket. The pool area is nice, but it is a bit \"disturbing\" with the restaurant just in front of you when you lie on the sunbed. Be also aware that it is often arranged birthdays, babyshowers etc with nicely dressed people at this restaurant, which might make you uncomfortable lying at the sunbed or swimming. The Hotel have a big parking lot within the fence if you come by car.\n3. Club Room:\nThese room are really nice and modern. Spacious and what I would call high European standard. The only thing I missed was a possibility to take the flatscreen closer to the bed and an HDMI cable. The rooms have good waterpreassure, are clean, have a refrigerator, comfortable bed and good internet connection. This is without doubt the best room I had in Uganda.\n4. Doubleroom:\nThey have the same things as the club room, but are less modern, less spacious and look more wearn out. It is to few lamps in the room, so it seems a bit dark, and it lacks electricity contacts. Everything has to be charged by the desk in the room. The AC was not working very well either.\nIn general I am very pleased with my stay at this Hotel, and will probably go here next time i'm in Kampala.", "external_links": [], "published": "2017-03-01T02:00:00.000+02:00", "crawled": "2017-03-27T19:04:24.338+03:00", "highlightTitle": ""}