{"organizations": [], "uuid": "9d9bed1c4b2f3394d27321d37eb01d6393b41c0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/3c/52/d7/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d632551-Reviews-Hilton_Garden_Inn_New_York_Tribeca-New_York_City_New_York.html", "section_title": "Hilton Garden Inn New York/Tribeca - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d632551-r470992999-Hilton_Garden_Inn_New_York_Tribeca-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "The Getaway", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "The Getaway - Review of Hilton Garden Inn New York/Tribeca, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "9d9bed1c4b2f3394d27321d37eb01d6393b41c0a"}, "author": "crystalcF6026DT", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d632551-r470992999-Hilton_Garden_Inn_New_York_Tribeca-New_York_City_New_York.html", "ord_in_thread": 0, "title": "The Getaway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I'm going to say honestly that this review could have went very badly. When I arrived my friend was already there and apparently one of the staff members had treated him and not a nice fashion. I would hope that this was more a social issue and not a racial issue so that's all I'm going to say about that. Also when I got there my check in time was for 3 p.m. for the penthouse Suites and my room was not ready. And like I stated this could be a nasty and negative review but it will not be because the staff there were absolutely wonderful and very helpful and very kind. Aside from that one staff member everyone else was very professional very courteous and very nice. From the manager who I believe his name was Joe he was wonderful and really considerate and understood the frustrations of not being able to check in to your room until a good 45 minutes later and even offered me a discount towards my bill. He offered me a wonderful discount which I so classy of them Secondly there was I believe his name was Kevin at the front desk. and he was so professional and so kind and so sweet and I appreciate his service also he apologized for the way my guest was treated by the fellow staff member who I will not name because I do not want this to be a negative review on the strength of one person. Lastly I most definitely need to shout out the wonderful and very very pretty Nairobi also at the front desk. She went above and beyond she even gave me breakfast buffet passes because they understood how unfortunate it was for me to be delayed on my check in time. She also help Google direct me to the store when she didn't even have to do that I didn't even expect her to do that but she did just out of the kindness of her heart and I was very very very sweet of her. I hope the Hilton Tribeca knows how wonderful their staff are because like I said this review could have been very negative but because their staff was so professional and so kind and it was so aboveboard that I couldn't possibly write anything negative. But I do want to state to that one staff member who was very negative to my GUEST because maybe he didn't look like he deserved to be a penthouse suite that you cannot judge a book by its cover you don't know who has what and who is doing what with their lives and let that be a lesson to you period. My room was absolutely fabulous I love the penthouse suite with the whirlpool tub. They are one of the only hotels in the city who even off of whirlpool tub and I absolutely loved it I loved the big 50-inch screen TV I love the penthouse was on its own floor I mean who wouldn't love that. The restaurant and the hotel was Lively was very chic it was very popular it was a wonderful spot to relax In. And the continental breakfast was delicious. All in all we had a wonderful time and we will definitely be returning to the hotel", "external_links": [], "published": "2017-03-28T03:00:00.000+03:00", "crawled": "2017-03-30T20:17:33.575+03:00", "highlightTitle": ""}