{"organizations": [], "uuid": "8d0cb7aad1bcae759659f16cf8c64184122e1dab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/e5/6e/f0/hotel-diana.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d567154-Reviews-Hotel_Diana-Paris_Ile_de_France.html", "section_title": "Hotel Diana - UPDATED 2017 Reviews &amp; Price Comparison (Paris, France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d567154-r469230675-Hotel_Diana-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "Outstanding Location, Staff and Value", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Outstanding Location, Staff and Value - Review of Hotel Diana, Paris, France - TripAdvisor", "spam_score": 0.042, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 1, "uuid": "8d0cb7aad1bcae759659f16cf8c64184122e1dab"}, "author": "Rumples", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d567154-r469230675-Hotel_Diana-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "Outstanding Location, Staff and Value", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I usually rent an apartment during my Paris visits but chose a hotel for a recent 7-night stay because of the short lead time before my arrival. The 2-star Hotel Diana, which is family operated, more than met my needs and provided clean and well-maintained lodging. Its superb location within the 5th Arrondissement includes being just a 6-minute walk from the Saint-Michel metro station. After my plane touched down at CDG, I boarded the RER B with my carry-on suitcase for a straight shot to that stop.\nThe warm greeting at hotel reception set the tone for my entire stay. Staff spoke excellent English and could not have been more helpful or pleasant. The hotel owner started to greet me by name on my second day at the hotel.\nMy immaculate small room (61) on the top floor appeared to have been recently remodeled and overlooked the nearby rooftops The scene reminded me of the nightly exploits of Dino (AKA Mr. Cat) in the wonderful animated French film, \"A Cat in Paris.\" The comfortable double bed enabled me to sleep well, despite being next to the elevator, a location I always try to avoid. The simple furniture consisted of two basic tables, two night stands and a chair. A small refrigerator and a kettle were nice pluses.\nA safe sat on the top shelf of a narrow, high closet. I could not reach the safe easily so stored my valuables in a locked suitcase. The TV seemed to have only French channels, but I rarely watch television. Lighting proved to be excellent and the wi-fi fast and reliable. During my stay, the telephone was out of order and the room relied on heating from the bathroom's heater, which was sufficient. The bathroom offered a tub/shower combo with a half-door partition to protect -- not always successfully -- the floor.\nAs a sixth-floor guest, I used the tiny elevator a lot and loved its quirky sounds ... a part of the Paris experience. Though \"talkative,\" the elevator was absolutely reliable.\nI opted for the hotel breakfast (10 E) three mornings during my stay and was amazed by the wide variety of offerings, including granola and cake made by the owner's daughter. There were cereals, juices, cheese, breads, yogurt, fresh fruit and the list goes on. Guests can also choose a hot drink from coffee, tea or hot chocolate. One morning, I paid 1 E extra for a big glass of delicious freshly squeezed orange juice.\nIn addition to the metro and RER close-by, there are also many bus lines in the vicinity. The wonderful Musee National du Moyen Age (Cluny) is a 1-minute walk, and it takes about 8 minutes on foot to the Seine and Notre Dame Cathedral.\nCafes, restaurants and bars abound in the general area. I really like Le Bistro du Perigord, which is right next door and offers good food with reasonably priced menus.\nHotel Diana also offers good value, especially for its location. I paid 93 E per night for a single, getting the rate by paying in full at booking.", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-29T14:43:45.435+03:00", "highlightTitle": ""}