{"organizations": [], "uuid": "a1917e53184433c019f7b70523854e8d43897bcd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/54/3f/35/room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d10319203-Reviews-Rome_Glam_Hotel-Rome_Lazio.html", "section_title": "Rome Glam Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d10319203-r471026513-Rome_Glam_Hotel-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Fantastico!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Fantastico! - Review of Rome Glam Hotel, Rome, Italy - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "a1917e53184433c019f7b70523854e8d43897bcd"}, "author": "_saluk6", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d10319203-r471026513-Rome_Glam_Hotel-Rome_Lazio.html", "ord_in_thread": 0, "title": "Fantastico!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What can I say? This was my first trip to Europe after a decade and first ever visit to Rome, Italy and I was here for 1 week. There are no words to describe this city!\nI chose to stay at this hotel based on some reviews on this site - no issues whatsoever!\nInitially, we were sceptical about taking only one room for the trip as we were a total of four adults - myself, brother, sister and mother, however the rooms are very spacious. The hotel is clean and the overall very impressive. It is centrally located and all attractions are about 10 minutes walk. With a buffet breakfast served on the 5th floor, you have the option to eat inside or outside on the roof terrace overlooking Rome. Access to floors were not an issue either - you have two lifts, which are very quick and readily available.\nThe hotel staff are amazing especially Simona, Alfiero and Mirko. As we arrived Simona checked us in effortlessly and provided a map of all the landmarks and things to do - as well as giving her recommendations to restaurants, she always greeted us with a smile (no matter how many times we asked her for new things to do or restaurants to eat at). Mirko was a pleasure - he moved all the luggage on arrival and departure and even assisted in an iPhone charger adapter. The hotel also provided an Iron!!! WOW.\nMy family and I, loved the city and our stay at this hotel. If I could give it a 6 star rating, I would! Thank you to everyone for making our week in Rome amazing - I will definitely return and stay at this hotel 110%\nRoom Tip: Every floor is amazing!!! See more room tips", "external_links": [], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-30T07:59:41.020+03:00", "highlightTitle": ""}