{"organizations": [], "uuid": "8c7f2c435007e42ab59092ec372a0770f3e38884", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/81/7b/f4/caption.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g294212-d2070236-Reviews-or10-Shichahai_Shadow_Art_Performance_Hotel-Beijing.html", "section_title": "Shichahai Shadow Art Performance Hotel - UPDATED 2017 Reviews &amp; Price Comparison (Beijing, China) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d2070236-r456291365-Shichahai_Shadow_Art_Performance_Hotel-Beijing.html", "country": "US", "domain_rank": 189, "title": "Nice boutique hotel in the hutong district near lake Houhai", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Nice boutique hotel in the hutong district near lake Houhai - Review of Shichahai Shadow Art Performance Hotel, Beijing, China - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-01T02:00:00.000+02:00", "replies_count": 1, "uuid": "8c7f2c435007e42ab59092ec372a0770f3e38884"}, "author": "Whoopie89", "url": "https://www.tripadvisor.com/ShowUserReviews-g294212-d2070236-r456291365-Shichahai_Shadow_Art_Performance_Hotel-Beijing.html", "ord_in_thread": 0, "title": "Nice boutique hotel in the hutong district near lake Houhai", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When we were looking for a hotel quite central in a hutong district of Beijing we found this little boutique hotel which is in walking distance to lake Houhai, the Prince Gong Mansion and the underground station Beihai North. We weren't disappointed! One day we had a lovely walk from there through the Beihai park, visiting the Jade Flower Island before walking to the Forbidden City, another day we were walking to the Bell and the Drum Tower. Along the shore of lake Houhai (known for it's night life) there are a lot of restaurants and bars with live music.\nBut the hotel itself is in a very quiet, relaxing neighbourhoud. Everything is decorated in a tasteful, modern, minimalistic style. Our room (ground floor) was functional and had a huge bathroom. Only little regret: The light-couloured carpeting in the common areas which show some stains (normal ;-)).\nBreakfast was good, with a variety of western and chinese style food. It was not an immense buffet like you'll find in big hotel chains, but for us the choice was really large enough. We also had dumplings for lunch and they were really good. The hotel even offers cooking lessons where you can learn how to do dumplings, but we didn't take it. As the name suggests, the hotel also offers shadow art performances and shadow art painting classes. The show was very nice. The staff was really lovely and always helpful.\nWe booked a day trip at the hotel to go with a private driver to the Great Wall and the Ming tombs. The trip itself was great and worth it. But: The driver took us to the Dingling tomb - not our favourite - and gave us too much time go around, so that in the end we had to wait for him. We really wanted to see the \"spirit way\". He phoned the hotel to complain that we took too much time. As soon as I talked myself to the hotel staff, they persuaded him to go there as well. Afterwards it seemed funny too us as well, that the driver asked us money for the motorway tolls despite we payed for an all-inclusive-trip. When we asked the hotel staff, if that was normal, they gave us back the money (for the motorway toll) immediately. So the hotel behaved absolutely correct.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-01T02:00:00.000+02:00", "crawled": "2017-03-29T03:03:56.112+03:00", "highlightTitle": ""}