{"organizations": [], "uuid": "3b21da59edcf5282b8a32717afc24f494bc6e605", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/02/72/6e/7f/hotel-madrid.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187791-d238492-Reviews-Hotel_Madrid-Rome_Lazio.html", "section_title": "Hotel Madrid - UPDATED 2017 Reviews &amp; Price Comparison (Rome, Italy) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d238492-r469892388-Hotel_Madrid-Rome_Lazio.html", "country": "US", "domain_rank": 189, "title": "Location + Excellent Service = AAA", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Location + Excellent Service = AAA - Review of Hotel Madrid, Rome, Italy - TripAdvisor", "spam_score": 0.003, "site_type": "discussions", "published": "2017-03-24T03:00:00.000+03:00", "replies_count": 1, "uuid": "3b21da59edcf5282b8a32717afc24f494bc6e605"}, "author": "anagreeneyez", "url": "https://www.tripadvisor.com/ShowUserReviews-g187791-d238492-r469892388-Hotel_Madrid-Rome_Lazio.html", "ord_in_thread": 0, "title": "Location + Excellent Service = AAA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I don't know where to begin. Girls trip and my friend booked this hotel and the rest of us just went along with her decision. One of the best decisions of our trip!\nFrom the moment we arrived we were treated like family. Check in was a breeze. We were offered limoncello (delicious), while explaining everything. Without asking our bags were loaded on to an elevator by a gentleman and brought to our room. Our room was ready upon arrival. It was a one bedroom suite (4 women) there were 2 couches, made up already for our arrival which were the size of twin beds in the living room area and comfortable. The bathroom was bright and filled with various toiletries. They have a free light buffet breakfast (more than a continental) up on the terrace which includes a beautiful view of the surrounding area.\nLet's talk about the location... It is hard to get any better. From when you walk out you can go in any direction and shop in the most luxurious stores, Fendi, Gucci, Louis, Ferrari, you pick. There are many restaurants with outside seating lining the beautiful cobblestone streets. Many attractions are close by and in walking distance including, the Piazza Di Spagna, Spanish Steps and Colosseum. The hotel concierge set up a private car for us and the ride to the airport was said to be about 40 minutes, it may depend on traffic because it was less. Our driver was extremely friendly and the ride is beautiful. He was explaining various landmarks, which is always a bonus.\nWe left Italy to travel to Spain for 4 days, and had too many suitcases. The hotel stored one for us while we were gone so we didn't incur the airlines extra bag fee.\nI cannot say enough! I guess this hotel is family owned and it showed! Everyone was friendly, especially, Fuvio and Luciano at the front desk.\nThe only slight negative I can think of is that there is no official bar area. They have a seating area in the lobby and they have cordials behind the front desk but when you want to retreat there is no bar. I would recommend removing the couches in the lobby and setting up a bar and cappuccino station with high tables.\nThough this was a girls trip I plan on returning with my husband and children within the next few years. Hands down, I will be returning to this hotel!", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-24T03:00:00.000+03:00", "crawled": "2017-03-28T15:05:22.540+03:00", "highlightTitle": ""}