{"organizations": [], "uuid": "76355838bc660b94beefcf859668a0bc3c9270b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/9d/6a/ea/marriott-vacation-club.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d1186070-Reviews-Marriott_Vacation_Club_Pulse_New_York_City-New_York_City_New_York.html", "section_title": "Marriott Vacation Club Pulse, New York City - UPDATED 2017 Hotel Reviews &amp; Price Comparison - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1186070-r471113002-Marriott_Vacation_Club_Pulse_New_York_City-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Perfect Location for a weekend getaway!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Perfect Location for a weekend getaway! - Review of Marriott Vacation Club Pulse, New York City, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 1, "uuid": "76355838bc660b94beefcf859668a0bc3c9270b1"}, "author": "CalgaryFamily6", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d1186070-r471113002-Marriott_Vacation_Club_Pulse_New_York_City-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Perfect Location for a weekend getaway!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We really enjoyed this property. We knew about the construction in advance so our expectations were set before arriving. We did not notice any elevator delays until Monday morning (arrived Friday afternoon, left at noon on Monday). I assume the construction work was amped up on Monday versus over the weekend. We saw construction crews throughout the weekend but everyone was friendly and courteous. We had a planned room change on Sat am (needed larger room Fri night, 1 extra person) so we had a non-reno room on Friday which was great and then a smaller, renovated room on Sat and Sun - also great! We did not experience any bad smells or disturbance related to the construction. The reno'd room had a very \"new carpet\" smell but who can complain about that? In the Empire King category room Fri night, we had the pullout sofa which we needed. We were disappointed to find, at 130am when we turned in for the night, there was no bedding supplied in the room so we had to call down and wait quite a while for someone to bring it up to us. This could have easily been avoided as we were registered as 3 guests for this room. On check in we were not informed of the continental breakfast available to us in the Lower Lobby. We found it when we went to the LL by mistake as we checked out. I suggest the check in staff be more forthcoming with that to new guests. We LOVED the rooftop patio and were thrilled to find the roof partially open on Friday night when we arrived. The sunset was bouncing off the ESB and it was a stunning view! We did not have a view room but we noticed and appreciated how very quiet both our rooms were. Our last visit to the area, I stayed at a competitor hotel and could hear the traffic all the way up in my room on the 12th floor! At Pulse, we were on 8 and 18 and did not hear a single sound - perhaps because we were on the backside of the hotel? It was a noticeable difference to our party as compared to the last trip. The location of this site is the best I have stayed at! (4 visits to this area in recent years). We saw 4 shows in 72 hours and walked everywhere in dress clothes/shoes - less than 1 mile to any of the theatre venues we visited. Wonderful!!! Subway station is 2 blocks away making for a quick trip to the Staten Island Ferry. Our Friday guest even took transit to LGA when she left and could not believe how easy, quick and inexpensive it was!! As long time MVC owners, we love the concept of the new Pulse brand and are very excited to come back to this site and perhaps check out some of the other Pulse locations. It is exactly what was missing from our MVC ownership and we are thrilled with it! We hope to see you again very soon (waiting for Pretty Woman, the musical to open). Oh! I should mention....one extra thing, not a deal breaker but a slight disappointment when booking our stay, in our follow up emails, phone call to the front desk and calls and discussion with the concierge before our arrival, I repeatedly asked people to note that this was a milestone birthday celebration for one member of our party. I plan many milestone trips and this was the first time at any property (Marriott, Hilton, Westin) that the milestone has not been acknowledged when we arrived. The expectation is low - could be anything from a warm greeting \"I see you are celebrating this weekend\" to a gift in the room (Hilton presented my Mother with a lovely surprise on her milestone) --- knowing the quality of the Marriott brand and the fact we are long time owners, I was surprised that none of these many (10-12) comments and reminders ever made it to the check in counter. I'm not asking for a gift or anything for free - just that it is pretty easy to make someone feel special by acknowledging their special occasion when it has been provided in advance. Looking forward to returning once the reno's are completed - see you soon!", "external_links": [], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T21:35:29.402+03:00", "highlightTitle": ""}