{"organizations": [], "uuid": "438f2a7733c18dc05e8bc1ec39b879e49ac9727d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/37/7f/7c/bedroom-at-premier-inn.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d10225380-Reviews-or10-Premier_Inn_London_Brixton_Hotel-London_England.html", "section_title": "Premier Inn London Brixton Hotel - UPDATED 2017 Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d10225380-r467025521-Premier_Inn_London_Brixton_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Best value-for-money choice for a family of 4", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Best value-for-money choice for a family of 4 - Review of Premier Inn London Brixton Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "438f2a7733c18dc05e8bc1ec39b879e49ac9727d"}, "author": "Sabrina S", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d10225380-r467025521-Premier_Inn_London_Brixton_Hotel-London_England.html", "ord_in_thread": 0, "title": "Best value-for-money choice for a family of 4", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When traveling with kids prices can go high for a family. Researching for an accommodation in London, the Premiere Inn hotel chain was recommended to me. Indeed it pays off - hotels include an offer \"kids under 16 stay for free and have a free breakfast\".\nAmong other hotels in London, I've chosen Brixton and I'm not disappointed. Love the Brixton area with a Caribbean vibe. The hotel is close to Brixton Tube station, in Zone 2, therefore all London is easily accessible. Doesn't really matter where exactly you stay in London if you have a Tube near.\nBrixton open market close to the hotel has a nice atmosphere and you can find a great meal here. Don't remember the name, but one is introduced in a book with top brunch cafes in London. I also don't know about the local events (no time when traveling with kids), but as I've heard from friends, Londoners come here sometimes for a party :)\nDavid Bowie is from Brixton and Brixton Premiere Inn gives tribute to him with a picture wall in the entrance. Really nice touch. The room was clean, beds comfortable, quiet at night (at least our room), only the internet was a bit slow (although could work with it and there is an option for an upgrade for a higher speed). Staff at the reception was nice and helpful, at the breakfast not everybody. Breakfast choice is basic but tasty.\nI would stay here again and will check Premiere Inn when looking for an accommodation in destinations, where they have hotels. I recommend it for families with kids and for others, too.", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-31T19:44:08.936+03:00", "highlightTitle": ""}