{"organizations": [], "uuid": "831c1bbb505b55a23d458299bba60cf9f65e04ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/07/32/53/3e/hotel-relais-bosquet.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g187147-d229602-Reviews-Hotel_Relais_Bosquet_Paris-Paris_Ile_de_France.html", "section_title": "Hotel Relais Bosquet Paris - UPDATED 2017 Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d229602-r462331186-Hotel_Relais_Bosquet_Paris-Paris_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "All in all a good experience", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "All in all a good experience - Review of Hotel Relais Bosquet Paris, Paris, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-27T03:00:00.000+03:00", "replies_count": 1, "uuid": "831c1bbb505b55a23d458299bba60cf9f65e04ed"}, "author": "marom", "url": "https://www.tripadvisor.com/ShowUserReviews-g187147-d229602-r462331186-Hotel_Relais_Bosquet_Paris-Paris_Ile_de_France.html", "ord_in_thread": 0, "title": "All in all a good experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Booked a 4 night stay for February 2017. Will make this review according to location, room, staff - the good and the bad.\nLocation\nThe good: Hotel is located quite near to the Metro station \"Ecole Militaire\", very easy to get to the connection with line 1, or to the opera. The whole area is full of bakeries, groceries, restaurants, cafes, bistros.. plenty of eateries.\nIf you feel like walking, the Champs Elise is 30-35 minutes away, very nice.\nThe bad: Nothing really bad, but it's not as central as the Latin Quarter or city center - I'd recommend it for those who have been to Paris before (as we have) and wish to explore new areas.\nRoom\nThe good: We had a \"superior\" room, which was very spacious, very clean, great bathroom and the toilet is separate from it. Not that important to us, but had a large TV, there was an entertainment system that you can use (we didn't).\nThe bad: Very surprised to find that there was no socket in bathroom, which meant I couldn't use my beard trimmer. When we did turn on the TV, it was mostly French channels, some other European options, but in English there were only four channels, all of which were news.. (Sky, BBC, CNN, CNBC). No option for light entertainment TV if you're an English speaker. WiFi was not what I hoped for. It was cumbersome, requiring a log-in every time and was quite slow in general.\nStaff\nThe good: All staff members we encountered were very polite and usually friendly.\nThe bad: One staff member surprised us with lack of knowledge of specific cuisine - there is one pizza place right by the hotel, but when we decided we're in the mood for pizza it was closed.. we asked the staff member in reception if there are any other pizza places nearby, and she said that this area specializes in French cuisine, so no other pizzerias. A short search on Google Maps found a pizza place nearby, and not only was it delicious, there were three other pizza places around it! All this in a five minute walking range.\nThe hotel sent us a questionnaire before arrival, to prepare for our stay. It's a wonderful idea. I decided to surprise my wife and ordered a bouquet of roses. It was never delivered.. This may be a glitch, but it was disappointing and pretty much missed the whole point of the questionnaire...\nUpon our day of check out, we were in our room getting organized. Check out is at 11:00, but at 10:00 housekeeping was banging on our door! It seemed a bit out of place to me.\nI did ask for a quiet room and got one right by an elevator, which sadly meant that people coming back late woke us up with their loud talking and door banging.\nBottom line: The stay was ok, the most important things - comfortable room, very good bed, clean, those are there. As far as the rest, it's fine and will fulfill most people's hopes, but for me it was just almost there. I expected more after reading all the reviews - maybe I'm just a tad picky because I expected more.\nBreakfast was 16 Euro per day, per person - seemed a bit too much for our taste - 32 Euros per day for the both of us is steep. I stepped out every morning to the bakery right by, got a few fresh croissants, we bought orange juice at the grocery and it was much cheaper yet more than enough.\nIt's not a bad hotel, it just didn't live up to my expectations after reading all the reviews on TripAdvisor.", "external_links": [], "published": "2017-03-27T03:00:00.000+03:00", "crawled": "2017-03-31T13:10:59.287+03:00", "highlightTitle": ""}