{"organizations": [], "uuid": "191c5be1fcd37da6a375df62ed4f830cd097d31e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/01/d1/33/74/the-trafalgar-hotel.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d209237-Reviews-or10-The_Trafalgar_Hotel-London_England.html", "section_title": "The Trafalgar Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d209237-r466742558-The_Trafalgar_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Location, Location, Location!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Location, Location, Location! - Review of The Trafalgar Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 1, "uuid": "191c5be1fcd37da6a375df62ed4f830cd097d31e"}, "author": "GeordAnt", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d209237-r466742558-The_Trafalgar_Hotel-London_England.html", "ord_in_thread": 0, "title": "Location, Location, Location!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I stayed recently for a night to enjoy a show on the West End and I was very happy with my choice of hotel.\nThe best asset of this hotel (aside from it's friendly staff) is it's location. You step outside of the hotel and you're practically kissing the noses of the lions in Trafalgar Square. From here you have a short walk to all of the tourist hot spots, from Trafalgar Square itself, to 10 Downing Street, the Houses of Parliament and Big Ben, the Mall, Buckingham Palace, Leicester Square etc are all between 5 and 15 minutes walk. You won't find many better placed hotels in London and that is a fact.\nFor the hotel itself, the reception has moved and it was a little annoying at check in to have to shout over the incessant banging going on whilst they're refurbishing the hotel but you have to see the greater good, they're investing in the hotel to make it better for guests. Upon check in my wife received a complimentary drinks voucher as we were celebrating her 30th birthday. It was a lovely touch but unfortunately the only place available to have these drinks were in a basement which was quite small and was not very welcoming for a night evening drink. But the offer was there, as was a little desert in our room which again wished my wife a happy birthday. Lovely touches from the staff.\nThe room itself was quite dated and it felt bare, the decor left a lot to be desired and I would hope that the renovations going on within the hotel include these rooms. The bathroom needed completely redoing as it seems like it hasn't attention for some time.\nThat being said, it had everything we would expect including free wifi (Hhonors) an iron/ironing board and I received some complimentary bottles of water. As I work in the leisure industry I got a fantastic rate so I am more than happy with what was on offer. I didn't take the option of breakfast but I assume it would be taken in the basement so for the time being I would advise you to go room only until the hotel upgrade is done.\nI will certainly go back to this hotel and would advise others to.\nRoom Tip: 504 had a side view of Trafalgar Square and the London eye. See more room tips", "external_links": [], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-31T18:28:19.839+03:00", "highlightTitle": ""}