{"organizations": [], "uuid": "7187f8462fd9362b668d3e5e180e01bc9b4ebfe7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/75/d4/f1/atrium.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d8615610-Reviews-The_Beekman_A_Thompson_Hotel-New_York_City_New_York.html", "section_title": "The Beekman, A Thompson Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d8615610-r468423842-The_Beekman_A_Thompson_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Book Your Reservation, While You Can Still Get In!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Book Your Reservation, While You Can Still Get In! - Review of The Beekman, A Thompson Hotel, New York City, NY - TripAdvisor", "spam_score": 0.032, "site_type": "discussions", "published": "2017-03-18T02:00:00.000+02:00", "replies_count": 0, "uuid": "7187f8462fd9362b668d3e5e180e01bc9b4ebfe7"}, "author": "CSHHappyTraveler", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d8615610-r468423842-The_Beekman_A_Thompson_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Book Your Reservation, While You Can Still Get In!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "So, I was all set to book a mother-daughter (13 years old) overnight at a well-known hotel with park access at which I had always wanted to stay. . .after reading its positive reviews I sensed it really wasn’t the atmosphere I was seeking for this particular trip. Having now experienced a truly remarkable stay at The Beekman, I would imagine this recently opened (October 2016) architectural gem of a space is truly a game changer in the hierarchy of downtown hotels.\nThe hotel key card case reads, “Once upon a time. Now.” This tag line captures the gestalt of this hotel so well, that whoever did the advertising/marketing (and by the way, the glorious website) deserves several “high fives.”\nSet in what had been an abandoned historic landmark building, The Beekman is the perfect blend of so many things-history and modernity, architecture and interior design, form and function with bespoke art pieces. Cleary, it took large sums of money, vision and passion to create this beautiful hotel. Its central feature, the atrium, is a column of open space stretching from the lobby floor straight up to what appears to be a vintage lead glass rooftop. From the storied balconies accessing the guest rooms, one can look both downward and skyward appreciating truly artistic visuals that lend one the eye of a famed photographer.\nEvery element of the Beekman’s construction appears to have been given a meticulous and creative perusal. The furnishings are eclectic- a cool blend of old and new, traditional and yet globally inspired. The rooms are fairly typical in size for NYC- not particularly large, but designed functionally and with an aesthetic that makes you feel serene all at once after a long day.\nEvery great hotel is much more beyond the bricks and mortar, and service is a key. The team staff at the Beekman was so lovely and accommodating (and trust me, after a serious day of “touristing” in Midtown, I was not one anyone would particularly want to go out of his/her way to impress.) Each person we encountered went out of the way for us. . .from the lovely woman at the front desk (who upgraded our room because this was a special mini-holiday); to Graham, who secured us a reservation on a dime at just the right spot; to Joseph, our bellman, who provided an excellent history on the building; to Christina (name?) who hailed us a cab with balletic aplomb amidst the slushy street.\nFor all its grandeur, including the “sure to be hotspots” (if not already) of The Bar Room at Fowler and Wells (“F&W”), the mark of a great hotel is its staff’s ambition to promptly address shortfalls. We did have one blip in our stay. We sat for breakfast at F&W, and waited about forty-five minutes for our eggs and bacon, despite our having informed the waiter we had a timetable to keep in order to catch our train. The hostess/restaurant manager read my body language well enough to understand I was unhappy. She (so sorry, I don’t know your name!) approached me and kindly insisted the breakfast was on the house. So nice, especially because I did not actually complain to her. . .P.S. the breakfast was delicious, and we burned it off running to successfully catch our train!\nWill most definitely stay here again. . .would be wonderful for anyone who appreciates the exceptional, the artist, the romantic, the history buff and even for the mom who wants to enlighten her daughter.\nP.P.S. Not inexpensive, but also not over the top, this hotel more than delivers its value.\nRoom Tip: Select a higher floor. . .this is always my room recommendation for NYC, because they are generally... See more room tips", "external_links": [], "published": "2017-03-18T02:00:00.000+02:00", "crawled": "2017-03-26T22:04:49.523+03:00", "highlightTitle": ""}