{"organizations": [], "uuid": "1ef1043904ac6efcf13cef3fb3e150a1a8dba331", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/bd/b8/3c/junior-suite.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g1934807-d198080-Reviews-Renaissance_Paris_La_Defense_Hotel-La_Defense_Hauts_de_Seine_Ile_de_France.html", "section_title": "Renaissance Paris La Defense Hotel - UPDATED 2017 Reviews &amp; Price Comparison (France) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g1934807-d198080-r469001856-Renaissance_Paris_La_Defense_Hotel-La_Defense_Hauts_de_Seine_Ile_de_France.html", "country": "US", "domain_rank": 189, "title": "6 night stay in March (gold status)", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "6 night stay in March (gold status) - Review of Renaissance Paris La Defense Hotel, La Defense, France - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "1ef1043904ac6efcf13cef3fb3e150a1a8dba331"}, "author": "Wilfred S", "url": "https://www.tripadvisor.com/ShowUserReviews-g1934807-d198080-r469001856-Renaissance_Paris_La_Defense_Hotel-La_Defense_Hauts_de_Seine_Ile_de_France.html", "ord_in_thread": 0, "title": "6 night stay in March (gold status)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I'll attempt to give you my take on this hotel from a leisure standpoint since most of the reviews are business (La Defense is the business district). I stayed here using a 7 night certificate from the flight and vacation packages, and was upgraded to a club level room on the 10th floor upon arrival (I would've received lounge access regardless since I was gold). Check in/check out was smooth, and ample information was given regarding what to do in the city.\nLocation: Not in the center of Paris, but pretty good location since the La Defense metro/RER station is about a 5 minute walk. We got the all week pass and found it really useful as it's from zone 3 to zone 1. Did read some issue about uber/taxi having trouble finding it, but we had no issue since we went down onto the road. Overall, it really just depends on whether you want to pay more to be in the center, or pay less to be 20-30 minutes away but still have it pretty easy since transportation here is easy.\nHotel amenities: Bed was comfortable, wifi was good (had 1.5 days where the wifi was down but they fixed it), overall nice decor. The shower/bathtub combo is a huge issue because there's no real shower door and so the water leaks everywhere. This was one of the biggest problems with the hotel. Had certain issues with certain lights not turning on and we had trouble with the card getting into the elevators sometimes. But these were small issues that didn't really affect our stay.\nLounge access/breakfast: Breakfast spread was plentiful, free water/juice/coffee 24/7 is a nice touch. Evening appetizers and alcohol during happy hour saved us a lot of $$ since we would come back to the hotel and eat dinner, re-up on water, and rest up before going back out at night. Breakfast at the restaurant on the weekends were good, although I wouldn't pay if it weren't complimentary.\nOverall, I had an enjoyable stay. In the context of the hotel and for how much it was charging, it was a 4 star value. Comparing this hotel to something near vendome or champ elyses is like comparing apples to oranges because the price at those locations would be double or triple.", "external_links": [], "published": "2017-03-20T02:00:00.000+02:00", "crawled": "2017-03-31T06:25:15.512+03:00", "highlightTitle": ""}