{"organizations": [], "uuid": "5be8da3c2f2a9e85ebafc88fbdea62dbdf2a396d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/f0/b2/bb/atrium.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d2630895-Reviews-or10-ME_London-London_England.html", "section_title": "ME London - UPDATED 2017 Hotel Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d2630895-r470165559-ME_London-London_England.html", "country": "US", "domain_rank": 189, "title": "Lovely stay at ME London!", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Lovely stay at ME London! - Review of ME London, London, England - TripAdvisor", "spam_score": 0.041, "site_type": "discussions", "published": "2017-03-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "5be8da3c2f2a9e85ebafc88fbdea62dbdf2a396d"}, "author": "corduroy", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d2630895-r470165559-ME_London-London_England.html", "ord_in_thread": 0, "title": "Lovely stay at ME London!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Had a great stay at for a week in Londontown. Beautiful, sleek modern hotel with a great location - at the southern edge of Covent Garden on The Strand - close to everything worth walking to, and to two tube stops, Covent Garden and Temple. Excellent proximity to great shopping and theatres. Norman Foster designed exterior and interior. Astonishing check in lobby on the first floor inside a pyramidal light well that goes the full nine stories up to the roof, lined in triangular white onyx, and projected with animated images that slink up the walls (including jellyfish). Great service from professional and warm staff.\nRoom\nBeautiful black onyx hallways - very dark but atmospheric - lead into bright white minimal, but luxurious rooms. We booked a mode room and asked for extra space and a bathtub and that is what we got. Beautiful modern room on the seventh floor, large by London standards. Only minor flaw was that the seventh floor rooms don't have the triangular bay windows that the other rooms have; ours was a square window that was slightly high for viewing out - faced Covent Garden. We specified that we would need a tub, so note that if you're booking a Mode room with the huge tub you will have to settle for the smaller window as apparently there are none with the bays in this category. Was fine for us as the tub and bathroom were amazing.\nThoughtful and modern interior design with attention to detail - for example the back of the entrance door was all mirror - great for checking yourself before a night on the town and expanded the space of the long entry hall. The main bedroom area was minimal and modern with white paneled leather walls and a black glass entertainment centre. Amazing food and drink in minibar, local chocolate, chips, cookie bars etc. The illuminated panels and the changeable colored backlighting were a nice touch and easily worked via touch screen adjacent to the bed. Beds were low slung, huge and pretty nice but not as plush as we thought, on the firmer side but still very comfortable. Plenty of outlets with universal adapters incorporated. We did not see an iPod dock or combo dock alarm clock which was strange. There were what looked like speakers on the ceiling over the bed but we didn't know how to work them. There could have been a more detailed explanation of the suite and the electronics in it when we were shown our room.\nThe bathroom was super modern, all black back painted glass with white frosted glass accents. Single vanity and huge oversized tub. Large separate shower and giant rain shower head with great pressure. The shower interior was all white back painted glass with an onyx accent shelf and it was a beautiful slick space. All the doors were floor to ceiling sliding frosted glass panels which made the space feel larger and taller.\nRestaurants and Bars\nWe had breakfast at the hotel once and it was ok. It was good but there are so many other options in the area and at £30 per head (we did not include breakfast in our rate) we preferred Balthazar and The Delaunay for fancy and Bill's for cheap and cheerful. Interior design was nice and service was very good. Did not try STK, having experienced them in both NYC and Miami (ho hum). Radio bar was good - beautiful space with spectacular 270 degree views of London, ok drinks. For drinks the ground floor Marconi bar was better but without the incredible view. Amazing cocktails - try the Seve - and good service, but was never buzzy or busy. Sweeping, curving chrome rod screens were instagram worthy.\nService\nOverall Excellent. We were emailed prior to our stay by the Aura team and we had already emailed prior to that for room requests, to let them know that that this was a special occasion trip, and for restaurant inquiries and reservations prior to our stay. The hotel responded within 24 hours and the concierges did so the same day regarding reservations. The concierges in particular were amazing and managed to score reservations at Gymkhana and Ting on very very short notice when web reservations indicated they were unavailable. Ronan was indispensable for information, great for reservations, and wonderful to chat with, amazing Joseph who achieved the reservations at Gymkhana, and Sam and Armand were great all around. All were very charming and generous with their time and knowledge of the city. Maid service was excellent and unobtrusive and rooms were super clean (even with all the glass and polished surfaces). Overall this is a really great design hotel with a fantastic location, large modern thoughtful rooms and warm, wonderful service. We will be back.", "external_links": [], "published": "2017-03-25T03:00:00.000+03:00", "crawled": "2017-03-31T22:13:17.418+03:00", "highlightTitle": ""}