{"organizations": [], "uuid": "cb26fc61e7291b38b71fe20647b304448de9ad6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/bd/4b/46/guest-room.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93516-Reviews-or10-Novotel_New_York_Times_Square-New_York_City_New_York.html", "section_title": "Novotel New York Times Square - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93516-r467867066-Novotel_New_York_Times_Square-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Clean, great location", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Clean, great location - Review of Novotel New York Times Square, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-16T02:00:00.000+02:00", "replies_count": 0, "uuid": "cb26fc61e7291b38b71fe20647b304448de9ad6a"}, "author": "purrlocked", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93516-r467867066-Novotel_New_York_Times_Square-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Clean, great location", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The location and cleanliness merits top marks. Special thanks to Geralde for facilitating our check-in and one day extension due to the snow storm. During our week long stay stay, we tried the Hotel restaurant Supernova twice, once for breakfast and another for lunch. It has a nice view of Times Square's lighted billboards. There are lots of choices for all price ranges near by: Pret A Manger, 99 Cents Fresh Pizza, Le Bernardin and Halal Guys.\nA few things to note. Buffet Breakfast coffee is only from coffee maker, not espresso based. Many breads available, but since breakfast is self service, each person needs to cut a piece of big loaves (like the baguettes) himself/herself. I've seen other guests handle it with their bare hands. Oranges and grapefruit come pre peeled immersed in a liquid. I would have preferred the whole fruit.\nLunch service, they never noticed we did not have butter knives for the rolls, so I just got one from another unoccupied table. They serve a nice complimentary variety of 4 rolls with olive oil, butter and olives (salty) on the side. It would have been better if there was balsamic vinegar to mix with the olive oil. They did ask how was our orders though, which was OK. I learned at this time that they can actually prepare espresso based drinks. I wish that option was offered at breakfast too.\nIt's location is best if you want to walk to Top of the Rock, St. Patrick's Cathedral, MoMa, Central Park and the the Museum Mile nearby. Lots of theaters are just a few steps away. In Broadway, the show goes on even if there is a snow storm. We just hoped the hotel shoveled a little snow from the sidewalk leading to their door. Even just a two feet wide section of their entrance would have been enough so guests and rolling luggages can pass without getting buried in snow.\nIf you are having packages delivered to the hotel, there's a handling fee of 2 USD for each one, which I think is fair because they sign and receive it for you when you are out. Do note that you can only retrieve your package during office hours.", "external_links": [], "published": "2017-03-16T02:00:00.000+02:00", "crawled": "2017-03-29T05:59:03.100+03:00", "highlightTitle": ""}