{"organizations": [], "uuid": "7852e54b53c39618f7b199f5d268d3437b54ccbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/06/a1/27/cd/exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d93390-Reviews-or20-Hotel_Belleclaire-New_York_City_New_York.html", "section_title": "Hotel Belleclaire - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93390-r466938433-Hotel_Belleclaire-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "New Year.… New York -", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "New Year.… New York - Review of Hotel Belleclaire, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "7852e54b53c39618f7b199f5d268d3437b54ccbf"}, "author": "Sita A", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d93390-r466938433-Hotel_Belleclaire-New_York_City_New_York.html", "ord_in_thread": 0, "title": "New Year.… New York -", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We arrived on Feb 1st for a 9 day visit to see our daughter who is living/working/studying in this magnificent city for a year.\nBefore booking this hotel I researched a lot of hotels and I mean a lot. This was my second visit to NY but the first four my husband. All I can say is I'm glad we chose hotel Belleclaire as it was in a lovely location, quiet more residential but not boring if that's what comes to mind. Nowhere can be boring in NY! We were pleased we didn't book in Times Square, although atmospheric it would get a bit much for 9 days.\nLovely swift welcome, check-in and a free upgrade because we had booked for 9 days...very welcome indeed. Good size room, very comfy bed. Good en suite with a shower that had a proper glass paneled enclosure, no shower curtains thankfully.\nOnly negatives was a lack of sufficient storage, could benefit from a chest of drawers. The room got very warm, it may have been cold outside but inside was like a sauna. Had to contact reception to address this minor issue. Windows opened which resolved this somewhat. Would have species tea/coffee facilities within the room but I noticed this is often lacking in NY hotels when researching which is very different from the UK. To compensate there was free tea after 2pm from the reception, good for those who like tea, me I drank hot water, trying to be health conscious to try and negate the over indulgent eating!!!\nNice open reception area, some areas could do with an update bit not a huge issue.\nHousekeeping very good and regular.\nLifts quite small and a bit slow.\nOur last night/day the snow arrived which delayed our flights for four hours or so. We got an extra hour for check out and storage for luggage and hung out in the reception area until we needed to leave. Smooth check out and great assistance from the door man whose name escapes me but he was a lovely gracious man and very helpful.\nWould definitely stay again and the price was very good for NY, great location walking distance from Central Park and four subway stops from the heart of the city. Recommended to my sister and brother-in-law who are visiting in May this year.", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-13T02:00:00.000+02:00", "crawled": "2017-03-29T07:18:12.745+03:00", "highlightTitle": ""}