{"organizations": [], "uuid": "4dd9f0c582f594c7b97cfce5387a49de8a71af56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/c0/59/7b/hotel-exterior.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d289182-Reviews-Holiday_Inn_Express_London_Limehouse-London_England.html", "section_title": "Holiday Inn Express London-Limehouse - UPDATED 2017 Hotel Reviews &amp; Price Comparison (England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d289182-r469229603-Holiday_Inn_Express_London_Limehouse-London_England.html", "country": "US", "domain_rank": 189, "title": "11th anniversary trip to london", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "11th anniversary trip to london - Review of Holiday Inn Express London-Limehouse, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-21T02:00:00.000+02:00", "replies_count": 0, "uuid": "4dd9f0c582f594c7b97cfce5387a49de8a71af56"}, "author": "John C", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d289182-r469229603-Holiday_Inn_Express_London_Limehouse-London_England.html", "ord_in_thread": 0, "title": "11th anniversary trip to london", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We had booked this hotel through a website where we got hotel and tickets for the lion king. We flew from Manchester to London Heathrow and from there was pretty easy to jump on the subway from inside the airport had to swap on 3 trains in total which wasn't a problem at all and probably took around an hour in total.\nWe arrived around 10pm Friday night, we went to check in and they told us that the room was for one person so had to get all my paper work out and show that I had paid for two. The only room they said they had was two single beds that couldn't even push together. Now normally not a massive issue but this was our 11th anniversary romantic weekend away so you can imagine we would rather be in the same bed. The staff that night didn't really seem like they wanted to help and told us that when you book a double room doesn't mean you get it you just get what ever is free when you arrive so we was quite mad at this stage. They did end up finding us a double bed room but was a disability room which was a very nice room, clean and tidy but was made for wheel chairs so hand rails every where, everything low down, and bathroom shower for a wheel chair not exactly a romantic setting.\nNext morning we rang the place we booked though to find out what was going on, they rang the hotel and told us to go to reception where we met the manager a very nice man who was very helpful and apologetic and sorted us a normal room there and then.\nThe breakfast was nice they have a few different types of cereal, fruit and yogurt. Toast and then a few hot items sausages (very nice), bacon, beans And scrambled egg. Also fruit juices and your hot drinks like coffee tea hot chocolate etc..\nOne night we fancied a takeaway while at the hotel so I nipped down to the desk and asked if we was aloud to eat in the room and if we could get it delived. And they was very helpful by handing us a few takeaway menus and even asked if we wanted them to order it for us. We just ordered from the just eat and when it arrived the reception just rang our room to come and collect it.\nThe hotel is like a 5 min walk to limehouse station which is good. And we wanted to get a taxi back from central London one night and cost £35 which again I thought was ok.\nIt's a nice hotel and apart from the hiccup the first night everything else was great. Would stay here again if I was in the area", "external_links": [], "published": "2017-03-21T02:00:00.000+02:00", "crawled": "2017-03-31T21:41:14.444+03:00", "highlightTitle": ""}