{"organizations": [], "uuid": "e2a84355c7e2556fd57231a082336e913143e828", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/45/ae/24/restaurant-next-to-the.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g186338-d193122-Reviews-The_Gore_Hotel-London_England.html", "section_title": "The Gore Hotel - UPDATED 2017 Reviews &amp; Price Comparison (London, England) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193122-r464836847-The_Gore_Hotel-London_England.html", "country": "US", "domain_rank": 189, "title": "Exquisite and unique", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Exquisite and unique - Review of The Gore Hotel, London, England - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "e2a84355c7e2556fd57231a082336e913143e828"}, "author": "Cromerp", "url": "https://www.tripadvisor.com/ShowUserReviews-g186338-d193122-r464836847-The_Gore_Hotel-London_England.html", "ord_in_thread": 0, "title": "Exquisite and unique", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stayed for one night as we were booked to see a show at the Royal Albert Hall (which is literally two minutes walk away). On entering the hotel one is immediately transported to a different world. The hotel is just beautiful, an oasis of calm with indulgent fabrics, fine art and antiques...one could imagine being a Victorian gentleman of means in such a fine establishment!\nWe booked a superior double which was delightful. Super high ceilings and Windows gave a feeling of space. The bed was enormous and very high! I loved it but my partner found it hard to get in and out of.. (Perhaps a footstool would be an idea?)\nOnce on the bed we both found it gave the most restful sleep.. Pillows and mattress were excellent as was the bedlinen.\nPlenty of wardrobe space, a stunning bathroom and a nice comfortable settee gave a level of comfort that really would make it an ideal place to spend a week or two (if only we could afford it!) exploring London.\nThe staff were extremely polite, helpful and accommodating. The only real area for improvement would be breakfast, and only in that there wasn't a huge amount of choice for the continental breakfast, and it wasn't clear at time of booking that we would have to pay extra for a cooked element. That said, we both opted for a hot plate upgrade (eggs benedict and eggs royale respectively) and it was exquisitely cooked.\nIt perhaps would have been nice for the hotel to provide a complimentary bottle of water or two in the room for those of us that need to take medications, but again I'm nit picking.\nOverall this is a truly beautiful hotel in a perfect location for the RAH and the museums, with Hyde Park over the road. A minute or two walk to the bus stops opens up the rest of London for explorers so an ideal base to return to at then end of the day. The adjacent bar190 does a fine cocktail too.\nLooking forward to returning as soon as we can!", "external_links": [], "published": "2017-03-05T02:00:00.000+02:00", "crawled": "2017-03-31T16:33:22.197+03:00", "highlightTitle": ""}