{"organizations": [], "uuid": "cd11db285adc9160043571746ab7fff205ad99a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/08/8a/f0/71/lobby-main.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d99766-Reviews-or50-The_Roosevelt_Hotel-New_York_City_New_York.html", "section_title": "The Roosevelt Hotel - UPDATED 2017 Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r467363887-The_Roosevelt_Hotel-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Does the Trick", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Does the Trick - Review of The Roosevelt Hotel, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "cd11db285adc9160043571746ab7fff205ad99a8"}, "author": "RFMSP", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d99766-r467363887-The_Roosevelt_Hotel-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Does the Trick", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Location wise, this property is ideal for most leisure travelers to New York. You're a five minute walk to Grand Central where you can take either a 4,5,6 subway uptown/downtown on the east side, or the shuttle to Times Square, where you catch all the west side lines. You can walk or jog 15 short blocks (about a mile at most) to Central Park. In minutes you can walk and be in the heart of the more upscale mid-town. It’s really quite hard to beat. The hotel is described over and over in these threads for what it is: an grand old hotel with a very international feel, appealing to travelers from all over the world looking for good value in a city that, let's face it, can drain your travel budget.\nOur room, a superior twin with two full size beds, was just fine. Clean, not fancy ( you know, older drapes, somewhat dated tile in bathroom etc), but perfectly suitable, with everything functioning well, and especially - I'd add- fair for the good price we paid. We did not have difficulties with the elevator as I've seen others mention. It's not speedy, but it wasn't a big issue. The lobby bar is fun- good energy and excellent service. Also- a tip: the Wifi fee of $19.95 per day was waived because we had a superior room. Wifi logged out occasionally, but worked just fine otherwise. When we needed something (extra blankets) they were brought to us in a jif.\nMy only complaint would be noise, and most of this is not the fault of the hotel. First, you have rude guests literally yelling and running in the halls at 1-2am. To avoid this, try to avoid a rooms by the elevator. I never ceased to be amazed at the impoliteness of travelers in this regard. This is not unique to the Roosevelt Hotel, and it happens all over the world in all types of properties, and I guess it’s part of the travel experience, but is it me or is this trend getting worse? It’s annoying as heck for some of us who don't sleep late into the morning. Second, the walls are thin. You can hear the conversations of the people in the next room, and if they are laughing and talking loud, well, put your earplugs in. Third, there is construction just to the north on Madison Ave across the street. The noise is at time thunderous- loud banging, pounding, forklifts, trucks etc., and it goes on all night long every night, even Sunday. They did not stop - ever. Being a light sleeper, I found I could only cope if I had earplugs and my winter head-band on. I mentioned it at the front desk, and the polite, sympathetic staff person advised me to call 311 to complain. (The city..? Oh, will they spring into action to stop it if I do? ). She also said that there is little they can do because the city and the construction company have no obligation to their neighbors to keep the noise down. I realize they could possibly have moved us if we asked, but we just didn't want to deal with it, possibly risking some other inconvenience in the process. But my question: Why not just not book anyone into those rooms facing Madison Ave? Would it impact their bottom line that much? It's a dilemma, I'm sure, for hotels trying to make it in NY, but no question, the folks in those rooms should pay less. I think we probably did, which is why I'm not all that worked up about it. Impacted enough to mention it here though.\nI'd just ask for a quiet location. We were on floor 16 and while that didn't do anything to quell the construction situation and obnoxious people coming in from the bars, a higher floor is typically away from street buzz. I'd ask to be away from the construction site for the coming months, as well.\nI would stay here again. NYC is a loud city, and I get it, one shouldn't expect perfect quiet, but not hearing forklifts all night is a reasonable expectation.\nRoom Tip: For quiet ask for room away from elevators and construction. Ask for blankets in winter. The beds a... See more room tips", "external_links": [], "published": "2017-03-14T02:00:00.000+02:00", "crawled": "2017-03-31T21:23:18.719+03:00", "highlightTitle": ""}