{"organizations": [], "uuid": "67da0171cbfde6992304c372727df89b2cf92e0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/1d/07/ce/lobby-artwork-by-gregory.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d8680787-Reviews-The_Renwick_Hotel_New_York_City_Curio_Collection_by_Hilton-New_York_City_New_York.html", "section_title": "The Renwick Hotel New York City, Curio Collection by Hilton - UPDATED 2017 Reviews &amp; Price Comparison - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d8680787-r471247488-The_Renwick_Hotel_New_York_City_Curio_Collection_by_Hilton-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Great room, nice hotel, but...", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 1, "title_full": "Great room, nice hotel, but... - Review of The Renwick Hotel New York City, Curio Collection by Hilton, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "67da0171cbfde6992304c372727df89b2cf92e0e"}, "author": "TipperNC", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d8680787-r471247488-The_Renwick_Hotel_New_York_City_Curio_Collection_by_Hilton-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Great room, nice hotel, but...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I very much enjoyed my two night stay at the Renwick and recommend the hotel overall. But there were some issues with my stay that are worth mentioning.\nFirst, the room. I had a two room suite on the 14th floor. I had reserved a Steinbeck suite but the hotel had no record of my reservation, even though I was looking right at the reservation on the Hilton app on my phone as I stood there. A manager had to be called and she created a new reservation for me using the info on my phone - luckily they weren't full or I don't know what would have happened. Apparently there is some issue with reservations made via the app, so beware.\nSo I was given what I think their site calls an \"artists suite\" rather than the Steinbeck suite. The room was awesome. Creaky hardwood floors, great decor and artwork, and a lot of room for one person. I had a nice view of the Empire State Building, though the windows were VERY dirty. I really can't say enough about the room, it was very cool. The bed was comfortable and the street noise was faint. The bathroom was very small and I was disappointed to have a tub instead of a shower. But the water pressure was good and there was no shortage of hot water. They have pump-style toiletries in the shower - sadly my tub was supplied with two shower gels and one conditioner. Despite repeated requests for shampoo, they never replaced one of the gels with shampoo. Disappointing. My hair looked crazier than usual for two days since I washed it with shower gel. Sigh. And there was virtually nowhere to put your own toiletry bag - a narrow glass shelf over the toilet and an inconvenient shelf under the sink were the only choices.\nBreakfast in the hotel restaurant was enjoyable. Hilton gold and diamond members can choose three of four things off the menu - yogurt w/granola, oatmeal w/apples and cinnamon, waffles, or a pastry (croissant, pain au chocolate, or blueberry muffin). Each morning I ordered two of the first three and had the pastry wrapped up to go. The waffle was fantastic, the oatmeal was nice with the apples, but the yogurt was the plain, unsweetened bitter kind. The pastries were good. And the coffee was great. Service was pretty fast - it's full service sit down, not a buffet or grab n go.\nIn addition to the dirty windows and lack of shampoo, there were a couple of other minor issues during my stay. The toilet seat was coming loose from the toilet (this was fixed) and the light fixture in the bedroom didn't work - though I think this was operator error as I didn't realize there was a master switch near the front door that controlled the bedroom light. At night the whole hotel smells like cooked meat from the restaurant. I mean the whole hotel. I didn't mind the smell but I could totally see it bothering some people. And lastly the gym is pretty sad - two treadmills, an elliptical, and a bike along with some dumbbells, all in an area smaller than my room.\nDespite my list of issues, I really liked the Renwick overall and would definitely stay there again in the future. It has a lot of character (albeit some of the artsy stuff feels a little forced) and is much more interesting than the typical Hilton and like properties in and around Times Square. I loved my suite and the furnishings. Hopefully though next time I'll be able to wash my hair!", "external_links": ["https://static.tacdn.com/img2/x.gif"], "published": "2017-03-29T03:00:00.000+03:00", "crawled": "2017-03-31T17:49:07.848+03:00", "highlightTitle": ""}