{"organizations": [], "uuid": "a21156e0e5e621009e829a54730ed11e74c6d747", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tripadvisor.com", "main_image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/7b/7c/31/hotel-exterior-at-dusk.jpg", "site_section": "https://www.tripadvisor.com/Hotel_Review-g60763-d5786212-Reviews-Hilton_Garden_Inn_New_York_Central_Park_South_Midtown_West-New_York_City_New_York.html", "section_title": "Hilton Garden Inn New York/Central Park South-Midtown West - UPDATED 2017 Hotel Reviews &amp; Price Comparison (New York City) - TripAdvisor", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d5786212-r468698773-Hilton_Garden_Inn_New_York_Central_Park_South_Midtown_West-New_York_City_New_York.html", "country": "US", "domain_rank": 189, "title": "Fantastic place to stay with wonderful staff!!! Highly recommended.", "performance_score": 0, "site": "tripadvisor.com", "participants_count": 2, "title_full": "Fantastic place to stay with wonderful staff!!! Highly recommended. - Review of Hilton Garden Inn New York/Central Park South-Midtown West, New York City, NY - TripAdvisor", "spam_score": 0.0, "site_type": "discussions", "published": "2017-03-19T02:00:00.000+02:00", "replies_count": 1, "uuid": "a21156e0e5e621009e829a54730ed11e74c6d747"}, "author": "HJRN", "url": "https://www.tripadvisor.com/ShowUserReviews-g60763-d5786212-r468698773-Hilton_Garden_Inn_New_York_Central_Park_South_Midtown_West-New_York_City_New_York.html", "ord_in_thread": 0, "title": "Fantastic place to stay with wonderful staff!!! Highly recommended.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Just stayed here for seven nights and again experienced the quality of the hotel and especially it's wonderful team! Special thanks to the amazing Arlene, who we always seen to meet for Check-In/Check-Out and the wonderful Hotel Manager Tracy Kass who sets hospitality standards that are top notch for New York!\nWe stay in New York twice a year and after staying in different properties we became regulars at hotel. This Hilton Garden Inn is ideally located for both business and leisure travelers. Central Park is just a few blocks away and the abundance of subway stations nearby make it very easy to get around.\nThe property is new which gives all public spaces and the rooms a nice fresh and modern feeling. Room sizes are very good for a New York City hotel in this price range. The cleverness of the room design makes optimal use of the available space.\nSome of the room features that should be highlighted are the spacious bathroom with walk in shower, high quality mattress and linens, excellent designer desk chair, high end Samsung HD LCD television with 64 channels, Keurig drip coffee/tea maker, mini fridge and a medium sized micro-wave oven.\nFurthermore the rooms have a very clever in-room safe that opens at the top, instead of the standard high placed ones that open at the front and make you roam around for your belongings in the dark. Each room is equipped with an iron an ironing board. The room climate control is excellent with brand new airconditing/heating units that can be operated individualy.\nThe general room design features nice dark wood tones, integrated art works, tiles in the entry section and designers carpet in the rest of the room. Very handy in this tech era are the many wall outlets. Wifi works well and is complimentary for all guests.\nThe work desk also functions as vanity corner with mirror. A fitting room sized mirror is placed near the entrance and the bathroom features a large lit mirror. Amenities in the rooms are quality products from Neutrogena\nThe biggest surprise for a hotel in the heart of New York City is how quiet the rooms are. This being a brand new building, makes the sound insulation very good. Thick glazing ensures that the noise stays out, even in our room on the second floor.\nWe booked through the Hilton website and choose a King Bed Deluxe Outdoor Terrace Room at the back of the hotel (number 207). The fact that the room is located on the second floor makes it also very easy to just use the stairs instead of the sometimes busy elevators.\nThe hotel has several rooms on the second floor with private walled outdoor terraces, about half the size of the room itself, furnished with garden furnitures. Even room number are located at the front of the building, uneven room numbers at the back. They also have 2 big suites on the 20th floor with huge outdoor terraces. (roughly 500 square feet) with city views. The availability of rooms with a terrace is unique for Manhatten! It's just great to start the day with a fresh cup of coffee on your own terrace surrounded by skyscrapers.\nThe lobby area has a cosy feeling with chairs, couches and a fireplace. Complimentary morning coffee and tea are available from a buffet near the reception. Some nice extra's on the premises are:\n*Concierge desk that can help out with tours and booking\n*Small but well quipped fitness center\n*Business center with computers and printer\n*Guest laundry room with washers and dryers for a small fee per load\n*Mini pantry with a selection of snack, drinks, frozen meals and travel needs\nA very nice breakfast is served in the Empire Bar & Steakhouse next door, featuring a buffet with a good selection of breads, bagels, Danish pastries, yogurts, fruit salad and a hot section with scrambled eggs (plain or with vegetables), a daily changing hot special, pancakes, fried potatoes, bacon, sausages etcetera. A \"make your own waffle\" station is also present. Water, coffee, tea and juices are served and refilled at the table.\nThis being an upmarket and very well designed restaurant, which is also open for lunch & dinner, makes it a very nice setting for the breakfast service. The breakfast buffet is complimentary for HHonors Gold & Diamond members (excluding gratuity), or can be purchased for $22,95. The lunch and dinner menu features a wide selection of quality steaks, fresh seafoods, pasta's and a very impressive wine list, which resulted in multiple awards from Wine Spectator Magazine.\nThe most important thing that should be mentioned is the team! We are really impressed by the friendliness and high service standards of the people who work here. We arrived after midnight, tired from a long flight from Hong Kong and met Arlene again at reception. Her warm welcome and quick check-in lifted our spirits and this wonderful lady turned out to be one of the many great people we met at Reception. Also great Housekeeping, doing a wonderful job in keeping the room perfect, always smiling and cheerful.\nThe manager and staff at the breakfast service are also a real exception to many New York hotels. Very welcoming, friendly and constantly checking if we a needed anything. The best breakfast team that we experienced on many stays in this city.\nSo if you are looking for a great and brand new place to stay in New York City, where the team really makes a difference, this hotel is highly recommended!\nRoom Tip: Terrace rooms on the 2nd floor. See more room tips Green Features: Very active in eco practices. Received multiple certificates for their eco friendly practices.", "external_links": [], "published": "2017-03-19T02:00:00.000+02:00", "crawled": "2017-03-30T01:15:39.354+03:00", "highlightTitle": ""}